[
    {
        "id": 0,
        "Reviewer": "luckylindy",
        "Rating": "2.0 out of 5 stars",
        "Title": "Luckylindy",
        "Date": "Reviewed in the United States on August 31, 2023",
        "Body": "This is like \"as the world turns\" ---a melodrama on steroids. It was also written with too much narration ---not enough description from each of the characters' own voices. In other words,not enough spoken dialogue .Oprah's book club missed the boat on this one.  I gave it two stars only because it shows how all families van love and hurt each other so deeply.",
        "Number": 2
    },
    {
        "id": 1,
        "Reviewer": "Laura H.",
        "Rating": "2.0 out of 5 stars",
        "Title": "Oprah made this a bestseller",
        "Date": "Reviewed in the United States on July 19, 2023",
        "Body": "This book is not worth all the hype. I don't get it. It was so predictable. I had a hard time forcing myself to read it. I saw where the plot was going very early on. This reminds me of a Colleen Hoover book.  A very easy read with a predictable plot. No thanks.  It's also hard to read a book where you don't like the main character. Actually, I couldn't connect with any of the characters but Julia was so especially unlikeable. Completely self absorbed and selfish. I expected more.",
        "Number": 2
    },
    {
        "id": 2,
        "Reviewer": "Siggy.",
        "Rating": "2.0 out of 5 stars",
        "Title": "Disappointed with the ending",
        "Date": "Reviewed in the United States on October 6, 2023",
        "Body": "This started out interesting with tregards to William’s story relating to basketball. The story never really got off the emotional ground and became tedious. I almost gave up on it twice. I was expecting a real emotional tear jerking ending with an in-depth conversation between William and Alice. It just ended flat.",
        "Number": 2
    },
    {
        "id": 3,
        "Reviewer": "Christopher Lord",
        "Rating": "2.0 out of 5 stars",
        "Title": "This is NOT a modern “Little Women”—not by a longshot",
        "Date": "Reviewed in the United States on May 30, 2023",
        "Body": "What false advertising to claim that this is an update on Little Women, when the main protagonist is a dull MALE who somehow manages to fascinate TWO of the sisters over the course of the novel. If you make a claim to update a classic (as in Demon Copperhead, a book I didn’t love for much different reasons), you better have your structure in place and be way female-forward. And I say this as a curmudgeonly old male reader who loves 19th century novels.",
        "Number": 2
    },
    {
        "id": 4,
        "Reviewer": "Mom of young daughter",
        "Rating": "2.0 out of 5 stars",
        "Title": "Seriously overrated book",
        "Date": "Reviewed in the United States on May 5, 2023",
        "Body": "The plot is ridiculous: a young woman who allegedly adores her three sisters realizes she made a mistake in choosing a husband so, unwilling to deal with her husband's mental health crisis, walks out on her entire family.  Then, furious about the relationship one of her sisters (who is, unrealistically, practically beatified) develops with her ex once she's left town, she refuses to maintain contact or allow her daughter to have contact with any of them for more than 20 years.  Oddly -- and unsuccessfully -- the author attempts to portray this detestable character sympathetically.  It's readable, but ultimately unsatisfying.",
        "Number": 2
    },
    {
        "id": 5,
        "Reviewer": "Wool gathering in VT",
        "Rating": "2.0 out of 5 stars",
        "Title": "Disappointing",
        "Date": "Reviewed in the United States on April 1, 2023",
        "Body": "I am frankly amazed at the glowing reviews this book is getting from professional reviewers, other novelists and readers. It is tedious, the plot is poorly paced and the characters are one dimensional. Nothing about this book engaged my imagination. I only persisted in reading it to the end because it was what I brought on vacation. Did Oprah choose this because it is set in Chicago? I expect the theme of recovery from a severe mental health crisis played a part in her choosing it and that aspect of the book is the reason I am giving it two stars rather than the one it otherwise deserves.",
        "Number": 2
    },
    {
        "id": 6,
        "Reviewer": "Deanna Arnold",
        "Rating": "2.0 out of 5 stars",
        "Title": "It went on and on and on….I couldn't finish it.",
        "Date": "Reviewed in the United States on June 3, 2023",
        "Body": "Currently on page 239. Egads. If I have to read one more passage about how holding hands with William made Sylvie all warm inside, I think I might be the one walking into a lake. Well written (except for the author's need to describe the pining Sylvie over and over and over...and the milk toast William who just tood whatever came his way, long suffering....), but looooooooong. So many pages.  And I didn't miss it when I put it down. I don't NOT finish many books, but this was one of them.",
        "Number": 2
    },
    {
        "id": 7,
        "Reviewer": "Mark Rusitzky",
        "Rating": "2.0 out of 5 stars",
        "Title": "Cared about the characters but hated the writing",
        "Date": "Reviewed in the United States on September 1, 2023",
        "Body": "I found this book painfully overwritten. There were so many moments of telling, not showing…and so many moments I cringed or rolled my eyes. I did care about the characters but I couldn’t wait for the book to be over. I baffled by the book’s success.",
        "Number": 2
    },
    {
        "id": 8,
        "Reviewer": "Kimberly",
        "Rating": "2.0 out of 5 stars",
        "Title": "Meh",
        "Date": "Reviewed in the United States on April 22, 2023",
        "Body": "Because Hello Beautiful was Oprah's 100th pick, and I enjoyed Dear Edward, I expected this to be a very satisfying read, but I found it boring from start to finish. The author describes the characters throughout rather than letting their thoughts and actions define them, which may be why they all seemed flat and I felt no connection to any of them. Being one of four sisters myself, I should have related at least to the relationships between the sisters. They are a highly disfunctional family that drags on to include three generations which I should have cared about, but didn't. Wasted time.",
        "Number": 2
    },
    {
        "id": 9,
        "Reviewer": "Anne C",
        "Rating": "2.0 out of 5 stars",
        "Title": "Disappointing story",
        "Date": "Reviewed in the United States on November 11, 2023",
        "Body": "This is a depressing book about dysfunctional people and families who both love and hate each other.",
        "Number": 2
    },
    {
        "id": 10,
        "Reviewer": "Linda L.",
        "Rating": "4.0 out of 5 stars",
        "Title": "Read for Book Club",
        "Date": "Reviewed in the United States on March 22, 2024",
        "Body": "Interesting but not an easy read for me and most likely would not have read on my own.",
        "Number": 4
    },
    {
        "id": 11,
        "Reviewer": "Kathleen Amirault",
        "Rating": "4.0 out of 5 stars",
        "Title": "Families like this one I know.",
        "Date": "Reviewed in the United States on February 25, 2024",
        "Body": "Growing up with three sisters and one brother I can so relate to this book. It is a difficult story of pain, loss and reconciliation but well written and intriguing enough to capture the reader.  It takes us deep into the characters personal transformations and historical celebrations and it surprises you occasionally. I enjoyed it and would recommend it.",
        "Number": 4
    },
    {
        "id": 12,
        "Reviewer": "ayouker",
        "Rating": "4.0 out of 5 stars",
        "Title": "A slow paced read, but heartwarming overall",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "This book is not a page turner by any means. I found myself a little bored at time while reading. The overall story line kept me engaged and I enjoyed reading it overall.",
        "Number": 4
    },
    {
        "id": 13,
        "Reviewer": "J. Dimmett",
        "Rating": "4.0 out of 5 stars",
        "Title": "beautiful :)",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "I felt like the first half of the book was slow. The second half was amazing. The end was truly beautiful.",
        "Number": 4
    },
    {
        "id": 14,
        "Reviewer": "Anna",
        "Rating": "4.0 out of 5 stars",
        "Title": "slow burn",
        "Date": "Reviewed in the United States on December 5, 2023",
        "Body": "Overall I ended up really loving the end of the book and themes conveyed. It took a lot of time to figure out which characters to love and which characters to eventually forgive.However I really struggled with the first 1/3-1/2 of the book. The set up dragged out a bit for me and I was wondering if I would ever finish this book! I just couldn’t fall in love with the main characters and the descriptions of the characters’ lives felt dreary and hard to read. I blazed through the second half surprisingly. If you can get past the first 1/3 I would say it’s worth finishing! A good book for those who want to enter a family and the messiness of it all. It’s filled with a slow drama feel to it through the lens of a handful of characters. I wouldn’t directly parallel it to Little Women, which may have been why I felt led astray in the beginning to be honest.",
        "Number": 4
    },
    {
        "id": 15,
        "Reviewer": "Kindle Customer on the Lake",
        "Rating": "4.0 out of 5 stars",
        "Title": "tugs at the heart",
        "Date": "Reviewed in the United States on January 15, 2024",
        "Body": "This contemporary take on \"Little Women\" tugs at the heart.  Telling the stories that make for a multi-generational, multi-perspective family saga, this book, at its core, looks at what defines a 'family\" - love - while looking at more modern subjects including generational trauma, suicide, prejudice and ignorance.  Loved the way Ann Napolitano weaves everything into a cohesive, beautiful story with relatable characters that seem all too familiar at times.  Definitely a book to read on a long weekend, a vacation, or in a book club.",
        "Number": 4
    },
    {
        "id": 16,
        "Reviewer": "Amazon Customer",
        "Rating": "4.0 out of 5 stars",
        "Title": "nice story- not great, just good",
        "Date": "Reviewed in the United States on February 20, 2024",
        "Body": "Good book-not stellar but worth a read. I give it a B/B plus.  Fast read and easy to follow. Surprised it was an Oprah book.",
        "Number": 4
    },
    {
        "id": 17,
        "Reviewer": "Brenda Smith",
        "Rating": "4.0 out of 5 stars",
        "Title": "Beautiful and heartaching",
        "Date": "Reviewed in the United States on December 7, 2023",
        "Body": "The Padavona sisters all have vastly different personalities; high achieving Julia, bookish romantic Sylvie, artsy and stubborn Cecilia and selfless nurturing Emeline; but their bond is seemingly unbreakable. William Waters, lost and introverted, grew up in a wildly different household, where overwhelming grief over the loss of his sister took hold of his parents’ lives, leaving him to fend for himself.When Julia meets William she is determined to become his wife and create the husband she’s always dreamed of, making him a project of sorts. He isn’t exactly sure where he fits into her plan or her family, and when tragedy strikes, the family’s bond is stretched to its limits.While it is a contemporary take on the classic Little Women, it’s absolutely its own magnificent story. It’s a beautiful but heavy and emotional read as each character’s story unfolds, and your heart aches as you find a place for each of them there.",
        "Number": 4,
        "image_urls": [
            "71+zVTLVTwL._SY88.jpg"
        ]
    },
    {
        "id": 18,
        "Reviewer": "Wendy",
        "Rating": "4.0 out of 5 stars",
        "Title": "Nice story",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "Nice story",
        "Number": 4
    },
    {
        "id": 19,
        "Reviewer": "sabrinaann14",
        "Rating": "4.0 out of 5 stars",
        "Title": "Beautiful Ending",
        "Date": "Reviewed in the United States on January 6, 2024",
        "Body": "It was a bit slow at times and the suddenly sped through many years.  This made some of the characters a bit more surface than I’d like.  BUT the ending was beautiful.  Life is indeed a series of beginnings and endings but those endings don’t cease to exist because their earthly time has been extinguished.  Lovely thoughts on familial relationships and the choices we sometimes make to save the ones we love.",
        "Number": 4
    },
    {
        "id": 20,
        "Reviewer": "Kindle Customer",
        "Rating": "4.0 out of 5 stars",
        "Title": "sisters bond",
        "Date": "Reviewed in the United States on January 22, 2024",
        "Body": "This is a story of how love will always bring you back home. It’s a wonderful example to show the true bond of siblings.",
        "Number": 4
    },
    {
        "id": 21,
        "Reviewer": "Grace E. Caves",
        "Rating": "4.0 out of 5 stars",
        "Title": "interesting tale of family love.",
        "Date": "Reviewed in the United States on January 18, 2024",
        "Body": "Very well and interestingly written. Four sisters with strong personalities and an even stronger love for each other grow and change against a landscape of love and pain.",
        "Number": 4
    },
    {
        "id": 22,
        "Reviewer": "cherstorm",
        "Rating": "4.0 out of 5 stars",
        "Title": "beautiful, like the title",
        "Date": "Reviewed in the United States on January 15, 2024",
        "Body": "Modern Day Little Women.  A beautiful story of life, love, and tragedy. I gave 4 rather than 5 stars because I found the book a bit tedious at the mid point.",
        "Number": 4
    },
    {
        "id": 23,
        "Reviewer": "christopher daniels",
        "Rating": "4.0 out of 5 stars",
        "Title": "Book about family.",
        "Date": "Reviewed in the United States on January 4, 2024",
        "Body": "This is a really well written story that deals with the hardships and complexities of family. The characters are flawed, but also are very strong. It is a heavy story, with many over arching themes such as death, marriage, depression, love, and deception. Really well written, some sentences really stand out beautifully. I enjoyed it!",
        "Number": 4
    },
    {
        "id": 24,
        "Reviewer": "Ashley",
        "Rating": "4.0 out of 5 stars",
        "Title": "Emotional Rollercoaster",
        "Date": "Reviewed in the United States on January 10, 2024",
        "Body": "I had moments where I really liked this book and moments where I was bored. Overall, I think the author really tapped into emotions and made me feel the characters. Some parts felt far fetched but I am glad I read it and I would recommend giving it a shot.",
        "Number": 4
    },
    {
        "id": 25,
        "Reviewer": "Kindle Customer",
        "Rating": "4.0 out of 5 stars",
        "Title": "It drags sometimes",
        "Date": "Reviewed in the United States on January 18, 2024",
        "Body": "Good story. Engaging characters. Repetitive descriptions of events or feelings. It was easy to dislike Rose and Julia at times. The other characters embodied what family should be. Thanks for Kent's continued support.",
        "Number": 4
    },
    {
        "id": 26,
        "Reviewer": "Sherri B. Mcdaniel",
        "Rating": "4.0 out of 5 stars",
        "Title": "Messy families everywhere",
        "Date": "Reviewed in the United States on January 7, 2024",
        "Body": "Started choppy for me. But as the characters developed I felt like the writing did too.I love the idea of the big messy imperfect relationships that truly make up a family.I’m curious about the relationship to Little Women. I might have to finally read that.Started slow but really grew on me!",
        "Number": 4
    },
    {
        "id": 27,
        "Reviewer": "Amy S",
        "Rating": "4.0 out of 5 stars",
        "Title": "good book",
        "Date": "Reviewed in the United States on January 2, 2024",
        "Body": "I really enjoyed this book. I felt like it could have moved a bit faster but over all it was a great read.",
        "Number": 4
    },
    {
        "id": 28,
        "Reviewer": "LindaAudeoud",
        "Rating": "4.0 out of 5 stars",
        "Title": "Uneventful but Surprising",
        "Date": "Reviewed in the United States on January 11, 2024",
        "Body": "This book definitely dragged for much of the time but it pulled together the straggled pieces at the end & what was sad became a loving ending.",
        "Number": 4
    },
    {
        "id": 29,
        "Reviewer": "Bored With Hollywood",
        "Rating": "4.0 out of 5 stars",
        "Title": "Hard to get through some parts",
        "Date": "Reviewed in the United States on August 13, 2023",
        "Body": "I did like this book, but I had to put it down several times because it made me sad. I needed to stop reading for a few hours or even a day so that I could gather myself before continuing. I won’t go into the plot as so many other reviewers already have, but I will say that the characters were richly drawn, and you do eventually care about each and every one. The novel drags a bit, but if you stick with it you’ll discover new and interesting events that hold you to it.  I have to say that the last hour or two of reading will stir up many emotions, and I cried a lot during that time. William’s character is the one that affected me the most, and I don’t think too many people will not be affected by him.  Even through the tears and sadness I experienced reading it, I think it’s worth the read.",
        "Number": 4
    },
    {
        "id": 30,
        "Reviewer": "Just a reader",
        "Rating": "2.0 out of 5 stars",
        "Title": "Boring and Childish",
        "Date": "Reviewed in the United States on February 24, 2024",
        "Body": "After reading 50+ pages, I found this book so boring and childish, I quit reading it.",
        "Number": 2
    },
    {
        "id": 31,
        "Reviewer": "Xandra",
        "Rating": "2.0 out of 5 stars",
        "Title": "Overrated",
        "Date": "Reviewed in the United States on December 29, 2023",
        "Body": "Like Lessons in Chemistry, this is a highly lauded book of recent years that didn't enthrall me. William is poorly drawn and the love among the sisters, while touching, felt forced. I didn't enjoy this at all.",
        "Number": 2
    },
    {
        "id": 32,
        "Reviewer": "Kim",
        "Rating": "2.0 out of 5 stars",
        "Title": "The ending",
        "Date": "Reviewed in the United States on January 7, 2024",
        "Body": "The ending sucked. I was along for the ride until Alice went to meet her dad. Fake. Fake. Fake. Fake.",
        "Number": 2
    },
    {
        "id": 33,
        "Reviewer": "Michael Whitcomb",
        "Rating": "2.0 out of 5 stars",
        "Title": "insipid",
        "Date": "Reviewed in the United States on November 4, 2023",
        "Body": "The outline of the story is compelling, but the characters and their relationships don’t seem real. They make a series of decisions that are implausible based on an amateurish psychology lesson that runs rampant throughout the story. This is an idealized depiction of the sisterhood which gets cloyingly insipid, while brainless, emotionally blocked parents make dumb choices in the treatment of their own children.",
        "Number": 2
    },
    {
        "id": 34,
        "Reviewer": "Patricia Ibarra",
        "Rating": "2.0 out of 5 stars",
        "Title": "Don't waste your time",
        "Date": "Reviewed in the United States on August 26, 2023",
        "Body": "William Walters was always invisible to his parents who never showed any interest in him. When he meets Julia in college, his life would change. He not only became his best friend but also the doors of her family were opened to him and he had great relationships with her two sisters. The three sisters were very different and William found it very difficult to lead a happy life because of all his childhood trauma. i found the book very boring, predictable, and nothing outstanding to speak about. Once again, a best-seller driven by advertising.",
        "Number": 2
    },
    {
        "id": 35,
        "Reviewer": "rw",
        "Rating": "2.0 out of 5 stars",
        "Title": "Slow and no plot, hate this book",
        "Date": "Reviewed in the United States on August 13, 2023",
        "Body": "It is painful to read this book.  I have read a third or more of this book.  I only read it when my kindle battery is dead.  It starts out about a young man and his family life, the girl he meets and then you're off to another character.  There is no plot or direction to this book.  It's like someone giving a description or recap of one character then the next. Waste of money, space and landfill.",
        "Number": 2
    },
    {
        "id": 36,
        "Reviewer": "Scarlett",
        "Rating": "2.0 out of 5 stars",
        "Title": "an Uninspiring story devoid of interesting people.",
        "Date": "Reviewed in the United States on August 13, 2023",
        "Body": "A monotonous psychological saga of 4 sisters that dragged on and on with no excitement, mystery, or interesting plot to support it.  I identified with no one nor did I get emotionally involved or stirred by any of the characters.  Even the end was flat and unsatisfying.  I was so glad when I read the last page and it was finally over.  I am amazed that this was a best seller but the days of Gone With the Wind are really gone.",
        "Number": 2
    },
    {
        "id": 37,
        "Reviewer": "Nan",
        "Rating": "2.0 out of 5 stars",
        "Title": "Hard no--sorry",
        "Date": "Reviewed in the United States on November 5, 2023",
        "Body": "I acknowledge that this writer uses language beautifully, and that she weaves an engrossing story.  But I was so depressed by the poor decisions from these characters, by the wasted relationship s that might have been, that I didn't enjoy it at all.",
        "Number": 2
    },
    {
        "id": 38,
        "Reviewer": "Janessa Christianson",
        "Rating": "2.0 out of 5 stars",
        "Title": "Not a fan of third person narration",
        "Date": "Reviewed in the United States on December 16, 2023",
        "Body": "I am not a fan of third-person narration and find it difficult to read books with that type of narration.",
        "Number": 2
    },
    {
        "id": 39,
        "Reviewer": "Kay",
        "Rating": "2.0 out of 5 stars",
        "Title": "Damaged book",
        "Date": "Reviewed in the United States on January 9, 2024",
        "Body": "Unfortunately the book arrived broken and water damaged.",
        "Number": 2,
        "image_urls": [
            "717wXhj+hSL._SY88.jpg",
            "71JUkzNBw2L._SY88.jpg",
            "71XMxSYoO3L._SY88.jpg",
            "71t681rNVsL._SY88.jpg"
        ]
    },
    {
        "id": 40,
        "Reviewer": "Cher Fillman",
        "Rating": "5.0 out of 5 stars",
        "Title": "Fabulous",
        "Date": "Reviewed in the United States on April 3, 2024",
        "Body": "You will think about this book long after you have read it! It is thought provoking and it will cause you to look for and try to find what are the dysfunctions in your own family.",
        "Number": 5
    },
    {
        "id": 41,
        "Reviewer": "Gina Giacona",
        "Rating": "5.0 out of 5 stars",
        "Title": "A “real” tale of life",
        "Date": "Reviewed in the United States on March 27, 2024",
        "Body": "A thoughtful look at the fragile nature of life & love through the lens of a family. A family with four sisters growing up with love, heartache, dysfunction & normal ups & downs on the roller coaster ride we call life. Very relatable to all.",
        "Number": 5
    },
    {
        "id": 42,
        "Reviewer": "McDoodle",
        "Rating": "5.0 out of 5 stars",
        "Title": "Hope",
        "Date": "Reviewed in the United States on March 30, 2024",
        "Body": "This family will remind readers that there is hope in relationships that seem hopeless.  Opinions generated about characters change with each chapter.  Well worth the time to read.",
        "Number": 5
    },
    {
        "id": 43,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Heartwarming",
        "Date": "Reviewed in the United States on March 8, 2024",
        "Body": "In the beginning it took me time to want to continue to read but I think my turning point was when Julia made these plans for her life and others and felt compelled to be in charge of everything. This book had everything from loss,grief,love,attempted suicide, lies, honesty, and clarity. It really was riveting and really had me feeling things that was relatable. It is never too late to make connections or forgive.",
        "Number": 5
    },
    {
        "id": 44,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "so many tears.",
        "Date": "Reviewed in the United States on March 28, 2024",
        "Body": "I think I’ve given one other 5 star rating in my life. This book was beautiful, whole, + everything I’ve ever wanted in a book.",
        "Number": 5
    },
    {
        "id": 45,
        "Reviewer": "KOD",
        "Rating": "5.0 out of 5 stars",
        "Title": "One of the best books I’ve read",
        "Date": "Reviewed in the United States on March 19, 2024",
        "Body": "I loved the story of these four sisters and how fiercely they loved each other!  It did remind me of “Little Women”, especially with all the sobbing it caused me to do. I highly recommend it!",
        "Number": 5
    },
    {
        "id": 46,
        "Reviewer": "MORRIS A. MICELI",
        "Rating": "5.0 out of 5 stars",
        "Title": "very entwining novel about a family and their lives",
        "Date": "Reviewed in the United States on March 16, 2024",
        "Body": "I liked the book very much. Reading it makes me think about my own family. I was an only child but my mom had 8 brothers and sisters that I was very close to. There were always dramas happening.",
        "Number": 5
    },
    {
        "id": 47,
        "Reviewer": "Mark P.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Buy it!",
        "Date": "Reviewed in the United States on March 25, 2024",
        "Body": "My wife LOVED this book. IT was one of the best she ever read. She hopes they make a movie out of it.",
        "Number": 5
    },
    {
        "id": 48,
        "Reviewer": "K. Mcdermott",
        "Rating": "5.0 out of 5 stars",
        "Title": "just excellent.",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "This is not the type of novel I usually read. But, it was truly a great story of life and love.  I am glad I read, in one day I might add, couldn’t put it down.",
        "Number": 5
    },
    {
        "id": 49,
        "Reviewer": "Dianne",
        "Rating": "5.0 out of 5 stars",
        "Title": "Touching chaos",
        "Date": "Reviewed in the United States on March 8, 2024",
        "Body": "Love is messy, love makes us whole, the more love we give the more we receive, there is no such thing as too much love, Love is the overarching theme of this book. The love of parents, siblings, couples and friends.",
        "Number": 5
    },
    {
        "id": 50,
        "Reviewer": "hermione",
        "Rating": "1.0 out of 5 stars",
        "Title": "worst book I've tried to read",
        "Date": "Reviewed in the United States on May 13, 2023",
        "Body": "This book contrives the plot to fit \"characters\"  instead of the other way to build a story...this seems to be the new \"novel\" way to write fiction? These characters exist in this book but there is no substance to why and who they are, it is obvious from the start that there is going to be \"startling\" behavior coming up but the why, the depth, is missing. Let me go back to the books of my earlier life and get back to reading about real people who have real reasons for their story. If I could give this book a minus instead of a 1 would.",
        "Number": 1
    },
    {
        "id": 51,
        "Reviewer": "MB",
        "Rating": "1.0 out of 5 stars",
        "Title": "Trite",
        "Date": "Reviewed in the United States on January 16, 2024",
        "Body": "If Hallmark Cards wrote books, this would be one of them. Predictable plot and characters, sentimentality abounds. Tedious to get through.",
        "Number": 1
    },
    {
        "id": 52,
        "Reviewer": "TEK",
        "Rating": "1.0 out of 5 stars",
        "Title": "Exactly what all the other one star reviews state",
        "Date": "Reviewed in the United States on June 27, 2023",
        "Body": "In a word, trite.Flat, one dimensional characters, who are not at all brought to life.  I’m perplexed and troubled by how many good reviews this book has gotten.  I’ve never read anything else by Ann Napolitano, but after reading this, I’m baffled that she is an established author. This seems like it could have been written by a teenager.  There was zero emotional resonance for me. After a certain point I just skimmed the pages to get through it, thinking “blah blah blah”.  Wish I hadn’t wasted my money and time.",
        "Number": 1
    },
    {
        "id": 53,
        "Reviewer": "jlo5",
        "Rating": "1.0 out of 5 stars",
        "Title": "Never goes anywhere.",
        "Date": "Reviewed in the United States on August 3, 2023",
        "Body": "I tried so hard to finish this book but just could not. I kept hoping it would have something to say but it just kept repeating and never had any depth to its characters. I have sisters and I was hoping for some connection with the women in this book and my life but not a chance. These women lived in my time span near my hometown but it felt like they were in 1920. I kept trying to picture the timeframe with the story line and it never felt connected.",
        "Number": 1
    },
    {
        "id": 54,
        "Reviewer": "Hrafnhildur Ragnarsson",
        "Rating": "1.0 out of 5 stars",
        "Title": "Boring",
        "Date": "Reviewed in the United States on January 20, 2024",
        "Body": "I didn’t like the book at all , so boring and uninteresting",
        "Number": 1
    },
    {
        "id": 55,
        "Reviewer": "RPO",
        "Rating": "1.0 out of 5 stars",
        "Title": "Boring until the last 10 chapters",
        "Date": "Reviewed in the United States on June 15, 2023",
        "Body": "I did not have any connection with these characters. I think it is a poorly written book as was Dear Edward!  Who knew that it was really about a broken basketball player? Wanted to skip to the end with both of these books!  This is not Literary Fiction at its best. If I had known these two books were by the same author I would not have purchased this one. Did I cry at the end, YES. But I cry at stupid movies also!",
        "Number": 1
    },
    {
        "id": 56,
        "Reviewer": "maddy2773",
        "Rating": "1.0 out of 5 stars",
        "Title": "Book Pages Torn and Bent",
        "Date": "Reviewed in the United States on August 2, 2023",
        "Body": "I just received it last night and opened it this morning into my disappointment. The first pages are bent and torn. I am unlike others that I like to buy my books because I like to keep what I read (I do not rent from the library) and I handle them w/ care. To me this is unacceptable and I need a new book without these damages.And I need it for my book clb",
        "Number": 1,
        "image_urls": [
            "613TMmbcxDL._SY88.jpg",
            "712IvurmCRL._SY88.jpg"
        ]
    },
    {
        "id": 57,
        "Reviewer": "Change Agent Des",
        "Rating": "1.0 out of 5 stars",
        "Title": "Disappointing: Strong start. Laborious, Predictable Pivot. Cheap, Unsatisfying Ending. Waste of Time",
        "Date": "Reviewed in the United States on September 19, 2023",
        "Body": "After a strong start, the author took nearly 200 pages to make a painful, predictable pivot.  Then, as though she was “on deadline” to finish the book, Napolitano wraps things up with a cheap, unsatisfying ending.  Ann Napolitano is no Ann Patchett, that’s for sure.  A waste of my time.",
        "Number": 1
    },
    {
        "id": 58,
        "Reviewer": "Amazon Customer",
        "Rating": "1.0 out of 5 stars",
        "Title": "The cover was torn",
        "Date": "Reviewed in the United States on December 12, 2023",
        "Body": "I had planned to give this book as a gift but will just keep it as it was not in a presentable condition to gift.",
        "Number": 1
    },
    {
        "id": 59,
        "Reviewer": "Amazon Customer",
        "Rating": "1.0 out of 5 stars",
        "Title": "Repetitive and boring",
        "Date": "Reviewed in the United States on September 24, 2023",
        "Body": "This book should have been edited down to remove some of the hundreds of repetitions old the same themes. I kept reading it, looking for the reasons the book is on so many recommended reading lists, but, throughout, I was bored and disappointed.",
        "Number": 1
    },
    {
        "id": 60,
        "Reviewer": "puzzle mom",
        "Rating": "3.0 out of 5 stars",
        "Title": "Oh where to begin. —-DO NOT READ SPOILERS AHEAD",
        "Date": "Reviewed in the United States on December 15, 2023",
        "Body": "I am one of 4 sisters and life isn’t exactly like this.  We were @ 5 years after their post but…….thending about sent me over the edge.  So,,,,, you decide you have met your dream husband.  Then you get pregnant, have a baby, get divorced and stay in NYC.  Of course after the divorce ,your husband ,meets his dream lover- your sister.  So…. Your husband and sister are married and then sister dies.  His exwife- his sister in law- comes back into his life……ugh",
        "Number": 3
    },
    {
        "id": 61,
        "Reviewer": "Elizabeth J.",
        "Rating": "3.0 out of 5 stars",
        "Title": "Puzzler",
        "Date": "Reviewed in the United States on January 4, 2024",
        "Body": "I had a hard time with this book.  Despite it being very successful I waited a long time to read it. I know it's a novel  but it just didn't click or ring true. I could hardly wait until it was over.",
        "Number": 3
    },
    {
        "id": 62,
        "Reviewer": "Chere Conner",
        "Rating": "3.0 out of 5 stars",
        "Title": "Sooooo predictable",
        "Date": "Reviewed in the United States on April 14, 2023",
        "Body": "I will start by saying I have not quite finished the book, but I cannot believe this is an Oprah pick.  It is engaging enough that I will finish it, but also so predictable and some of it is flat out unbelievable.  William's parents are so devastated by losing their other child that they develop full on hatred towards William.  Rose refuses to speak to her daughter for following in Rose's own footsteps.  At the beginning of the book all she cared about was making sure her girls were strong, educated, self-sufficient women and then boom, suddenly decides she does not need them in her life and moves away.  The biggest disappointment of all though is the ridiculous \"powerful love story\" between William and Sylvie which you could see coming from a mile away although not for any reason that made sense.  He tries to kill himself, she decides at that moment she is in love, they have nothing in common and nothing about their dreary little lives feels big or important, it just seems like two sad people who found and clung onto each other.  And then of course we get the answer to the question I knew to expect from the beginning.  Which of these not very exciting characters will die to pull at our heart strings.  Eye roll.",
        "Number": 3
    },
    {
        "id": 63,
        "Reviewer": "Brooklyn Grl",
        "Rating": "3.0 out of 5 stars",
        "Title": "ok but too Hallmark moments for me",
        "Date": "Reviewed in the United States on December 26, 2023",
        "Body": "It was nicely written in places, but I didn’t find the plot believable or many of the characters likable or fleshed out enough to be interesting. I got bored half way through and kept envisioning it written as if it was intended to be a Hallmark movie: superficial, overwrought, emotionally manipulative, predictable, and melodramatic.",
        "Number": 3
    },
    {
        "id": 64,
        "Reviewer": "Ann E. Duffy",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not great",
        "Date": "Reviewed in the United States on January 22, 2024",
        "Body": "I had high hopes but the story was strange, the main male character kept crying and all the sisters slept entwined. Not my cup of tea.",
        "Number": 3
    },
    {
        "id": 65,
        "Reviewer": "Shud49",
        "Rating": "3.0 out of 5 stars",
        "Title": "William comes from a loveless childhood and family.",
        "Date": "Reviewed in the United States on January 3, 2024",
        "Body": "He meets and falls for Julia. Her grandiose plans will bring him all the happiness he will ever need, right?Liked, but did not love this book.",
        "Number": 3
    },
    {
        "id": 66,
        "Reviewer": "Dorothy Branch",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not As Interesting As  Expected",
        "Date": "Reviewed in the United States on January 15, 2024",
        "Body": "I can relate to this somewhat, but it is not my favorite book. It is not as well written as I expected.",
        "Number": 3
    },
    {
        "id": 67,
        "Reviewer": "Peggy G.",
        "Rating": "3.0 out of 5 stars",
        "Title": "Low on character development",
        "Date": "Reviewed in the United States on January 10, 2024",
        "Body": "I Didn’t care for the repetitive memories that just seemed to say the same thing over and over and over.",
        "Number": 3
    },
    {
        "id": 68,
        "Reviewer": "Sue",
        "Rating": "3.0 out of 5 stars",
        "Title": "Book club book",
        "Date": "Reviewed in the United States on January 24, 2024",
        "Body": "We rated it a 3 out of 5.It read like a soap opera.",
        "Number": 3
    },
    {
        "id": 69,
        "Reviewer": "AndrewHall MarthaRyan",
        "Rating": "3.0 out of 5 stars",
        "Title": "Highs and a low",
        "Date": "Reviewed in the United States on December 24, 2023",
        "Body": "Hello Beautiful is a contradiction. The last two chapters are fabulous! The beginning ones are good. The middle however, well, just skim the middle of this book. There is slows to a such a standstill that I stopped reading this book. Almost a DNF, but am glad I finally returned to it. Wonderfully written ending.",
        "Number": 3
    },
    {
        "id": 70,
        "Reviewer": "seniorchoice",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not all that great",
        "Date": "Reviewed in the United States on September 8, 2023",
        "Body": "Because it’s an Oprah book choice, a Barack Obama favorite, and highly praised by Washington Post and New York Times critics, I couldn’t wait to read Hello, Beautiful. After all I loved Napolitano’s Dear Edward and Hello, Beautiful has been called a “homage to Louisa May Alcott’s timeless classic” Little Women. That’s just plain wrong. It’s not even in the same stratosphere as that beloved book. While I like Little Women, I don’t love it like my daughter-in-law does. After being disappointed, I passed my copy of Hello, Beautiful to her to see what I was missing. She agreed it was similar in that it was a family saga about four very close sisters and the young man who comes into their lives, but it should not be compared to Little Women. My daughter-in-law gave it only 2 stars out of 5. We both agreed that in a large part of the book, particularly the middle, readers spend too much time inside the minds of the characters. As another critic explained Napolitano needs to show us, not tell us. Because of this, the novel became repetitive and kind of a slog fest. The book is not horrible, but it’s not the great book I expected.",
        "Number": 3
    },
    {
        "id": 71,
        "Reviewer": "Avid Reader",
        "Rating": "3.0 out of 5 stars",
        "Title": "Disappointed",
        "Date": "Reviewed in the United States on February 3, 2024",
        "Body": "Really wanted to like this book after all the hoopla but the characters were weak and not believable. The main character of the book William was almost invisible throughout. The author gave us no ending , as if she just stopped writing and walked away.",
        "Number": 3
    },
    {
        "id": 72,
        "Reviewer": "Cube trunks",
        "Rating": "3.0 out of 5 stars",
        "Title": "Writing is slow and tedious",
        "Date": "Reviewed in the United States on February 12, 2024",
        "Body": "This book has many great quotes to reflect on. The writing is stylish, though slow and tedious. The story really doesn’t get going until the last quarter. I think you could skip to the halfway point and miss nothing at all.",
        "Number": 3
    },
    {
        "id": 73,
        "Reviewer": "Susan M F C",
        "Rating": "3.0 out of 5 stars",
        "Title": "In depth study of a family of sisters",
        "Date": "Reviewed in the United States on September 28, 2023",
        "Body": "This is an incredibly thorough look into the minds and workings of a family of four sisters growing up in Chicago late -mid 20th century (prior to the tech boom).  I liked the writing style which  easily drew me into the character's psyches and I was quickly hooked on wanting to know what would happen to them.  The oldest sister is intent on mapping her future, like a scientist with laser- focused determination and wearing blinders. We learn about each character via chapters told from first-person perspective.This book is a deep character study of a family, with so little plotline beyond that of how they grow as they age and what happens to them as a result of their personal and conjoined perspectives that  I eventually grew weary of the narrow focus, so rich in character but lacking in the other elements that make a book interesting to me; action, setting, place.  As others have mentioned the middle of the book gets too bogged down in head-game thinking/telling.Half a star for NOT writing politics into the narrative as so many authors are prone to do today.  This reader/reviewer is begging them to please stop doing that.",
        "Number": 3
    },
    {
        "id": 74,
        "Reviewer": "Jen",
        "Rating": "3.0 out of 5 stars",
        "Title": "Too long",
        "Date": "Reviewed in the United States on February 3, 2024",
        "Body": "Cut 100 pages out, and you could have the same story. It was most annoying to read. But I had to for a bookclub. Most of the characters needed a smack across the back of the head.",
        "Number": 3
    },
    {
        "id": 75,
        "Reviewer": "Hannah Keller",
        "Rating": "3.0 out of 5 stars",
        "Title": "3 stars for me",
        "Date": "Reviewed in the United States on February 3, 2024",
        "Body": "Im giving myself 3 stars for finishing this book even though i got stuck during the second third of the book and wanted to quit. Way to go Hannah for finishing.",
        "Number": 3
    },
    {
        "id": 76,
        "Reviewer": "Angela Harris",
        "Rating": "3.0 out of 5 stars",
        "Title": "Great ending... long read",
        "Date": "Reviewed in the United States on February 11, 2024",
        "Body": "I enjoyed the storyline but felt like a lot of the details within the story were drawn out way too much.",
        "Number": 3
    },
    {
        "id": 77,
        "Reviewer": "Stacey J. Miller",
        "Rating": "3.0 out of 5 stars",
        "Title": "Sorry, Oprah. Not this time.",
        "Date": "Reviewed in the United States on April 5, 2023",
        "Body": "As a bibliophile, I've always appreciated Oprah's Book Club selections. I haven't wholly shared her taste in books, but I've always looked forward to seeing book recommendations from a smart, literate thought leader.Wow. Oprah and I surely weren't on the same page this time.‎Ann Napolitano is a highly skilled writer. Her words exude warmth and empathy, and her characters -- major and minor -- spring to life. I would have given her 5 stars for drawing me into the characters' inner lives and making me root for a more compelling plot, but I ended up hard-pressed to justify giving it 3 stars.Somehow, I just found this book difficult to wade through. I couldn't stay focused on the story. It wasn't the sudden onset of an attention span issue or cognition problem for me. Perhaps I was a bit distracted because of a huge breaking national news story--but, heck, we always have huge breaking national news stories, don't we? This just about never happens to me.But I failed to buy into the narrative. The characters were real, and there was character development, but it took too much time and provided almost no satisfaction by the time it happened. I forced myself to finish the book only because I felt that the payoff may have been worth it.It wasn't. For those who started to read the book, I want to warn you that there's no light at the end of the tunnel. For me, the time I invested in finishing this book would have been far better spent in joyfully reading other works. YMMV, of course.By the way, I loved \"Dear Edward,\" by the same author. So I'd probably read another book that she wrote. But, likely, I\"d borrow it from the library instead of purchasing it.",
        "Number": 3
    },
    {
        "id": 78,
        "Reviewer": "Wanetta",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not as good as expected",
        "Date": "Reviewed in the United States on February 6, 2024",
        "Body": "It was worth the read but not on the top of the list",
        "Number": 3
    },
    {
        "id": 79,
        "Reviewer": "Janet J.",
        "Rating": "3.0 out of 5 stars",
        "Title": "my opinion: just ok",
        "Date": "Reviewed in the United States on January 21, 2024",
        "Body": "I might be an outsider on this. I really didn’t care for this much. Several characters were not well developed and some of the characters like Rose and Julia were just very unlike able to me. I also didn’t care for the unreal relationship between the girls. I don’t regret reading but I wouldn’t strongly recommend.",
        "Number": 3
    },
    {
        "id": 80,
        "Reviewer": "Amazon Customer",
        "Rating": "1.0 out of 5 stars",
        "Title": "The physical book (not the content) is terrible",
        "Date": "Reviewed in the United States on January 27, 2024",
        "Body": "Video Player is loading.Play VideoPlayMuteCurrent Time 0:00/Duration 0:13Loaded: 46.20%0:00Stream Type LIVESeek to live, currently behind liveLIVERemaining Time -0:13 1xPlayback RateChaptersChaptersDescriptionsdescriptions off, selectedCaptionsCaptions off, selectedEnglishAudio Trackdefault, selectedFullscreenThis is a modal window.\n\n\nThis book is not worth $1. It looked like a toddler cut the pages and pasted them upside down in the cover. I just started reading it and it seems all the pages are there but it wouldn’t surprise me if there were. $15 for this crap",
        "Number": 1,
        "image_urls": [
            "714S+DEvCNL._SY88.jpg"
        ]
    },
    {
        "id": 81,
        "Reviewer": "mary zarate",
        "Rating": "1.0 out of 5 stars",
        "Title": "OILY SUBSTANCE ON BOOK AND COVER",
        "Date": "Reviewed in the United States on February 27, 2024",
        "Body": "I ordered a new book and it came with an oily substance all over cover and outer part of book.",
        "Number": 1,
        "image_urls": [
            "618LxshUddL._SY88.jpg",
            "61BLGiB22NL._SY88.jpg"
        ]
    },
    {
        "id": 82,
        "Reviewer": "Redhead",
        "Rating": "1.0 out of 5 stars",
        "Title": "overstuffed",
        "Date": "Reviewed in the United States on February 2, 2024",
        "Body": "How did this get to be a bestseller?  It was a soap opera.  Unnecessary exposition.  Not enough character development to make you care about what happened.",
        "Number": 1
    },
    {
        "id": 83,
        "Reviewer": "jhale",
        "Rating": "1.0 out of 5 stars",
        "Title": "For the life of me…",
        "Date": "Reviewed in the United States on August 30, 2023",
        "Body": "I can’t even believe this book was published.  This is probably the worst writing I have ever experienced.  This author should teach “tell” writing versus “show” writing.  This book should be used by English teachers worldwide on how NOT to write.  The author decides how the readers will collectively feel and react to the characters and their insipid, incomprehensible actions and thoughts.  No character can be differentiated from another except by the author telling the reader obscure facts that lend no depth or interest to any of them.  A remarkable failure.",
        "Number": 1
    },
    {
        "id": 84,
        "Reviewer": "JE  Grossman",
        "Rating": "1.0 out of 5 stars",
        "Title": "Boring",
        "Date": "Reviewed in the United States on January 11, 2024",
        "Body": "This was one of the worst books I’ve ever read…. So many glowing reviews! I kept reading and reading waiting for it to develop…. I would even be embarrassed to give to someone. I’m only giving 1 star because I must. In the positive, the book arrived in time.",
        "Number": 1
    },
    {
        "id": 85,
        "Reviewer": "Caitenonymous",
        "Rating": "1.0 out of 5 stars",
        "Title": "Clunky and awkward",
        "Date": "Reviewed in the United States on December 14, 2023",
        "Body": "It seemed that the author was trying too hard, like a bad singer trying to reach a high note. Another reviewer said all tell, no show and I agree. The only reason I stuck with it was because it seemed interesting at first and I almost never abandon a book.",
        "Number": 1
    },
    {
        "id": 86,
        "Reviewer": "Kathleen",
        "Rating": "1.0 out of 5 stars",
        "Title": "Written for an adolescent",
        "Date": "Reviewed in the United States on December 28, 2023",
        "Body": "I rarely abandon a book but I could not get beyond the first few chapters.  I felt like I was reading a YA book. Boring, flat, trite characters. Simplistic bland writing style. Not worth the money.",
        "Number": 1
    },
    {
        "id": 87,
        "Reviewer": "books2bless",
        "Rating": "1.0 out of 5 stars",
        "Title": "\"Oprah, you're not making sense to me this time.",
        "Date": "Reviewed in the United States on March 19, 2023",
        "Body": "I read the book cover to cover.Personally, I found the characters to be flat and the dialogue predictable. The storylines were familiar.Each of the characters followed a familiar line of shallow development.Even the \"let's wrap this book up\" ending was laid out with out fanfare.I kept waiting for the \"wow factor,\" or the \"I didn't see that coming,\" but it never developed; nothing like that occurred.For me, every aspect of the book was flat.The hype around this book alludes me.  I cannot figure it out.\"Oprah, you're not making sense to me this time.\"",
        "Number": 1
    },
    {
        "id": 88,
        "Reviewer": "K99JS06",
        "Rating": "1.0 out of 5 stars",
        "Title": "Terrible writing, meh story",
        "Date": "Reviewed in the United States on December 4, 2023",
        "Body": "Awful characters. I didn’t care about any of them. None of them grew at all or dealt with their problems with one or two exceptions. So many cliches. Writing was forgettably mediocre. Where were the editors? Why in the world was it so long and did the perspectives and time period change with every chapter. Served no purpose. Had to read for book club, or wouldn’t have finished.",
        "Number": 1
    },
    {
        "id": 89,
        "Reviewer": "Anne Brobeck",
        "Rating": "1.0 out of 5 stars",
        "Title": "Boring Book",
        "Date": "Reviewed in the United States on January 21, 2024",
        "Body": "This was probably one of the most boring and slow moving books that I have ever read.  Waste of money.",
        "Number": 1
    },
    {
        "id": 90,
        "Reviewer": "under the radar dot com",
        "Rating": "5.0 out of 5 stars",
        "Title": "Hello, beautiful!",
        "Date": "Reviewed in the United States on March 14, 2023",
        "Body": "HELLO BEAUTIFULAnn NapolitanoWhen I turned my eBook to page one, I said aloud “HELLO, BEAUTIFUL!”I knew from page one that I was in for a good time what I did not know was how much I’d enjoy this book and the process of reading it and I certainly didn’t know I had found a new favorite author.In Hello Beautiful we start with William. William was born to a family suffering a great loss. And even in the first few pages with William, we come to know him in all that he isn’t instead of what he is. It’s an interesting way to construct a character.In the next chapter, we meet Julia and all that she is and all that she has. She is a lot, has a lot. Specifically, things that William does not. She has a close, loving family, and she has a plan and the will to carry it out.William and Julia meet in college and begin a wonderful life together. We follow over the years as eventually, William's past comes to light and the very thing that drew them together threatens to tear them apart.I read this one towards the end of 2022 and had to hold onto this review for over six months. It was torture. It was one of the best books I read last year, and I can’t wait for you to read it. It would make a great book club selection as there would be a lot to discuss. I imagine readers on opposing sides of imaginary lines, arguing their point. And they would both be right. That is the beauty of this book.Let’s talk about what I especially liked about it.The first thing I loved and noticed was the sentence structure. There is a pattern to the structure that creates a rhythm that increases reading enjoyment. Essentially it is very easy to read.The second thing I loved is what I noted previously. I loved how William was constructed as a character. His pages felt vacuous. As if I were leaving a part of myself there with him on every page. There is a scene early on when William is describing a moment with a professor. That passage is so telling of William and his lens for seeing his world and interacting with it.The third thing I loved was the number of emotions that were stirred within me. I don’t remember the last time I was angry with a fictional character. It’s been six months and I still disagree with some of the characters' choices.Although this was a five-star read for me I do want to note how critical the writing is. These characters are beautifully imperfect, and the narrative, no matter the character, was severe in correction. This can lead to a lack of empathy toward the characters and their situation. It didn’t affect me much, but I think readers should be aware of that going in.HELLO BEAUTIFUL comes out on March 14, 2023, and I highly recommend it.Now an Oprah Book Club pick for March 2023HELLO BEAUTIFUL…⭐️⭐️⭐️⭐️⭐️Thanks to Random House Publishing Group - Random House, The Dial Press for the advanced copy!",
        "Number": 5
    },
    {
        "id": 91,
        "Reviewer": "loveagoodstory",
        "Rating": "5.0 out of 5 stars",
        "Title": "A very thoughtful book",
        "Date": "Reviewed in the United States on February 8, 2024",
        "Body": "This is a different kind of read for me but it kept my attention from the beginning. The characters are very deep and well developed. The way the author explains their thoughts and feelings is magnificent! The characters evolve, with all of their flaws and choices as part of who they are, making them the people they become. The depth of the family connection plays such a part in who they are and the author explains this in a comprehensive way, making the story come full circle. It’s a story of real people who make real choices, right or wrong, based on their own beliefs. Five stars!",
        "Number": 5
    },
    {
        "id": 92,
        "Reviewer": "Joy Stokes",
        "Rating": "5.0 out of 5 stars",
        "Title": "Beatiful!",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I never review books but this story is a rarity. I loved every word and it is so beautifully written, I didn't want it to end. It will be on my list of top 5 favorite books.",
        "Number": 5
    },
    {
        "id": 93,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Beautifully written",
        "Date": "Reviewed in the United States on March 19, 2024",
        "Body": "One of my favorite reads in a long time and excited to have found a new author! Definitely recommend!",
        "Number": 5
    },
    {
        "id": 94,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Page Turner",
        "Date": "Reviewed in the United States on March 28, 2024",
        "Body": "This is an excellent read.",
        "Number": 5
    },
    {
        "id": 95,
        "Reviewer": "Laurie Woodard",
        "Rating": "5.0 out of 5 stars",
        "Title": "I haven’t cried in so long!",
        "Date": "Reviewed in the United States on March 16, 2024",
        "Body": "So good! Well written and heart felt. I felt like I could picture the different characters.Definitely a worthwhile read!",
        "Number": 5
    },
    {
        "id": 96,
        "Reviewer": "Racy Tracy",
        "Rating": "5.0 out of 5 stars",
        "Title": "Sad and Beautiful",
        "Date": "Reviewed in the United States on March 5, 2024",
        "Body": "Hello Beautiful is sad and beautiful at the same time. Throughout the twists and turns, love is the recurring theme. Family is also a theme, as it weaves itself through the years and back again. A thoughtful and mindful book. Excellent for Bookclubs.",
        "Number": 5
    },
    {
        "id": 97,
        "Reviewer": "Ricki",
        "Rating": "5.0 out of 5 stars",
        "Title": "My new favorite!",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "I love this book so much. I couldn't stop reading & I feel sad that it's over. I felt so close to all of the characters & their journeys. I admire all of them & I'm going to miss them terribly.",
        "Number": 5
    },
    {
        "id": 98,
        "Reviewer": "Debbie Clark",
        "Rating": "5.0 out of 5 stars",
        "Title": "Beautiful Story",
        "Date": "Reviewed in the United States on February 22, 2024",
        "Body": "At the beginning, I would set the book aside and I think it was because I could feel the heaviness of the words which were to come. Then I couldn’t read it fast enough and I didn’t want the book to end. It’s a story of family, love, loss and forgiveness. “Hello Beautiful”",
        "Number": 5
    },
    {
        "id": 99,
        "Reviewer": "JessLove",
        "Rating": "5.0 out of 5 stars",
        "Title": "required. reading for sisters",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I’m amazed that anyone can capture the essence of sisterhood.  As I read this book I saw my sisters weaving in and out.  Lovely",
        "Number": 5
    },
    {
        "id": 100,
        "Reviewer": "Kelly",
        "Rating": "1.0 out of 5 stars",
        "Title": "So Disappointing",
        "Date": "Reviewed in the United States on January 13, 2024",
        "Body": "I almost never give up on a book, but this author has zero ability to accuratelydescribe setting. I can understand why she literally had to write the dates at the beginning of every chapter because the setting didn’t in any way reflect the time period.In 1997, Alice and her friend were singing along to records? Really? They didn’t have CDs? Was the author alive in 1997?When Alice is in college in the early 2000s and searches for her aunt’s artwork, the author doesn’t even mention the internet. I understand not dwelling on it, but surely there are relevant implications about the ease of uncovering secrets in a world that is suddenly so much more connected than it has ever been before.Ultimately I gave up after the Alice chapter that ends in 2003. You mean to tell me in 2001, Alice is in Boston, and her mother is in New York, and the author was in no way compelled to even mention 9/11? At all? Wouldn’t that have been a very real driver for the sisters to contact Julia to maybe, I don’t know, find out if she was even alive? Or did they just shrug and sit around hoping for another postcard?The next chapter skips to 2008, and I don’t see any point in continuing. Maybe this book is set in an alternate reality version of the 1980s-2000s that never evolved beyond the 1950s, but I can’t suspend my disbelief enough to make this book believable.Oprah failed me this time.",
        "Number": 1
    },
    {
        "id": 101,
        "Reviewer": "cheetos",
        "Rating": "1.0 out of 5 stars",
        "Title": "shallow and pseudo",
        "Date": "Reviewed in the United States on March 20, 2024",
        "Body": "I really disliked this book.  None of the family relationships were believable.  Many scenes that were supposed to be pivotal had no depth and little meaning.  For example: William and Sylvia on a bench.  What happened?  She was sad.  He was sad.  I had to go back and reread this scene.  Nothing.  The author's writing style is terrible - full of pseudo psychology.  And her work is sprinkled with absurd metaphors.  Example: The sisters have avoided touching  because \"It was the bumpers on the strange bowling alley they were playing within\".",
        "Number": 1
    },
    {
        "id": 102,
        "Reviewer": "Jane M.",
        "Rating": "1.0 out of 5 stars",
        "Title": "Can't Believe This Was An Oprah Pick",
        "Date": "Reviewed in the United States on February 16, 2024",
        "Body": "I was really disappointed in this book.  I picked it because I enjoyed Dear Edward and I am a fan of Oprah's book club.  Unfortunately, not this time.  I did not think the characters were developed at all and I was rolling my eyes at some of the thoughts and unbelievable things in the characters lives that were never developed.  As far as William's childhood I could understand why his parents were traumatized by the loss but it sounds like William raised himself. Really?? They never heard from them again after they didn't go to the wedding and just sent a check??  I could go on and on by the loose ends in this novel.  I finished it but really couldn't wait for it to end.",
        "Number": 1
    },
    {
        "id": 103,
        "Reviewer": "Michael Vogel",
        "Rating": "1.0 out of 5 stars",
        "Title": "terrible book with a simple non developed story",
        "Date": "Reviewed in the United States on March 26, 2024",
        "Body": "The story wants to imitate \"little women\" where tragedy struck a family. There is no development of characters or actual engaging quality story to follow.If you like quality writing and not the typical airport style reading this is not your book.",
        "Number": 1
    },
    {
        "id": 104,
        "Reviewer": "B. Pedit",
        "Rating": "1.0 out of 5 stars",
        "Title": "I don't get it",
        "Date": "Reviewed in the United States on March 13, 2024",
        "Body": "I don't understand the popularity of this book or how it gets so highly reviewed. It started out well but then turned into some modern version of Little Women. Full disclosure, I only read about 20% so maybe it gets better.",
        "Number": 1
    },
    {
        "id": 105,
        "Reviewer": "Satish Joshi",
        "Rating": "1.0 out of 5 stars",
        "Title": "Mediocre prose and bad characters",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "Somehow manages to be a prime example of both men writing women and women writing men. Can’t go ten pages without mentioning the 6ft 7 brooding man or the heavy breasts of the heroine. Bored out of my mind within the first 6 pages and struggled to finish the book. Not remotely realistic (this genre is supposed to be realistic). Straight into the dustbin",
        "Number": 1
    },
    {
        "id": 106,
        "Reviewer": "Pilar Rueda",
        "Rating": "1.0 out of 5 stars",
        "Title": "Not worth the time",
        "Date": "Reviewed in the United States on February 26, 2024",
        "Body": "I didn't like the tone of the book - depressive, hopeless, indifferent, empty. I read 45% of the book hoping that it would get better and it didn't. Also, the characters didn't develop and it was hard to connect to anyone.",
        "Number": 1
    },
    {
        "id": 107,
        "Reviewer": "A. lopez",
        "Rating": "1.0 out of 5 stars",
        "Title": "Superficial and a waste of time",
        "Date": "Reviewed in the United States on January 5, 2024",
        "Body": "I am shocked that this book has received such great reviews.  It reads as if it was written by a teenager.  The plot is banal, the writing is overly sentimental and repetitive, and the story is just plain scholck.  I managed to read until page 220 and then I just had to quit.  The characters lack any depth and you just don't really care about any of it by midway through the book.",
        "Number": 1
    },
    {
        "id": 108,
        "Reviewer": "Kate",
        "Rating": "1.0 out of 5 stars",
        "Title": "Uncreative story",
        "Date": "Reviewed in the United States on February 16, 2024",
        "Body": "Tedious reading,  boring story line,  trendy topics.  I read the first several chapters and then the last one to find out  how it ended.",
        "Number": 1
    },
    {
        "id": 109,
        "Reviewer": "anonymous",
        "Rating": "1.0 out of 5 stars",
        "Title": "Stuck this one out...",
        "Date": "Reviewed in the United States on January 23, 2024",
        "Body": "Sorry to give a negative review but I did not find this book remotely enjoyable. Shallow characters to match the shallow storyline which was painfully dragged out. Repetitive and rambling. Quite surprised this was one of Oprah's picks.",
        "Number": 1
    },
    {
        "id": 110,
        "Reviewer": "Bookworm",
        "Rating": "3.0 out of 5 stars",
        "Title": "Disappointed ---characters simply not authentic",
        "Date": "Reviewed in the United States on March 22, 2023",
        "Body": "I bought hardcover & Kindle editions on day of release after seeing Oprah rave about it on CBS. What I appreciate most with Oprah's fiction picks is the selections tend to be a cut above (i.e. more literature) than morning show or other celeb book clubs. (I esp enjoyed Oprah's early picks back in late 90s.) I'm sad to report this was a big miss for me. Having been raised with 4 sisters in blue-collar Chicago, I thought it'd be a slam dunk, but I went from being underwhelmed to disappointed to annoyed. Pains me to write a mediocre review as author likely poured her heart and soul into it, but imo this book needed another year editing and revising, as this just wasn't there yet. A few specifics:* I applaud author for attempting to give characters depth & complexity but she violated basic rule of show, don't tell. Too much of the characters' personalities were explained with excess exposition but not SHOWN to readers through actions or dialogue.* While I don't adhere that authors should write only what they know, it was obvious to me early on the author didn't grow up with sisters, nor grow up or spend years in Pilsen or blue-collar Chicago. Neither felt authentic. Felt more as if author was on outside observing or imagining versus having lived it. I can overlook some tells, but the more those slips/omissions/errors add up, the more a reader loses faith in the entire story.*William's upbringing also didn't ring true. I can understand grief-stricken parents emotionally absent in a child's life, but not to the degree explained (not shown) in the book. More development and examples were needed, as parents cannot simply ignore a child--they still need to nurse, feed, cloth and shelter, etc. It's easy to tell but author needed to again SHOW us how cold parents can be there, but not present.* On plus side, the story & writing comes most alive to me with passages on basketball--the relationships, the tempo, the love of the game, the history. Here's where the author did her homework and really did a nice job translating it, esp to female readership (not to sound sexist, as I'm a woman who played basketball in her youth but still learned a few things or two and appreciated the insights she brought.)I'll leave it there as I don't mean to tear down a book that's not horrible, just not great. Possibly my disappointment is greater than most because I came up with high expectations and this just wasn't credible for me. As other reviewers noted, it's not a bad beach read, but not literature and not Oprah-caliber.  (Sorry for any typos--please don't review my review lol.)",
        "Number": 3
    },
    {
        "id": 111,
        "Reviewer": "Sue M.",
        "Rating": "3.0 out of 5 stars",
        "Title": "Would make a better movie",
        "Date": "Reviewed in the United States on March 2, 2024",
        "Body": "Not sure how to even review this book. I thought it drawn out and am not even sure I liked the characters all that much. Julia never knew about her husband’s past? The mother, Rose, wasn’t much better. Don’t want to give it away but I wasn’t impressed for a book that got so much hype. Liked Crawdads much more. Would not rave about this book, but, like I said, it might work as a movie or mini series. I found the writing tedious and slow, and had to skip a few sentences here and there.",
        "Number": 3
    },
    {
        "id": 112,
        "Reviewer": "Nikolean",
        "Rating": "3.0 out of 5 stars",
        "Title": "Typical Family Story",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "This story wasn't remarkable or so different than the dysfunctional families we're all apart of in some way. We can all see some of own story in this multigenerational where hidden family secrets come out in the light and people pretend nothing happened because their pride won't allow them to apologize. While I was invested in the story because it was a read for my book club, I would have never picked this on my own. I like that the author switches perspectives as it covers various decades but overall it's just another family drama.",
        "Number": 3
    },
    {
        "id": 113,
        "Reviewer": "Trish",
        "Rating": "3.0 out of 5 stars",
        "Title": "I find this a tedious read",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "I'm about 3/4 of the way through the book and have thought about putting it down several times. To me there are too many characters the author is trying to develop without much plot. I'll probably finish it and maybe I'll change my mind but . . .",
        "Number": 3
    },
    {
        "id": 114,
        "Reviewer": "Jennifer",
        "Rating": "3.0 out of 5 stars",
        "Title": "I don’t understand the hype",
        "Date": "Reviewed in the United States on September 4, 2023",
        "Body": "Hello Beautiful by Ann NapolitanoHello Beautiful centers around the Padavano sisters, and a man named William. Like the classic Little Women, we are intertwined into the sisters’ close-knit family, and we bear witness to their life’s highlights, but more so their downfalls. Oddly, as close as the sisters are displayed to the reader, we see very little in the way of communication between the four of them.There are marriages, births, loves and losses stretched across thirty-some-odd years. There is a beautifully storied first half, engulfing the reader. The middle of our story is lackluster though and a bit drawn out and I found myself uninterested.The last quarter of the book felt rushed to me like the author knew she had to wrap up the story. One character, in particular, I didn’t understand at all. She’s in her early 20s but does not have the inquisitive nature of an early twenty-something. This leads to my disappointment with this character. We have a very unfinished reunion at the very end, and unless there is going to be a sequel, leaves a lot of questions.I know this book is beloved by so many, and I did enjoy it, don’t get me wrong. I think it was hyped so much that I expected to give it a perfect five-star rating. I’m going to give Hello Beautiful three out of five stars. It was good, but had the potential to be great.",
        "Number": 3,
        "image_urls": [
            "81RrBR6HGgL._SY88.jpg"
        ]
    },
    {
        "id": 115,
        "Reviewer": "Kindle Customer",
        "Rating": "3.0 out of 5 stars",
        "Title": "Just ok.",
        "Date": "Reviewed in the United States on February 29, 2024",
        "Body": "Like other readers I found it a frustratingly long and tedious read with little wow. I felt a long time was spent saying very little. Too many holes as well in storylines that were started and either never ended or just let underdeveloped halfway.  Although the book kept trying to emphasize how close the sisters were , it’s really not reflected in the book.I did like  that it touched on some real subject matter like being a single parent, depression and mental health etc.I know lots of people seem to love it but I just couldn’t get into it.",
        "Number": 3
    },
    {
        "id": 116,
        "Reviewer": "Plum",
        "Rating": "3.0 out of 5 stars",
        "Title": "An absorbing but disappointing read",
        "Date": "Reviewed in the United States on January 31, 2024",
        "Body": "I can see why this book is so popular. It immediately sucks you in with the first sentence. But as I read on and finished it, I had more criticisms than compliments. The characters are very one-dimensional. You get caricatures more than characters that have real depth. For example, Julia is the \"planner.\" Cecilia is the \"artist.\" And so on. The family dynamic portrayed throughout is sweet but highly unbelievable. I think that I was just expecting more from this one and left feeling disappointed.",
        "Number": 3
    },
    {
        "id": 117,
        "Reviewer": "Lucnica",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not sure I understand the hype",
        "Date": "Reviewed in the United States on March 28, 2024",
        "Body": "Decent story line.  Flew through the years a bit too quickly.  Never felt a bond with any of the characters.  Just “ok.”",
        "Number": 3
    },
    {
        "id": 118,
        "Reviewer": "Lily Martirosyan",
        "Rating": "3.0 out of 5 stars",
        "Title": "Arrived damaged",
        "Date": "Reviewed in the United States on January 31, 2024",
        "Body": "Haven’t read the book- assuming the content is great. I bought two books, one for my friends birthday and another for myself and once of the books came with the pages damaged in the front. One of them is torn into the words. It’s not a big deal I can read around, but assuming I only order one and it came like that for a gift would suck.",
        "Number": 3,
        "image_urls": [
            "71xQuxHd1xL._SY88.jpg"
        ]
    },
    {
        "id": 119,
        "Reviewer": "M. Bauer",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not Believable",
        "Date": "Reviewed in the United States on May 1, 2023",
        "Body": "I am giving this book three stars only because I really appreciated Ann Napolitano's book A Good Hard Look, which influenced me to read Flannery O'conner.  I really wanted to like Hello Beautiful, but it was just too unbelievable.  There were hardly any likable characters, with the possible exception of William's basketball friends  It reads more like a soap opera than serious fiction.  For example, in what world other than soap opera can a widow who lives in a blue collar area and whose husband is described as having low paying jobs suddenly be able to move to Miami and hobnob with the wealthy?  How does she support herself?  We aren't told anything other than that she has wealthy friends.  In what world can a recent college graduate with a new baby be able to move to Manhattan (much less the upper east side) and afford childcare , housing, and expensive  clothes while doing research for a college professor?  Huh?  Sounds like fantasy.  And anyone who thinks Hello, Beautiful resembles Little Women obviously hasn't read the book.  The only similarity is that both books are about four sisters.  Can anyone imagine Marmie abandoning her children or not speaking to one of her daughters and granddaughters?  Really?  I had to force myself to finish this book.  As others have said, it was  depressing, peopled with unloving , unloveable , and unbelievable characters.",
        "Number": 3
    },
    {
        "id": 120,
        "Reviewer": "KWyly",
        "Rating": "5.0 out of 5 stars",
        "Title": "Beautifully written…",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I love this story about the four Padavano sisters and their parents. Rose is the strong willed matriarch of the family. She strongly believes her husband, Charlie, just doesn’t quite measure up to what he could have been. Together, they have four daughters. Readers are drawn right into this story and feel every emotion the characters experience. Julie, the eldest of the four sisters, is a planner, a fixer, a girl who knows what she wants and knows how to get it. She has a plan for her life and it doesn’t include living in a tiny house like where she was raised. Second daughter is quiet Sylvie, a reader who has worked in the public library since she was thirteen and sneaks kisses from the boys behind the shelves knowing she doesn’t want a boyfriend. She doesn’t  take the boys seriously because she is just practicing for her one true love. The twins who are energetic, fun loving girls, round out the Padavano sisters. Then there is William a loner, ignored and never loved at home, socially awkward, always wondering where he fits in, how should he behave, and why he wasn’t enough for his parents. He only feels at home on the basketball court. Julie has decided William is just what she needs to get her life plan started. In alternating chapters, the four main characters tell their story with each chapter bearing the character’s name. Quoting Walt Whitman’s poetry and making comparisons of the four sisters to the sisters in Little Women by Alcott, this book is more than a family saga. This book is a love story. It is about acceptance, heartbreak, forgiveness, and understanding.  Napolitano’s writing is thoughtful and beautiful. The story is deeply moving as each character grows and discover his or her truth and learns how powerful it is to live an authentic life. A five star read and on my list of favorite books in 2024!",
        "Number": 5
    },
    {
        "id": 121,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Hello beautiful",
        "Date": "Reviewed in the United States on March 24, 2024",
        "Body": "It's not very often that I cry reading a book but this book was so beautifully written I could feel the sadness, the love, everyone's emotions, and I was moved to tears. What a beautiful and sometimes sad story but well worth every word!",
        "Number": 5
    },
    {
        "id": 122,
        "Reviewer": "Cari R Bailey",
        "Rating": "5.0 out of 5 stars",
        "Title": "so well done!",
        "Date": "Reviewed in the United States on February 27, 2024",
        "Body": "Such an amazing story about how real families love and feud.  I loved the perspective of each character that carried the story forward.  I also loved the intrinsic bonds that bind a family regardless of decades and perceived wrongs.",
        "Number": 5
    },
    {
        "id": 123,
        "Reviewer": "reading adept",
        "Rating": "5.0 out of 5 stars",
        "Title": "delightful",
        "Date": "Reviewed in the United States on March 27, 2024",
        "Body": "To read about and get to know the characters who comprise a large and encompassing Italian family and their friends. This book can renew your faith in humankind and will- at the end, put a smile on your face.",
        "Number": 5
    },
    {
        "id": 124,
        "Reviewer": "Brogan girl",
        "Rating": "5.0 out of 5 stars",
        "Title": "A.story of family",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "Ann Napolitano knows how to weave a story , but even more impressive is her ability to make you love her characters.  She develops them so completely, you think you know them, their motivations, and what they will think and do next.  The title is very accurate, as each character is beautiful through the eyes of those who love them.  Highly recommend!!",
        "Number": 5
    },
    {
        "id": 125,
        "Reviewer": "Fatboy_Rule",
        "Rating": "5.0 out of 5 stars",
        "Title": "One Of The Best Books I’ve Ever Read",
        "Date": "Reviewed in the United States on March 31, 2024",
        "Body": "I read quite a bit for recreation, but never have I connected with a story and characters quite like this one. The prose is beautiful, the character development of each individual character is top tier. I’ve never finished a book and been touched as deeply as I felt after finishing Hello Beautiful. This one probably rates as my favorite book of all time, or at least that’s where it’s at a few weeks after finishing it. Onto another one of her novels, Dead Edward.",
        "Number": 5
    },
    {
        "id": 126,
        "Reviewer": "Barbara Sutton",
        "Rating": "5.0 out of 5 stars",
        "Title": "The Heart of Family Life",
        "Date": "Reviewed in the United States on February 16, 2024",
        "Body": "I can't think of a novel which has so deeply involved me in the lives, experiences and feelings of it's central characters.  I'm quite sad that I've just finished it, because I don't want to say goodbye to William and the close knit family of four sisters he married into.  My own spare childhood resembles William's.  Yet this novel is a way of seeing what it might be like to be raised in an exuberant, complicated, loving family... and how it evolves over time, as each girl becomes her own self... and William comes to realize that he matters.What impresses me most about the writing of Ann Napolitano is her ability to go to the heart of the matter.  She allows us to see the inner lives of her characters, their aspirations, self-doubts, determination, losses and joys.  There is grace here... saving grace.Perhaps I'm particulary drawn to a work like this because, as child psychologist, I've spent years studying how childhood experiences influence who we become, and the healing that is sometimes needed when those experiences have been less than ideal.  Napolitano shows here how it's often the people closest to us, who care about us, who facilitate our healing.  What the author has created here feels firmly based in reality and the challenges human beings face, and, thankfully, she draws these characters to unexpected reconciliation.",
        "Number": 5
    },
    {
        "id": 127,
        "Reviewer": "KL",
        "Rating": "5.0 out of 5 stars",
        "Title": "When it gets right down to it, aren't most stories about family?",
        "Date": "Reviewed in the United States on January 14, 2024",
        "Body": "A withdrawn man raised by parents who never saw him meets a girl from a family of girls who see--or think they see everything about him—and each other. But they are mistaken.His girl tells him they will marry. She tells him he will be a professor. He starts to study. She tells him it's time for a baby. By the time the baby becomes her focus, he realizes he loves her favorite sister. He doesn't want to teach. He wants to work with the basketball team, the only people who ever truly saw him, and cared about him. And because he never knew parental love, he is afraid to be a parent.Read one of the best family stories I've ever enjoyed in Hello Beautiful. See how deftly the author draws her characters and allows you to see them by their actions from several points of view so that you learn their emotions and motivations layer by layer. By the end, you understand and forgive.Forgiveness—and the lack thereof— is big in this novel. Having been banished by my mother from my family for several years, I was drawn deeply to the mother who stubbornly kept alive her anger against one of her children for so much longer than mine did. The same woman never forgave her husband for not being the man she expected him to be. She never understood that he was so much more.If you had a family, you understand that families—even loving families—are complicated. Families with problems are even more so. Each person adds his or her own characteristics, talents, opinions, and prejudices to a simmering pot of emotions, misunderstandings, and love. With every stir, the recipe can either boil over or settle into what it was meant to be. It's maybe how we get Forrest's box of chocolates—you never know what you're gonna get.Read Hello Beautiful and see that what you thought, or what you were told, or what you expected of someone, is not necessarily the way the story all will turn out. Life is always a surprise at every turn. Why would we expect a book to turn out the way we wish it would? The curveball element makes life—and books—all the more worthwhile.",
        "Number": 5
    },
    {
        "id": 128,
        "Reviewer": "Marsha C.",
        "Rating": "5.0 out of 5 stars",
        "Title": "heart wrenching but beautiful story",
        "Date": "Reviewed in the United States on April 2, 2024",
        "Body": "What a wonderful story of 4 sisters and how their different personalities are interwoven among themselves and their family. I fell in love with the characters and all their flaws. The love is bountiful and often painful. I thought it was well written.",
        "Number": 5
    },
    {
        "id": 129,
        "Reviewer": "TakingStock",
        "Rating": "5.0 out of 5 stars",
        "Title": "I needed tissues for the last 5%",
        "Date": "Reviewed in the United States on March 29, 2024",
        "Body": "This is a beautiful book about family and love for dear people no matter what their perceived flaws or foibles.  It’s about birth and death and the many ways one can deal with each.  It’s also a book about time and how perceptions change over time.",
        "Number": 5
    },
    {
        "id": 130,
        "Reviewer": "Amazon Customer",
        "Rating": "2.0 out of 5 stars",
        "Title": "I’m mad at Oprah.",
        "Date": "Reviewed in the United States on February 6, 2024",
        "Body": "I feel like I was duped by Oprah into reading this book. It starts out OK. But the book is told from four peoples perspectives, and the writer repeats things that they just told you from another person‘s perspective. And not only that things that could’ve been a paragraph for four pages long.  This book is 400 pages it probably could have been 300 pages. Also, there are things that were just not believable. William‘s little sister dies after having a cough for six days? (Not a spoiler this happens in the first two pages.) The parents never speak of her again but they apparently watch home movies of her.  The mother/grandmother is mad and not speaking to one daughter for years but then proceeds to brag about her to the granddaughter? It was so long and boring.",
        "Number": 2
    },
    {
        "id": 131,
        "Reviewer": "Kmoe",
        "Rating": "2.0 out of 5 stars",
        "Title": "Boring and depressing",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "I bought this for a book club and had a very tough time getting into it. It’s quite boring and some of the characters are quite in likable yet we have chapters devoted to their perspective. It’s very depressing, so after a little more than half way I gave up. I can’t remember the last book I didn’t finish. This is one I regret picking up.",
        "Number": 2
    },
    {
        "id": 132,
        "Reviewer": "Mike G",
        "Rating": "2.0 out of 5 stars",
        "Title": "Come on now...",
        "Date": "Reviewed in the United States on July 6, 2023",
        "Body": "Do some reviewers see the name \"oprah\" and automatically become entralled?  When I started this book, I was in love with it.  After a period of \"beach reads\", this was refreshing.  The characters seemed well-drawn, and the writing was good.  As the book progressed, the characters no longer made sense.  I don't want to say too much and give away the plot.  Let's just say that the author would add new character traits whose only purpose seemed to be that she needed to make the book longer- and boy, did the book seem looong! These traits were not consistent with the character nor did they add complexity.  The motivations of the characters made no sense to me.  The book became so boring and bogged down in the characters' nonsensical thoughts and feelings, that I considered giving it up,,,but hey...after all, it IS an OPRAH book.  There had to be more to it. Right?  It must be one whopper of an ending...but no.  It wasn't.  It just wasn't a good book.",
        "Number": 2
    },
    {
        "id": 133,
        "Reviewer": "d.m. Jones",
        "Rating": "2.0 out of 5 stars",
        "Title": "Hello Beautiful Not Worth Your Valuable Time",
        "Date": "Reviewed in the United States on July 7, 2023",
        "Body": "I really wanted to like Ann Neapolitan’s book, Hello Beautiful. My thirty- something daughters loved it. I, however, found the story of the sisters, their mother and William, the boyfriend/ husband to be very off putting. The sisters seem to be in such lock-step that I found their relationships to be unhealthy. Not beautiful at all. They are mothered by a woman who when widowed shuts one daughter and granddaughter completely out of her life for decades, and without a thought has little contact with the other three. William wanders around in a daze and constantly needs rescuing by 1. The sisters 2. Julia. 3. Sylvie and 4. Alice, the daughter he gave up without much thought as an infant. When tragedy occurs all of the characters gallop back to Pilsen ( a real Chicago suburb!) and without much discussion forgive one another’s rather grave transgressions.This story simply doesn’t touch the hearts and minds of the struggles it takes to be a fully formed forgiving, compassionate, yet sometimes failure of a family.Another Oprah miss.",
        "Number": 2
    },
    {
        "id": 134,
        "Reviewer": "SMILE Customer",
        "Rating": "2.0 out of 5 stars",
        "Title": "The Most Disappointing Book of the Year",
        "Date": "Reviewed in the United States on August 27, 2023",
        "Body": "I know many of the readers will think I am out of my mind.....Hello, Beautiful was like a plane trying to take off ......but just couldn't get airborne.  I love a good read, authors like Isabelle Allende and Barbara Kingsolver consistently meet my expectations. We trust those reviews and believe others' perceptions but perhaps we should question the procedure to determine that a book is worthy of being reviewed with 5 stars, or because Oprah or Reese loved it!  This book seemed to just drift along, with shallow characters, and no surprising plot twists or page-turners. I finished it last night and it left me so dissatisfied and wary about choosing \"Best Sellers\".  I discussed it yesterday at my book club and it will be interesting to see if any of the other readers concur. I usually do research on a book and author before ordering...this time I didn't.",
        "Number": 2
    },
    {
        "id": 135,
        "Reviewer": "David Kulick",
        "Rating": "2.0 out of 5 stars",
        "Title": "disappointed",
        "Date": "Reviewed in the United States on January 20, 2024",
        "Body": "After all the reviews I thought this was going to a page turner.  Unfortunately getting though this book felt like molasses.  So slow.  I also prefer some dialogue but for first 300 pages barely had any.  Sorry just didn’t enjoy anything about this book.",
        "Number": 2
    },
    {
        "id": 136,
        "Reviewer": "Raquel Cordon",
        "Rating": "2.0 out of 5 stars",
        "Title": "Novela de ficción",
        "Date": "Reviewed in the United States on December 28, 2023",
        "Body": "La trama es simple y parecida a mujercitas adaptada a nuevos tiempos pasados de los 80 a los presentes.En general me pareció repetitiva con frases y recordándote momentos pasados en la novela que te hacia aun mas pesada la lectura.Me pareció a una novela rosa.",
        "Number": 2
    },
    {
        "id": 137,
        "Reviewer": "Denise DiVincenzo",
        "Rating": "2.0 out of 5 stars",
        "Title": "I really tried to like this book.",
        "Date": "Reviewed in the United States on February 5, 2024",
        "Body": "I really wanted to like this book based on all the great reviews.  The story was a good one, but it just was drawn out.",
        "Number": 2
    },
    {
        "id": 138,
        "Reviewer": "Amazon Customer",
        "Rating": "2.0 out of 5 stars",
        "Title": "not my fave",
        "Date": "Reviewed in the United States on December 5, 2023",
        "Body": "My main issue with this novel is how out of sorts the characters are. They make choices especially early in that negate something we learned about them earlier. Additionally, when authors explain their ideas to the reader it’s insulting. We can see the symbolism and the connections. I did not love the exposition. Not my favorite. Just a little too sentimental for me.",
        "Number": 2
    },
    {
        "id": 139,
        "Reviewer": "David Churchman",
        "Rating": "2.0 out of 5 stars",
        "Title": "I beg to differ",
        "Date": "Reviewed in the United States on June 30, 2023",
        "Body": "I'm going to have to disagree with the thrust of the reviews here for Hello Beautiful. I had to power through it. The author appears unable to introduce either wit or subtlety to the characters, with the possible exception of Rose, who is as thorny as her name suggests, and who is the one character through whose eyes I would have liked to have seen parts of the book told. Though disagreeable, Rose at least had some perspective on her children. Alas it was not to be. And then there's the author's need to explain, over and over, her characters' motivations rather than trust that her writing could show the reader. Not a few words could have been saved by letting the characters' actions do the explaining. In the end there's little for the reader to do but power through because the author has trusted us with no other role.",
        "Number": 2
    },
    {
        "id": 140,
        "Reviewer": "diana jaycox (my friends call me DJ)",
        "Rating": "4.0 out of 5 stars",
        "Title": "It improves as you read further...",
        "Date": "Reviewed in the United States on September 9, 2023",
        "Body": "Hello Beautiful by Ann Napolitano, an Oprah's Book Club selection was read by this reviewer as part of a challenge. It would not have been my choice otherwise. As a rule I read to escape and find that many of contemporary bestsellers require me to be too much in the now and too much in my head. So it was no surprise that I struggled to get into this novel. It was too achingly real! The characters, their lives, their dreams and their struggles collided with my own and made me want to withdraw into my own darkness. I so wanted to send this book to the trash bin. Though, as a writer I challenged myself to read other writers ,especially those that are bestsellers. I needed to discover what makes other authors so appealing. How do other writers set-up their stories, build their settings, develop their characters. After a break, I came back to Hello Beautiful and read this as a writer as well as a reader.  By applying a critiquing approach, I was able to achieve a degree of separation from the story. It was just enough to allow me to focus on the cadence of Ann Napolitano's words, to savor the style of her storytelling and to not get caught in my own angst and issues.I began to see how Hello Beautiful shared so many elements with one of my all time favorite books , Little Women. I was intrigued by the depth of personality of each of the sisters Ann Napolitano created. Ann was able to show how each sister was a part of the others yet completely individuals. How they became who they were was beautifully and intricately choreographed by Ann Napolitano throughout the novel. And, adding William a lost soul, an outsider to the mix, was a brilliant catalyst  for  the sisters growth and development!This was NOT an easy book to read. I  took several breaks but always came back.  This poignant story about family love and relationships, did end up stirring my heart and soul in ways, I admit, prefer to avoid.  At times, I felt like I was on an emotional roller coaster.  By the time I reached the climax of the story I was fully invested in the characters and their lives, the many highs and lows they experienced and yet were able to weather because they had each other. I don't know how many other of Ann Napolitano's my tortured soul will be able to tolerate. I can say that the beauty of Ann Napolitano carefully crafted words, the images she brought to my mind's eye and the powerful feelings of love that seemed to leap from the pages of Hello Beautiful, eventually brought me to place of peace. I read the last page with a sigh. Then I closed my eyes and reflected on all my best memories of life in a large, obnoxiously in your face , flawed, loving family! All the highs and lows, the good times, the bad and the big loving mess of it all!SIGH.",
        "Number": 4
    },
    {
        "id": 141,
        "Reviewer": "Reviews",
        "Rating": "4.0 out of 5 stars",
        "Title": "Beautifully written, pretty dreary",
        "Date": "Reviewed in the United States on February 18, 2024",
        "Body": "The writing is beautiful. The character development is on point, which is good, because it is a character-driven story. The reader gets to know the characters really well, and the author allows her characters to have flaws - almost to the point of being unlikable.I’m in a “it’s not you, it’s me” relationship with this book, because it was pretty perfect. But it was too much reality than I needed right now. I found it to be relentlessly hopeless. Absolutely a good book if you need a good cry, and you will cry, multiple times.",
        "Number": 4
    },
    {
        "id": 142,
        "Reviewer": "Vicky",
        "Rating": "4.0 out of 5 stars",
        "Title": "Life is Complicated",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "Every family has stories that of bonds that draw them together and those that pull them apart.  This one was particularly well written and I loved all of the Padavano with their strengths and flaws.  Their journey from childhood through middle age made it hard to put the book down.  Good discussion of depression and impact of family dynamics early in a child’s life.  It is a good book for anyone looking to read about real family life, both the good and the bad.",
        "Number": 4
    },
    {
        "id": 143,
        "Reviewer": "MeganC",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great family story",
        "Date": "Reviewed in the United States on March 29, 2024",
        "Body": "Loved this book! Loved the character development! It made you want to keep reading. Lots of twists and turns. I highly recommend this book",
        "Number": 4
    },
    {
        "id": 144,
        "Reviewer": "Amazon Customer",
        "Rating": "4.0 out of 5 stars",
        "Title": "character driven family story",
        "Date": "Reviewed in the United States on April 1, 2024",
        "Body": "I liked Hello Beautiful for its well developed characters and story of family dynamics",
        "Number": 4
    },
    {
        "id": 145,
        "Reviewer": "josiep",
        "Rating": "4.0 out of 5 stars",
        "Title": "Worth reading",
        "Date": "Reviewed in the United States on March 21, 2024",
        "Body": "What I didn't like about the book is the excessive use of reflective emphasis when dialogue would have been welcomed. There was too much repetition about the inner mental workings of each character. It became tedious. Still, I'm glad I read it.hi",
        "Number": 4
    },
    {
        "id": 146,
        "Reviewer": "nytodallas84",
        "Rating": "4.0 out of 5 stars",
        "Title": "Family Drama",
        "Date": "Reviewed in the United States on March 17, 2024",
        "Body": "It was a well written book which made it an easy read. I liked the book but didn't love it. Some things made me mad but they were true to life. The good thing it shows is a strong family bond.",
        "Number": 4
    },
    {
        "id": 147,
        "Reviewer": "Jennifer Jenson",
        "Rating": "4.0 out of 5 stars",
        "Title": "thought provoking",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "Hmm i can’t say i liked the book as a whole, or the story line, but there were so many good thoughts, quotes, life lessons.  It was rich with real life experiences.",
        "Number": 4
    },
    {
        "id": 148,
        "Reviewer": "Mary",
        "Rating": "4.0 out of 5 stars",
        "Title": "Hard to get into but good",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I give the book a three due to it dragged out a lot at the beginning. But after reading the whole book, I now give it a 4All in all it’s a good read.",
        "Number": 4
    },
    {
        "id": 149,
        "Reviewer": "Vgibbs54",
        "Rating": "4.0 out of 5 stars",
        "Title": "family drama",
        "Date": "Reviewed in the United States on February 2, 2024",
        "Body": "This is a novel of the 4 Padavano sisters, from childhood to adulthood.  As a William Waters gets to know their many facets, and layers, we learn of his childhood and see him through adulthood.  The interpersonal relationships are complicated, as in any family.The book is a good read.  I enjoyed the storyline in its complexity, but found it redundant in sections and felt it dragged on in some parts.  Still worth the read, however. Character development was carried out with only some of the characters.  I would have like to get to know a couple of other characters.",
        "Number": 4
    }
]