[
    {
        "id": 0,
        "Reviewer": "Heather Langston",
        "Rating": "5.0 out of 5 stars",
        "Title": "Dare I say it?",
        "Date": "Reviewed in the United States on March 24, 2024",
        "Body": "I bought these in September of 2023 as a back up for for when my AirPods died. I enjoy listening to audio books as I clean and do chores. Well, today, I realized I couldn’t remember what in the world I’d done with them after my AirPods died. Hours later, I found them in the bottom of my washing machine. I left them in my pants pocket. I just knew they were ruined. Well, they still work perfectly. Even my husband was amazed. My only complaint about them is I wish I could locate them like my AirPods. I love these and dare I say it? I like them better than my AirPods!! They stay charged for a long time, and charge the same as the Apple ones. I’ve decided I need another pair! 🥰",
        "Number": 5
    },
    {
        "id": 1,
        "Reviewer": "Sara Slick",
        "Rating": "5.0 out of 5 stars",
        "Title": "Crisp, clear and comfy",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "First off this is my very first pair of these kind of ear buds, and I am impressed… They’re comfortable which I was nervous about because a lot of the older buds (the ones that came with iPhone) never fit my ears right. I have small ear holes or something. The first song I chose to listen to was Bottle and Mary Jane by Jelly Roll. It sounds great! I paid less than $30 and I gotta say they’re worth every penny. I cannot compare them to more expensive buds because I’ve not used them.  But these are perfect for me because I won’t be  using them much. I don’t care about name brands or having the product of the moment. If they don’t last or if I start having issues I will update this, as I just got these 2 days ago.",
        "Number": 5
    },
    {
        "id": 2,
        "Reviewer": "Ohad",
        "Rating": "4.0 out of 5 stars",
        "Title": "Price so good...sound so bad",
        "Date": "Reviewed in the United States on March 7, 2024",
        "Body": "For $35? These are incredible. I'm planning on buying 2 or 3 more to give as gifts. The interchangeable ear cups let you customize the fit and the little screen on the case that shows the battery level is nifty--Apple should have this feature. Since you can buy three of these for the cost of only one pair of the basic Airpods--they're awesome. The sound quality is just terrible! I found that changing the EQ settings on my iPhone helps a bit depending on the type of music you are listening to. These don't noise cancel at all.  They feel cheap. The plastic on the case is rough--not smooth like Airpods. The case is flimsy. I'm worried that flipping it open and shut often could lead to it breaking. The earbuds themselves are so light in your hand--very easy to drop. I'm confident these will work great for what I bought them for--listening to music in the gym and podcasts while I'm folding laundry--and I built that assumption into my purchase--I didn't expect great sound. If you're settling in to really listen to music and drown out noise in a coffee shop, these are not for that.",
        "Number": 4
    },
    {
        "id": 3,
        "Reviewer": "Amazon Customer",
        "Rating": "4.0 out of 5 stars",
        "Title": "Good quality",
        "Date": "Reviewed in the United States on February 21, 2024",
        "Body": "I ordered these earphones yesterday after I spent some time reading the reviews. I was a bit scepitable due to the price and some of the reviews. They were delivered the same day I ordered them. I opened the box to find them 100% charged! I put them in my ears fit was great and I can walk and move without them falling out of my ears. It was an easy set up with my Samsung s10. I haven't utilized any of the buttons yet. I tried the volume today per the booklet, but was unable to get it to work. I find it easier to use the phone volume button. I don't plan to use these for calls only music. I find the music quality = in both ears. I went out in my backyard and was able to walk freely without losing the connection. I left the phone in the house and was able to get about 25 ft until it wasn't commuicating with the phone. I was digging up some small tree roots and the earpieces remained in except once. It loosened in my ear and when i pressed it back in it stopped the music. Me not wanting to figit with the button to figure it out I chose to walk to my phone. In the coming days I will explore the buttons, but not today.",
        "Number": 4
    },
    {
        "id": 4,
        "Reviewer": "Kimberly Norman",
        "Rating": "5.0 out of 5 stars",
        "Title": "Solid product!",
        "Date": "Reviewed in the United States on March 23, 2024",
        "Body": "I almost never write reviews, but felt I had to after hubby accidentally washed the charging case a couple of days ago, and it still works fine. I know it SAYS waterproof, but products make a lot of claims. Turns out this one is true. These are great, reliable little earbuds. Not as many features as AirPod Pros, (like, no noise canceling feature like the AirPods) but since at least ONE of those dang Airpods stops working routinely for seemingly no reason -- CERTAINLY nothing as injurious as being laundered!-- the noise canceling feature doesn't work anyway when only one Airpod is working. These are much more reliable, and about 1/10th the cost. Great producdt!",
        "Number": 5
    },
    {
        "id": 5,
        "Reviewer": "jules",
        "Rating": "4.0 out of 5 stars",
        "Title": "Good value",
        "Date": "Reviewed in the United States on March 25, 2024",
        "Body": "These sound great, I've had no issues so far. They fit well, have been comfortable, seem to have a long battery life, so I'd say they're a pretty good value for the price. The only thing that bugs me, that none of the reviews I've read mentioned, is that these do not stand up - as suggested by the description photos. It doesn't make or break them, it just bugs me. Not one side is completely flat so they are prone to move around no matter how you set them... Front or back, they can be spun around, top bottom and sides are too rounded to \"stand\" on. Charging port is on  what I would call the \"bottom\", based off of how the \"top\" opens.",
        "Number": 4,
        "image_urls": [
            "61tQkNaR8rL._SY88.jpg"
        ]
    },
    {
        "id": 6,
        "Reviewer": "YI",
        "Rating": "5.0 out of 5 stars",
        "Title": "Budget-Friendly and Durable",
        "Date": "Reviewed in the United States on March 16, 2024",
        "Body": "I opted for these Bluetooth headphones instead of splurging on AirPods, fearing I'd inevitably lose them—and guess what? I haven't lost them yet! Surprisingly, these headphones have exceeded my expectations in terms of both quality and durability.I was pleasantly surprised by the sound quality and overall performance of this product, especially considering its affordable price point. But the real shocker came when I accidentally ran one of the headphones through the washer. Despite the mishap, it continued to work perfectly fine afterward!This experience has reaffirmed my belief that you don't need to spend a fortune on Apple products to get a reliable pair of headphones. These Bluetooth headphones are proof that quality and durability can come at an affordable price. Don't hesitate to give them a try!Overall Rating: ⭐️⭐️⭐️⭐️⭐️",
        "Number": 5
    },
    {
        "id": 7,
        "Reviewer": "Dynae Saba",
        "Rating": "5.0 out of 5 stars",
        "Title": "These are EXACTLY WHAT I NEEDED!",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "My expensive pair of Air Pods fell in half right after the warranty expired. I no longer had a desire to pay for mediocre headphones that loss their effectiveness more and more overtime. I ordered two low cost headphones on amazon (this pair being the first to be delivered) and I couldn't be happier! These fit perfectly in my ears (I have sensitive ears that will ache over an extended period of time of wearing headphones...Not with these!!! ). The sound quality if superb and I don't ever have them turned up full blast as they're really loud. I utilize them to listen to audio books and podcasts for 8 hours at work and they've never died. I use one at a time and I don't even need to switch sides within those 8 hours. I charged the case the day I received them and that was a week and a half ago and I still haven't recharged them. Talking on the phone voice clarity is great and I have had no issues. Connectivity is easy and consistent. These will be my go to!",
        "Number": 5
    },
    {
        "id": 8,
        "Reviewer": "Cory Maffeo",
        "Rating": "5.0 out of 5 stars",
        "Title": "Elevating Your Audio Experience with 60H Playback, LED Magic, and Wireless Elegance!",
        "Date": "Reviewed in the United States on November 28, 2023",
        "Body": "Greetings, fellow audiophiles and tech enthusiasts,Prepare to be immersed in the unparalleled realm of acoustic excellence as I present to you the TAGRY Bluetooth Headphones—true wireless earbuds that redefine the boundaries of audio sophistication. In a world inundated with options, these earbuds stand as a beacon of unrivaled quality, seamlessly blending cutting-edge features with a touch of elegance. This isn't just a pair of headphones; it's an auditory odyssey, a five-star experience that elevates your audio encounters to new heights.**A Symphony of Sound Quality**: Step into a world where crystal-clear audio is not a luxury but a norm. The TAGRY Bluetooth Headphones orchestrate a symphony of high-fidelity sound, effortlessly delivering crisp highs, rich mids, and deep lows. It's not just audio; it's a sonic masterpiece that transforms your listening sessions into immersive journeys.**60 Hours of Playback Brilliance**: Picture this—a marathon of your favorite tunes, uninterrupted for an astounding 60 hours. The TAGRY Bluetooth Headphones are not just earbuds; they're a testament to endurance and longevity, ensuring your musical companionship lasts as long as your playlist demands.**LED Power Display Magic**: The LED power display on the charging case is like a visual symphony, providing a glance into the soul of your earbuds. It's not just a display; it's a communication tool that keeps you informed, ensuring you're always in sync with the power status of your audio companions.**Wireless Charging Elegance**: Effortlessly recharge your earbuds with wireless charging capabilities that redefine convenience. It's not just a charging case; it's a sanctuary that breathes life back into your earbuds with the grace of technological elegance.**IPX5 Waterproof Assurance**: Life happens, and so do unexpected rain showers and sweaty workouts. Fear not, for these earbuds are equipped with IPX5 waterproof technology, offering protection against water splashes and sweat. It's not just durability; it's a shield that ensures your audio experience remains untarnished even in the face of the elements.**In-Ear Comfort and Mic Mastery**: The ergonomic design of these in-ear earbuds isn't just about aesthetics; it's a commitment to your comfort. Wear them for hours on end without discomfort, and with the built-in microphone, seamlessly switch between music and calls. It's not just convenience; it's a harmonious blend of functionality and comfort.**Universal Versatility**: Whether you're engrossed in your favorite TV series, engrossed in the virtual world of your smartphone, engrossed in a work project on your computer, or engaged in the physical rigor of sports, these earbuds are your versatile companions. It's not just compatibility; it's a testament to the universal appeal of these audio marvels.Now, skeptics may question, \"Are they merely earbuds?\" To them, I say, dear reader, they are not *just* earbuds. They are the silent guardians of your audio sanctuary, sentinels against the disruptions that threaten your auditory bliss.In conclusion, if you've ever aspired to lose yourself in a symphony of audio excellence, the TAGRY Bluetooth Headphones are your gateway to a five-star auditory experience. They're not just a pair of earbuds; they're a commitment to the immersive world of sound.To musical journeys, uninterrupted playback, and the undeniable charm of audio sophistication,Yours in auditory bliss and wireless elegance,An audio enthusiast who knows the sweet serenade of impeccable sound.",
        "Number": 5
    },
    {
        "id": 9,
        "Reviewer": "Codie S.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Excellent low cost earbuds",
        "Date": "Reviewed in the United States on February 27, 2024",
        "Body": "I read and watched lots of great reviews prior to buying these. So far my experience has lived up to those reviews. I'm pretty impressed with the sound quality of these earbuds. The battery life is quite long, and I can get several full recharges out of the case before needing to plug it in. They are comfortable in the ear, and stay in easily.If I could suggest anything, it would be a larger option for the earbud insert. The biggest one in the pack works for me, but I can still feel some wiggle room that perhaps a larger insert would take care of.I will point out these are not meant to eliminate all outside noise, but dampens it down quite a bit. If I have these in while using a lawn mower, I can still hear music but not super clearly. You may want to consider an over the ear headphone if that's the intended use.Overall I am very happy with these and definitely recommend them!",
        "Number": 5
    },
    {
        "id": 10,
        "Reviewer": "Ashlyn V.",
        "Rating": "4.0 out of 5 stars",
        "Title": "May as well be Michael Phelps",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "Comfort: 5/10Sound Quality: 6/10Convenience: 8/10I kind of hated these when I first bought them because they weren’t the best in comfort or sound quality but used them because $40 is $40.However, they’re powered by like…. Idk radioactive rabbits or something. They charge super fast and the charge lasts around at least 7 business days.But also, they are truly truly water proof. How do I know? Because I’m a mom of a nasty lil 9yo and a potty training 2yo and LAUNDRY is taking over my house. I pretty much just load up the forklift, drop the clothes in, and have a fun lil scavenger hunt after the clothes come out. These sweet lil headphones didn’t deserve to go through the washer with my kids crap stains and half eaten suckers, but they did. And they came out of the washer as if they hadn’t just been traumatized.Props.",
        "Number": 4
    },
    {
        "id": 11,
        "Reviewer": "C-Dub",
        "Rating": "5.0 out of 5 stars",
        "Title": "Unbelievable for the price@",
        "Date": "Reviewed in the United States on March 24, 2024",
        "Body": "I was hesitant at first becuase the price was so good on these, but wow was I impressed.I have had them a few months now and I use them pretty regularly and I haven't had to charge them at all.The ease of use is excellent. Once paired they immediately activate with my device.The ondevice controls are nice and work just like the bug name brands. If I ever actually need a new pair I won't hesitate to get the latest model of these.",
        "Number": 5
    },
    {
        "id": 12,
        "Reviewer": "Rick R",
        "Rating": "5.0 out of 5 stars",
        "Title": "Tagry X08’s.  👍",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "Just got these today.  They paired quickly to my iPhone 12 and my laptop.  Immediately queued up some nirvana.  For 34 bucks I was amazed how good they sounded.  I then went to my laptop to see how they were on a Dan Bongino Rumble podcast.  Once again, the speech was crisp.  The lifetime warranty took about 5 seconds to complete.  My only issue is the controlling of functions by tapping a specific spot on the ear buds.  This seemed clunky but it’s probably due to the fact I’ve never used wireless earbuds.  They were comfortable and the sound really impressed me.  Not sure how you can go wrong with these considering the lifetime warranty.",
        "Number": 5
    },
    {
        "id": 13,
        "Reviewer": "Odell R.",
        "Rating": "4.0 out of 5 stars",
        "Title": "Sounds good!",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "The earbuds were delivered quickly in a nice box, reminiscent of Apple packaging. The instructions were straightforward and concise. The earbuds fit very well into a nice carrying case that includes a battery indicator for the case as well as indicators that the earbuds are charging. The case has kept a good charge and has only been charged once since I got them. However, I only use the earbuds for a short time every day at this point.The only problem I have with the earbuds is that it’s difficult to determine where exactly to tap to change volume, track, answer my phone, etc. I think that will work itself out as I use them more.",
        "Number": 4
    },
    {
        "id": 14,
        "Reviewer": "Tatiana L.",
        "Rating": "5.0 out of 5 stars",
        "Title": "A very good set of earbuds for a fair price",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "I have Samsung and AirPods Pro that I use every day. I needed one more set of earbuds, less expensive, to carry with me. I must say that I am impressed with the quality of this product. I had no issues with paring, charging, or using it. I do not know how long exactly the charge lasts, but I take 2-hr walks and use these earbuds for at least this long without needing to recharge them. I am pleased with my purchase and would recommend this product to others. Sometimes, fortunately, you do not need to pay top dollar to get a good quality gadget.",
        "Number": 5
    },
    {
        "id": 15,
        "Reviewer": "alan",
        "Rating": "4.0 out of 5 stars",
        "Title": "Falls out. Good sound and battery life",
        "Date": "Reviewed in the United States on January 21, 2024",
        "Body": "Moved on to these after old airpods not keeping charge. They're a lot bigger. They tend to fall out of my ears when I talk, bend down, chew or move rapidly. When I adjust the placement while wearing them they turn off the audio or switch tracks, but I cannot seem to get the hang of changing tracks or turning off the audio etc while they're in. My ear did get sore where the earbud changes size from small inner ear portion to the larger portion that hangs out of the ear. They tend to build up moisture in the ear canal. Not that it's unbearable but it's a different experience and I'll have to be diligent in keeping the earbuds super clean.The sound is good. They're not completely noise cancelling which is good for my needs. I have not tried them in very noisy environments though.The microphone is good for calls but voice to text seems to have difficulties. It could be an issue with something I'm doing but it's an issue I'm having nonetheless.The battery life is surprisingly good. I like the fact that the battery life is shown on the outer case. No guessing when you might need to charge it.The case is a bit bigger than I expected but it's easier to find when it wants to fall to the bottom of a bag or backpack.",
        "Number": 4
    },
    {
        "id": 16,
        "Reviewer": "ROLO MB",
        "Rating": "5.0 out of 5 stars",
        "Title": "Amazing value",
        "Date": "Reviewed in the United States on March 22, 2024",
        "Body": "I have tried many different earbuds and headphones. Have a few that are in the medium price range. I am wondering now, why? These earbuds are very simple, have a good sound and lifetime warranty... and what a value. I tried wireless earbuds a couple if times before, much more expensive; last time maybe 4 or 5 years ago. Returned them because, when used for video, the lips were not synchronized with the sound. These earbuds don't have that problem.",
        "Number": 5
    },
    {
        "id": 17,
        "Reviewer": "Schwindjr",
        "Rating": "4.0 out of 5 stars",
        "Title": "Best backup set I've owned",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "I've tried dozens of bluetooth earbuds; brands and styles, cheap and expensive.  I don't need tons of features, but I do need earbuds that don't fall out when working out.  My Anker Soundcore X10 are my go-to @ $70.  But these TAGRY earbuds are half the price, connect easy, have a long charge, and DON'T fall out of my ears.  If I could give a star rating for \"fit\" it would be a 5.  Make no mistake, this set does not have active noise cancelling or really dynamic clear sound.  They work and they stay in my ear at the gym.  Great find at this price point.",
        "Number": 4
    },
    {
        "id": 18,
        "Reviewer": "Robin L.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great Bang for the Price!",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "I have two sets of apple pods; one is missing, and the other will no longer pair with anything! I did not want to spend the $$ on another one right now, but I needed something that would pair with my desktop and have a great sound. I bought these and am VERY satisfied with the quality. I like that you can see a digital readout for the life left in the case. However, the one drawback is that the case has no weight. I would be afraid to drop it instead of my Apple earbud cases.",
        "Number": 5
    },
    {
        "id": 19,
        "Reviewer": "Deb",
        "Rating": "5.0 out of 5 stars",
        "Title": "They are great including the mic",
        "Date": "Reviewed in the United States on March 17, 2024",
        "Body": "I have been really impressed with the quality of these earbuds and even more impressed with the mic. This was the feature that I was most concerned with for hands free calling and they have worked really great. I’ve used them for video conferencing and the sound quality is excellent, both incoming and outgoing. I’m tempted to buy another set just in case these ever go out. I’ve never used AirPods so I can’t give an accurate comparison but for this price point and quality I would definitely recommend these.",
        "Number": 5
    },
    {
        "id": 20,
        "Reviewer": "thirst4music",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great value for both phone calls and music",
        "Date": "Reviewed in the United States on February 14, 2023",
        "Body": "Sometimes I'm amazed by the advancements in wireless and micro technology, especially when it comes to audio. These popped up in an email from Amazon a few days ago. Though I usually ignore those Deal notices this one intrigued me. I have a JBL Everest over-ear headset that I love for indoor phone calls and they're pretty good for music too (though I don't use them that way). I often like to go outside when I'm on the phone and the JBLs aren't convenient to use with a stocking cap, so I'd thought briefly about getting something in-ear to wear under my hat. These were $35 and the reviews were good. I liked that the case wirelessly charges the ear buds, and the case can be charged wirelessly too. My Samsung phone has wireless charging so I already have two wireless chargers and they're very convenient (especially given that the USB port on my phone was getting sketchy). So I figured I'd give them a try. I played a variety of my favorite music. I first asked for Jeff Buckley live music and the first song that started playing as I stepped outside was \"Hallelujah.\" I walked around the property listening to my favorite music and before I knew it I had been listening to music for about three hours. I had really only cared about the sound quality for phone calls and whether they would stay in my ears (which is usually a problem for me). They never came close to falling out and they are comfortable. For phone calls the sound quality is very good on both ends. And though they're rated as having a 33' range I walked all around the house and got considerably farther than that from my phone with two walls separating the devices and I had no dropouts. Overall I am so happy with them that after a week of using them I ordered a backup pair.I have three VERY minor niggles but even combined I wouldn't consider them significant enough to knock off even ½ star. First, I had trouble gripping them well enough to get them out of the case quickly when I got an unexpected phone call. I started leaving them on a paper towel on the table next to me, but it now seems I've discovered the right way to grip them. Second, though they have a voice announcement of which side is which when first removed from the case, I was concerned that I might confuse L and R as they don't appear to have any visible indicators. My solution was to use my fine-point permanent marker to write an L on the left one. Third, one of my wireless phone chargers is a tilted stand that holds my phone at a convenient angle. I was unable to get the Ear buds case to wirelessly charge on that one until last night when I accidentally discovered that the problem was that the case was too small to hit the sweet spot on the charger. I solved the problem by boosting the case up with a pad of mini sticky notes (as shown in the photo).EDIT (I apologize if I forget to come back to delete my previous review):None of the above has changed but I forgot to mention that these are NOT good for noise isolation (at least not the way they fit me) but I prefer it that way. I'm a musician and music sounds less natural to me when the surrounding environment is completely eliminated, and I like being able to have a conversation or hear a knock at the door without removing them. Even without a tight seal I never have to reseat them and the sound quality stays consistent (a first for me after trying several other brands).UPDATE: I've been using these ear buds for five weeks now. I use them for hours every day and they continue to impress me. On three occasions only the right channel had a signal when I initially put them in to listen to music, but each time I put them back in the case and took them out again (which turned them off and on) and they worked normally. I've only had this happen with music and only when I first take them out of the case (i.e. it hasn't happened while on a call or after I've been listening to music with both working).",
        "Number": 5,
        "image_urls": [
            "61fvUKyPotL._SY88.jpg"
        ]
    },
    {
        "id": 21,
        "Reviewer": "Michigan Mom",
        "Rating": "5.0 out of 5 stars",
        "Title": "Excellent buy",
        "Date": "Reviewed in the United States on March 16, 2024",
        "Body": "Earbuds are lightweight, comfortable and stay in place. It took maybe 10 seconds and no effort to connect to my iPhone. The battery life is excellent. Range for connection to my phone exceeds expectations. I can walk anywhere in my two level home and stay connected without carrying my phone. I’m using the earbuds to listen to audio books and podcasts and the sound quality is perfect for those activities.",
        "Number": 5
    },
    {
        "id": 22,
        "Reviewer": "Callie",
        "Rating": "4.0 out of 5 stars",
        "Title": "Good for the price",
        "Date": "Reviewed in the United States on January 14, 2024",
        "Body": "Good for the price, however there are SOME issues.If you have tiny or sensitive ears, these are not comfortable. I'm unfortunately unable to wear them for periods longer than 40-ish minutes due to how paiful they are to wear. This is just an issue with my ears, but if you are like me and you are determined to get these, wear them upside down. It's significantly less painful.The audio is loud. Even on the lowest setting, these things are pretty loud. I have autism and when im having a sensory overload, the lowest settings of these are very painful. Wholeheartedly recommend using these with an app like spotify where it allows you to lower the volume further via the app.The touch sensors on the side are SO SENSITIVE. My hair manages to trigger them, yet when I actually want to skip a song or pause and play my music, it doesn't work to well and can lead to some frustration.The audio quality itself seems okay. It's definitely not like my more expensive over-the-ear headphones, but it isn't grating or awful. I don't use these for calls,  so I'm not too sure about the mic quality.Battery life is pretty nice, the overall feel of the earbuds in my hands are nice also. The case feels a little cheap on the outside, but not to the point where I feel like the lid is going to break off. Just be careful not to drop them.I like the color and appearance of them! They look exactly like the picture. I haven't had any issues with the case or charging, but please be aware when you first turn it all on, the case battery is going to drop very quickly to charge the headphones.The earbuds come with a lifetime warranty you can activate for free. I reached out to customer support regarding a question, and they replied within the next business day and were very helpful.TL;DR:Hurts tiny ears, loud minimum audio, touch gestures kinda suck... buuutttt audio itself good for the price, the earbuds come with a free lifetime warranty, battery life is nice, they look exactly as advertised, customer service is quick and efficient.Overall 4/5⭐️",
        "Number": 4
    },
    {
        "id": 23,
        "Reviewer": "Julius Forte",
        "Rating": "5.0 out of 5 stars",
        "Title": "Amazing buds/price/service... buy these!",
        "Date": "Reviewed in the United States on March 24, 2023",
        "Body": "Yes, my subject line sounds like that trash hyperbole you get on annoying pop-up ads on your Smartphone! And ironically, it usually has to do with ear buds. There are tons of them on the market, and everyone claims to be the best.Now, first off, I am just a customer… never got any gifts or money or anything from this company, nor was asked to “click on a review” for a discount or whatever. No… the reason for all this hallelujah chorus, is that I’m really totally both jazzed, and a bit in awe of these earbuds. I think the main mind-blowing thing about them is the price. I mean, I have a bit of experience and knowledge with this kind of technology, and frankly, these days, what “guts” that are needed to be used to create Bluetooth ear buds is not that complex… nor expensive. How company’s like Sony, Apple, Bose, etc. can charge upwards of $300 for these boarders on theft and fraud!I’ve tried those “Rolls Royce” buds, and I urge you to do the same, and then try these Tagry Bluetooth Wireless Earbuds that are literally 90% less expensive. Yes, they retail for about $35! They come in an excellent quality charge base, are extremely easy to put on, (and have three extra size buds to give you a custom fit), and most important, their sound quality, and I mean crisp highs, solid middles, and bone- rumbling base, are outstanding. I cannot understand what more you would want either using them for talk radio, podcasts, YouTube, streaming movies, or TV, or playing your Amazon Music or Spotify or iTunes playlists. And yes, if connected to your iPhone, you can make and receive calls, and the microphone in the buds are top quality.Their Bluetooth software is flawless, connecting to your iPhone, or other Bluetooth devices effortlessly. They come with a pleasant woman’s voice letting you know various messages, like which earbud is in what ear, if they are connected or turned off, your volume control (including excess volume warning), etc.I’ve had these for several months, and have found the charging, which has a bright LED display and shows the individual charging of each bud, along with their percentage easy to read.And a note on their service. I’ve heard horror stories of folks trying to reach the outrageously over-priced other earbud company’s for tech support, or refunds, exchanges, etc. Basically it’s nonexistent, and when you do miraculously find a phone number to call them, and get someone on the line, you have to go to the UN to find an interpreter of rare third-world languages to understand what they are saying, and they seem to be trained, not on anything to do with the product, but to make the call as useless and confusing as possible, so that you will just give up and throw their buds, and your money in the trash.Now, I did have an initial problem, after a few months, in that the base charger seemed to be slowing a bit. Tagry gives you a LIFETIME WARRANTY… yes, an actually lifetime warranty, not one of those sham “lifetime warranties”, that corrupt company’s like Hammacher Schlemmer  have.I had enrolled with Tagry, on their website, to activate my warranty as soon as I received the buds. I called Tagry when I was seeing what could be a glitch in their charging base, and yes, unlike most other companies who hide their contact numbers as if they were nuclear codes, Tagry’s support phone number is plainly printed on their manual, and to my astonishment, I immediately was connected to a good ‘ol American customer service person, who actually worked for the company, spoke English, and made me feel as if I was a long-ago trusted friend. They truly cared, and said they were sorry, and that there was no need to troubleshoot the base, or return it, instead, they would process an order to send me a new one.A day later, they actually called me back to let me know that the replacement had been shipped, and that I should have it in a day or so, and if not, to please call them back right away. And yes, to apologize again for any inconvenience.  The replacement arrived the very next day. And again, their warranty is indeed for a lifetime, a no questions asked replacement policy. This is how much they believe in their product, and respect their customers.So, yes. It is insane to pay more than $35 for quality Bluetooth earbuds. Last year, I sent about a dozen of these out to friends and employees, to use for personal use, and for all that Zooming going on… and they love them. And none of had any problems.I’m sure you have had a plethora of bad experiences in the past few years, what with isolation, and way too much ordering on-line, finding the products you buy to be substandard, and customer service virtually non-existent. And that is why I’ve spend all this time expounding on the greatest of my earbuds. Yes, I have a life. Really. But what a joy to be able to tell a story like this, rather than the kind of frustration most of us are experiencing every day!Yes, goodness and quality still exist. It’s rare… but it’s out there!",
        "Number": 5
    },
    {
        "id": 24,
        "Reviewer": "Semiha",
        "Rating": "5.0 out of 5 stars",
        "Title": "Perfect …The best earphone I purchased",
        "Date": "Reviewed in the United States on February 29, 2024",
        "Body": "I keep losing my Apple earphones so I gave up buying them and tried this one ,but before coming to this I Ofcourse tried other brands,everything else I tried was garbage…But this one is life changing…..Everything about this earphone is great,not even one single downsize I can name …Price point ,battery life life is great,sounds great,very pretty,digital screen that showed the battery life is cherry on the top…Very comfortable to wear…You name it …. This might be the best purchase I made on amazon,and I have been shopping here more than 10 years…But now :)",
        "Number": 5
    },
    {
        "id": 25,
        "Reviewer": "Kayla",
        "Rating": "5.0 out of 5 stars",
        "Title": "Long lasting earbuds",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "Didn't want to spend a bunch of money on apple airpods so I bought these as an alternative. The sound is great and they stay in my ears. I took them traveling with me and I've never had them fall out and it's been months now. The battery life lasts a long time and the case tells you how much battery is left. Easy to connect to any of my devices too I've never had an issue. The rose gold color is also super cute too I got compliments on it",
        "Number": 5,
        "image_urls": [
            "61DkFi0i4eL._SY88.jpg",
            "61yk0+CNpxL._SY88.jpg",
            "71kMSuoRFyL._SY88.jpg"
        ]
    },
    {
        "id": 26,
        "Reviewer": "JM",
        "Rating": "5.0 out of 5 stars",
        "Title": "Indestructible",
        "Date": "Reviewed in the United States on March 22, 2024",
        "Body": "I bought these on sale, figuring they’d be at least decent for the lower price but having pretty low expectations overall. I just needed some bluetooth headphones. I started accidentally abusing them and found out that they are indestructible, and as a nice bonus, they sound nice!I’ve had them for about a year now.•I lost them on the riding lawn mower—they were stuck in a thing on the back that I won’t describe, but they were really hard to get out.•They were in my pocket and went through the washer and dryer, and when they came out, they worked like normal, no difference in sound quality. Just the headphones went through, not the case.•I lose them all the time, either one or the other or the entire case. The battery life is so long that sometimes I can’t find the case for two days but can still use the headphone (s) that I have with me. Also charges fast.Definitely worth buying. Easy to pair to any device as long as they aren’t already paired to something else.",
        "Number": 5
    },
    {
        "id": 27,
        "Reviewer": "maria jweihan",
        "Rating": "4.0 out of 5 stars",
        "Title": "Best Earbuds I’ve ever purchased",
        "Date": "Reviewed in the United States on January 20, 2024",
        "Body": "Bought 3 of these 11/2022 (for me, hubby, and daughter). I’m not a techy person so no technical comments here. The first year having them were great… super long run time, easy connect to phone, computer and tv, sound was great.  After first year one of my earbuds stopped charging. I cleaned case and earbuds really good but still not working I then dropped the case with earbuds it it then it started to work.  Also for past month even with a full charge, very seldom it would cut off sound quickly.  Last for a couple seconds only. Also my daughter’s one earbud stopped working. But my husband’s earbuds have worked perfectly, no issues. For the price and performance I would definitely buy again.",
        "Number": 4
    },
    {
        "id": 28,
        "Reviewer": "David Kim",
        "Rating": "4.0 out of 5 stars",
        "Title": "GREAT build quality, BUT .... (UPDATED: Excellent Customer Service!)",
        "Date": "Reviewed in the United States on February 18, 2024",
        "Body": "(UPDATE: Right after expressing my concerns with the sound quality, customer service reached out to see how they could help! I added a star because it's REFRESHING when customer service is actually great!)... it's got issues.At the time of writing, I'm writing this review, mostly because this product has SO much promise, but it has two issues that left me disappointed. Also, for preface, I'm a filmmaker who also makes music, so I'd say I have a good ear for sound.First, the good: The build quality is EXCELLENT, especially for the price! It's a bit bigger than some competitors, but it's really light and well-made. The screen is helpful, and the earbuds themselves feel solid. Bluetooth connectivity is straightforward as well!Now, onto my critiques: A smaller one, but still important, but the noise cancelling just doesn't work on this. While it does a good job blocking out sound, I've had friends and family members complain about my microphone when calling. The product actually lists that it has some sort of noise canceling for calls, but it's nothing really special.But that's not my biggest problem.It's just the sound is SO off! Some people might be able to get used to it, but I can't. It was really shocking because the first impressions were great, and I don't get why so many people have reviewed this so positively. As someone who listens to a wide range of music (hip hop, rock, pop, even traditional East Asian music!), the earbuds do a poor job of outputting a clear sound. The mix is REALLY muddy, especially at the low frequencies. Basses really mess up male vocals, and high frequencies are airy. The mids seem completely missing, almost like the inverse of what you'd hear through a phone!If they can just adjust their EQ to sound fuller (and maybe tone down the bass), then these would be INCREDIBLE. Again, I'm SHOCKED that this has as many positive reviews. I'd rather buy $8 wired earbuds over these. This product has HUGE POTENTIAL, but completely WASTED buy the actual sound quality.(And no, I will not be downloading EQ's specifically for these earbuds. I have too many devices)The Tozo T6 (my previous earbuds) are a great alt at this price point (whenever it's on sale at least), but since I wanted to try something new, I'm sticking with the JBL Vibes. They sound great :)",
        "Number": 4
    },
    {
        "id": 29,
        "Reviewer": "Alaric Holmes",
        "Rating": "5.0 out of 5 stars",
        "Title": "Not bad for the money",
        "Date": "Reviewed in the United States on March 17, 2024",
        "Body": "I originally reviewed these earbuds saying that you couldn't just use one bud without the other one draining it's battery as well, but that's not strictly true (although there is a risk of it).  You need to be mindful not to close it too quickly after taking out the bud you want to use.  As long as you give it a few seconds before closing it, it appears to reliably recharge the other one (it loses a very small amount of power since it was activated upon opening the charger).I didn't have to take this precaution with my old Boltune earbuds, but I couldn't find those online anymore, so I had to try something else (these ones).Aside from the charging issue, which I appear to have resolved, according to people I talk to over the phone, these don't sound as good as my old buds, but people don't seem to have a hard time understanding me.  That said, I don't often hold conversations in loud environments, and so I don't know how well these filter out loud background noise.Still, so far so good.  They're comfortable and they sound pretty good, especially for the price.  In fact, for the price, they're really good.",
        "Number": 5
    }
]