[
    {
        "id": 0,
        "Reviewer": "Ana",
        "Rating": "2.0 out of 5 stars",
        "Title": "Not worth it",
        "Date": "Reviewed in the United States on December 2, 2023",
        "Body": "I got this for a heavy black friday discount and had high hopes. But ti really wasnt worth it for me.They stay in my ears until i laugh, chew, or im doing a workout. And then im fighting to keep them in my ear until I find the exact spot they sit comfortaby.And then if im constantly adjusting, my fingers hit the button no matter how i hold the earbuds. And of course when I want them to register my finger input, im pressing 3-4 times for it to notice. And then if im double tapping to skip to the next song, it only registers the first one and then pauses the music.Long story Short,im returning these. If you have a lot of patience, then get these. If not, i recommend getting ones that are smaller/sit in the ear better",
        "Number": 2
    },
    {
        "id": 1,
        "Reviewer": "Chelsea Morehead",
        "Rating": "2.0 out of 5 stars",
        "Title": "PAINFUL",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I’ve tried to wear these for days hoping my ears just needed to get used to them but they’re not. Nobody mentioned how terribly uncomfortable and painful these were in the reviews. I’ve tried wearing them with and without the ear tips and they’re still extremely uncomfortable and painful. I will be returning them.",
        "Number": 2
    },
    {
        "id": 2,
        "Reviewer": "Amber",
        "Rating": "2.0 out of 5 stars",
        "Title": "Ear buds are painful!!",
        "Date": "Reviewed in the United States on January 9, 2024",
        "Body": "I like everything about these Barbuda except that they are incredibly painful to wear! I've tried all 3 sizes provided (horribly smashed, btw) and all 3 cause extreme pain. I've had to use a pair from an old set which provides slight comfort but only for a limited time. I cannot wear these for more than 10 mins without extreme ear pain. It feels like there's a plastic seam that just rubs the inside of the ear and it hurts! If I can't figure out a solution, I will have to return these. Very disappointed 😞",
        "Number": 2
    },
    {
        "id": 3,
        "Reviewer": "Mikaela",
        "Rating": "2.0 out of 5 stars",
        "Title": "Not as very good as the reviews made them out to be",
        "Date": "Reviewed in the United States on February 7, 2023",
        "Body": "The aesthetic of the earbuds is pretty nice, I enjoy the color and sleekness to it and think its overall visual design isn't bad at all. I especially like how you can see the battery life of the earbuds, which was the feature I was most attracted to, but that's really where my compliments end, and the only reason why I bothered giving an extra star.The earbuds are pretty uncomfortable if you have smaller ears. They feel tight and overly stiff and will make your ears feel on the sore side with extended use. Which is a shame, because again, visually, they look quite nice. They come off quite easily in my experience, so working out and running wouldn't be the best use of these headphones. It doesn't feel secure at all to my ears, but it could also simply be because they don't fit smaller ears in general too well.Secondly, the sound quality isn't very good at all. It sounds muffled and cheap, not something worth around a $30 price point. If you're not someone who cares about sound quality and just want a working pair of wireless earbuds that get the job done though, and you don't mind the muffled-ness, I can see this being a decent pair of headphones for you.Thirdly, I noticed pretty quickly, almost immediately actually, that the battery drains rather quickly. Not even a full 3-5 minutes had passed before it dropped 5%, which may not sound like a lot, but compared to other wireless headphones I've used its rather quick. Even now it's dropped 10% in 10 minutes and I haven't even used/touched it in that time.Overall, I think it's better to find a better pair of earbuds for half the price because there are much better options out there. For the price point, it isn't worth it, and I'm pretty disappointed considering all of the positive reviews.",
        "Number": 2
    },
    {
        "id": 4,
        "Reviewer": "Anonymous",
        "Rating": "2.0 out of 5 stars",
        "Title": "Earbuds That Fail At Being Earbuds",
        "Date": "Reviewed in the United States on February 2, 2024",
        "Body": "The worst pair of earbuds I've gotten outside of the kind of convenience stores that have sticky floors and a vague smell of malaise.The audio quality listening to music was meh.  On phone calls, no one could understand me because the microphone volume would go in and out.  Even wearing a properly fitted rubber tip, they don't stay in your ears.  I had mine for less than 48 hours before one fell out and immediately ran off to the magical land that your ballpoint pens and socks disappear to.",
        "Number": 2
    },
    {
        "id": 5,
        "Reviewer": "AmazonReviewer",
        "Rating": "2.0 out of 5 stars",
        "Title": "Not good for audiobooks",
        "Date": "Reviewed in the United States on April 25, 2023",
        "Body": "I use headphones primarily for audiobooks (and phone calls if someone calls while I’m listening to one). I can’t speak for the call quality because I listened for 2 minutes before deciding to return these. There is an ever-present background noise/static in these earbuds. I have really good hearing (probably to make up for my crappy eyesight lol), so maybe not everyone can hear it, but it is extremely noticeable and distracting to me when listening to audiobooks.As a test, I tried a short YouTube video and didn’t notice it as much (there is constant music/talking in most videos that mostly drowns out the static noise). But for audiobooks where the sound is just one person’s voice+pauses while they narrate, these are not the earbuds for that.My previous earbuds (that had great sound quality for the same price) were broken accidentally and that earbud brand is no longer available on Amazon, so I tried these after reading the good reviews. Bummer that they didn’t work out. My journey to find a suitable replacement continues.Giving the product 2 stars instead of 1 because their warranty is lifetime, even if lost, which I don’t see offered often. Also comes with a (very short) charging cord (my last pair did not come with one) and multiple rubber cone sizes for your ears. The shipping was extremely fast (same day) and the color options are cute. So two stars for those things, but with the sound quality being what it is (on audiobooks especially), I can’t say it “meets expectations” as one would expect from a 3 star rating.",
        "Number": 2
    },
    {
        "id": 6,
        "Reviewer": "Kimberly",
        "Rating": "2.0 out of 5 stars",
        "Title": "Keeps Falling Out",
        "Date": "Reviewed in the United States on January 5, 2024",
        "Body": "My husband and I have a different sleep cycle and I get up way early.  I purchased these so that I could listen to TV and do quiet stuff around the house without waking him.  No matter what I do, these ear buds keep falling out.  I've tried all the different sizes and the only way these stay in my ears is to not move.  Anytime I get up to do anything they fall out.  If they stayed in I would like them much better.",
        "Number": 2
    },
    {
        "id": 7,
        "Reviewer": "Bertram Krueger",
        "Rating": "2.0 out of 5 stars",
        "Title": "Even on sale, it wasn't worth it.",
        "Date": "Reviewed in the United States on January 30, 2024",
        "Body": "I got these on sale since I needed a quick replacement pair of earbuds. They didn't fit in my ears nearly as well as I'd hoped. The buttons on the side for pausing/unpausing were awkward to use from a lack of a physical button and a solid 2.5 second delay between input and response. The audio quality was also very poor, with songs sounding muffled and fuzzy like they were coming from the other side of a wall late at night. At least the battery life is good.",
        "Number": 2
    },
    {
        "id": 8,
        "Reviewer": "Bill Petrie",
        "Rating": "2.0 out of 5 stars",
        "Title": "Garbage.",
        "Date": "Reviewed in the United States on February 25, 2024",
        "Body": "I’m giving this two stars because the connection process was easy. Once connected, these were a severe disappointment from a sound perspective. I’d rather listen to my music on a 1970s era transistor radio as it would have more bass. I got wooed by the price and got burned.",
        "Number": 2
    },
    {
        "id": 9,
        "Reviewer": "MarshWalker",
        "Rating": "2.0 out of 5 stars",
        "Title": "Controls have very poor response",
        "Date": "Reviewed in the United States on March 5, 2024",
        "Body": "I'm constantly having to tap, tap, try again, hold my finger down, try tapping again... once in a while it works, but if I'm driving and need to answer a call this is NOT going to work. It's very frustrating just watching videos! The sound has little bass. Returning.",
        "Number": 2
    },
    {
        "id": 10,
        "Reviewer": "Veronica Dixon",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great Earbuds!",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "These are amazing - especially for the price. I can easily take calls on my phone, or my computer. Listen to music while I'm out and about. I fly a lot for work and these earbuds are comfortable. The only reason I gave it 4 stars is because I have super small ears. Even with the smallest silicone inserts, they get pushed out of my ears after about 45 minutes of use. For longer durations, I just use my over-the-head headphones which I prefer anyway. But these are wonderful!",
        "Number": 4
    },
    {
        "id": 11,
        "Reviewer": "Bingo",
        "Rating": "4.0 out of 5 stars",
        "Title": "For the most part they're good",
        "Date": "Reviewed in the United States on February 1, 2024",
        "Body": "I only have 2 problems with them (as of the day of receiving them):1. They're always loud. Even on the lowest volume setting I can have them on before they stop playing audio altogether (until I turn the sound back up)2. I wish there were left-right indicators on the earbuds themselves. I'm kinda dumb and can't really tell which earbud is supposed to go in which ear until I actually put them in.3. (Not really an issue but it's still something I'd like to talk about): the touch controls are definitely something to get used to. One thing I've also noticed is that you can only use the earbuds to adjust the volume of there's any media playing. Otherwise it won't work at all.4. The earbud case battery also drains a bit too quickly for comfort. Other than that, everything's fine so far.",
        "Number": 4
    },
    {
        "id": 12,
        "Reviewer": "Mr. B",
        "Rating": "4.0 out of 5 stars",
        "Title": "Everything is getting smaller, is it really worth it?",
        "Date": "Reviewed in the United States on March 12, 2024",
        "Body": "They work great. My only complaint is they are so small that every time I grab them I touch a different control and change something even while just trying to push them back in my ears. There are a number of control built into the head sets pieces. Once you start your machine most everything can be controlled from touching the ear pieces.",
        "Number": 4
    },
    {
        "id": 13,
        "Reviewer": "Jackie Pronovost",
        "Rating": "4.0 out of 5 stars",
        "Title": "Earbuds for small ear canals",
        "Date": "Reviewed in the United States on February 22, 2024",
        "Body": "I hate when I put in eabuds, and they proceed to fall out of my ears even when I use the smallest size. The true wire Earbuds have been in my ears since I took them out of the box and have not fallen out yet which is a record. I know I am going to enjoy listening to my podcasts and music with these earbuds because I won't have to keep looking for them or pausing whatever I am doing. I might get some things done quicker.",
        "Number": 4
    },
    {
        "id": 14,
        "Reviewer": "xdgaf",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great for the price",
        "Date": "Reviewed in the United States on March 5, 2024",
        "Body": "My wife is always losing headphones so after losing multiple more expensive ones she uses these and loves them just as much and still hasn’t lost them. Battery life is good sound quality is decent only complaint is it is hard for the person to hear you on the other end of there is any background noise it starts to mesh together.",
        "Number": 4
    },
    {
        "id": 15,
        "Reviewer": "Nicole w",
        "Rating": "4.0 out of 5 stars",
        "Title": "UPDATE: my bad, they work fine.",
        "Date": "Reviewed in the United States on January 19, 2024",
        "Body": "so.... my bad. I did not have my PC bluetooth antenna hooked up properly. Which is strange bc i work with computers for a living. anyway, the ear buds work actually super well with my pc now and are my go to for zoom calls.good job guys and i apologize for the initial negative reviewignore previous review below.works great as earbuds for a phone, but do NOT try to use them with a PC or laptop. For whatever reason in this situation their range is axed to like 6\", and they cut in and out constantly if your head isn't right next to your computer. It makes zoom calls so insanely frustrating.",
        "Number": 4
    },
    {
        "id": 16,
        "Reviewer": "Loren",
        "Rating": "4.0 out of 5 stars",
        "Title": "Really solid choice for wireless earphones!",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "I use these EVERY DAY! I love them. The only issue I have is that sometimes the mic works seamlessly, sometimes, I have to disconnect and reconnect. But for the price, they're really solid!",
        "Number": 4
    },
    {
        "id": 17,
        "Reviewer": "S. Westfall",
        "Rating": "4.0 out of 5 stars",
        "Title": "Only connects to 1 device",
        "Date": "Reviewed in the United States on February 27, 2024",
        "Body": "A little disappointed, because another Bluetooth earbud device I have can connect to both my cellphone and my tablet at the same time, but this earbud does not. I have to disable Bluetooth on one device in order to be able to manually connect it to the other device.",
        "Number": 4
    },
    {
        "id": 18,
        "Reviewer": "WAL IV",
        "Rating": "4.0 out of 5 stars",
        "Title": "Sometimes have to re-pair",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "Sound is great.  Fit well in the ears/stay put pretty well.  Biggest issues - I have to re-pair with my device once in a while and the microphone for phone calls isn’t always clear for the listener.  Overall, I’m super happy and would buy these again.",
        "Number": 4
    },
    {
        "id": 19,
        "Reviewer": "Nia",
        "Rating": "4.0 out of 5 stars",
        "Title": "Pretty good",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I think these AirPods are pretty Good the quality is pretty good they are very loud, the audio is clear enough for me. For the price they work very well.",
        "Number": 4
    },
    {
        "id": 20,
        "Reviewer": "BT",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great value for the money",
        "Date": "Reviewed in the United States on February 6, 2024",
        "Body": "They are a great value.  Connect well and sound good.  The audio when speaking on the phone is not great, but sufficient, especially considering the cost.",
        "Number": 4
    },
    {
        "id": 21,
        "Reviewer": "Ducci",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great for price.",
        "Date": "Reviewed in the United States on February 11, 2024",
        "Body": "Very good battery life and quality. Only thing it needs improvement on is the mic. Im very low and unclear sounding on the other end of a convo.",
        "Number": 4
    },
    {
        "id": 22,
        "Reviewer": "Placeholder",
        "Rating": "4.0 out of 5 stars",
        "Title": "Warranty",
        "Date": "Reviewed in the United States on February 23, 2024",
        "Body": "The buds are fine. And work well so far, but the \"Lifetime Warranty costs $49.99 and you can buy new ones for less than 1 months Warranty, LOL.",
        "Number": 4
    },
    {
        "id": 23,
        "Reviewer": "braz",
        "Rating": "4.0 out of 5 stars",
        "Title": "Mostly satisfactory",
        "Date": "Reviewed in the United States on February 16, 2024",
        "Body": "They sound good, they're comfortable, the price was right and I'll keep them.  The wireless charging feature is questionable ... they stalled out at 81%, never got any higher and generated considerable heat in the process, but I do appreciate the  clear status readout ... connected to a USB cable they charge up to 100% very quickly and deliver good sound for longer than I'm used to with earbuds",
        "Number": 4
    },
    {
        "id": 24,
        "Reviewer": "MotherofChaos",
        "Rating": "4.0 out of 5 stars",
        "Title": "Touchy touch feature",
        "Date": "Reviewed in the United States on February 4, 2024",
        "Body": "These area a great affordable set! They have excellent sound quality and an impressive battery life! My star deduction is for the touch feature.  Sometimes a wisp of hair or a strong breeze will cause an unexpected pause while other times I'm tapping the crap out of them and nothing happens.  This is definitely annoying.  BUT, for the price this is an excellent buy and I would definitely recommend for anyone on a budget!",
        "Number": 4
    },
    {
        "id": 25,
        "Reviewer": "Rene A.",
        "Rating": "4.0 out of 5 stars",
        "Title": "Good product compared to others",
        "Date": "Reviewed in the United States on March 16, 2024",
        "Body": "This is better compared to more expensive comparable products I bought. However, it only works on my Ipad and I can't use it on my Google phone.",
        "Number": 4
    },
    {
        "id": 26,
        "Reviewer": "Nessa",
        "Rating": "4.0 out of 5 stars",
        "Title": "Clear audio either a long battery life",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "I like the noise cancelation and that I can tap to end music or to play.  Is small and neat.  Audio is clear.",
        "Number": 4
    },
    {
        "id": 27,
        "Reviewer": "Lck143",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great sound",
        "Date": "Reviewed in the United States on March 7, 2024",
        "Body": "Great sound, easy pairing and awesome battery life. Some trouble figuring out the operating of functions and unfortunately hurt my ears. But most earbuds do. Need to try a different type. Still using these just not for long periods.",
        "Number": 4
    },
    {
        "id": 28,
        "Reviewer": "James Brian Copp",
        "Rating": "4.0 out of 5 stars",
        "Title": "Pretty darn good for the price",
        "Date": "Reviewed in the United States on February 25, 2024",
        "Body": "These have already lasted longer than any other cheap pair I've purchased.  Better quality sound than I expected.  I love how you can just put them back in the little case and the little case recharges them.",
        "Number": 4
    },
    {
        "id": 29,
        "Reviewer": "Esty Blatt",
        "Rating": "4.0 out of 5 stars",
        "Title": "Poor noise cancelling",
        "Date": "Reviewed in the United States on February 5, 2024",
        "Body": "Great battery life and the case charges the earphones well. Good bluetooth and connects automatically to device when you open the case.These are cheap headphones in price and value.Poor noise canceling, people have a hard time hearing me if I'm outside or on the bus because of the background noise.If I'm speaking softly (if someone is sleeping in the other room) the earphones don't pick up the sound well.",
        "Number": 4
    },
    {
        "id": 30,
        "Reviewer": "Katie",
        "Rating": "2.0 out of 5 stars",
        "Title": "These work, but a couple of things you should know...",
        "Date": "Reviewed in the United States on November 23, 2022",
        "Body": "I bought these after dropping my Apple Air Pods in a bowl of marinade (FYI - They are not oil proof). I figured if I was going to be doing dumb things like that, I shouldn't be spending $150 on headphones. So I found these which were a bargain at $30.I've been using them for a couple of months now and I've noticed a couple of unusual things:1. Unlike Air Pods, these will not automatically stop playing if you take one of the ear buds out. The Apple ones will automatically pause whatever you are listening to if you take one out. A couple of times these did stop playing when I took them out, but most of the time they don't.2. I've discovered that occasionally, even if I pause what I'm listening to, take the headphones out and put them in their case, sometimes they will begin playing again all on their own, even though they are in the case. I realized that after I went back to pick up where I left off in my audio book and found that it had been playing for more than an hour and I had to go back and figure out where I was in the book.3. Occasionally, not all the time, after I pause what I'm listening to and take the headphones out, the music or audiobook will all of a sudden start up again but play out of my phone speaker, not the headphones. It's a little awkward at work when that happens, especially if I get up from my desk and walk away only to find when I come back that my phone has been playing my audio book out loud the whole time.4. Most annoying of all: Sometimes I will put the headphones on, and it will start playing really loud and will not allow me to turn it down. The headphones will say \"Volume Maximized\" while it's blasting my ear drums. I try to turn it down on my phone and see that the volume goes down, then the headphones bring it back to full volume and again scream at me \"Volume Maximized\". It's awful.The only good thing I can really say about these is that they were cheap. I would not recommend them to anyone now that I've had a chance to use them for a while. I'm probably going to start looking for an alternative.",
        "Number": 2
    },
    {
        "id": 31,
        "Reviewer": "Sheila",
        "Rating": "2.0 out of 5 stars",
        "Title": "These last two months max",
        "Date": "Reviewed in the United States on February 24, 2024",
        "Body": "Second set died 45 days after I received them as a replacement for the first set that did the same thing. They’ll drop connection in the middle of a speaking on the phone and don’t even think about trying to connect and put them in your ears after you’ve already picked up a call. They won’t connect properly mid call without having to switch several times between audio sources until they finally decide to work. I knew I should have just purchased a set of AirPods but I got these trying to save money. Well ya get what you pay for. And it’s too late to return them.  Junk.",
        "Number": 2
    },
    {
        "id": 32,
        "Reviewer": "Dennis G",
        "Rating": "2.0 out of 5 stars",
        "Title": "Waterproof? Not whatsoever....",
        "Date": "Reviewed in the United States on November 7, 2023",
        "Body": "I bought these as a replacement so I could have music for working out.I AM A SWEAT-ER IN THE GYM.... If you are too, try something else. I had a pair and after a week of cardio and weights, one ear bud went out in a blaze of glory by the volume shooting up in ear to the max before dying completely. Then, you put it in the case and it becomes a blackhole and sucks the energy out of the case and still doesn't charge. Thought it was a fluke, returned them and started fresh.New day! Similar results... A very annoying thing about these is when you put them in the case, they stay connected to your phone so if you're in the vicinity of your earbuds watching social media videos, they're silent and you don't know why. Then you have to unnecessarily deal with that.My 2nd pair just died and it's outside the return window. We'll see what happens. They're decent if you use them for everyday use and don't sweat in your cubicle. \"Value for the money\" is true.",
        "Number": 2
    },
    {
        "id": 33,
        "Reviewer": "Brendan",
        "Rating": "2.0 out of 5 stars",
        "Title": "Can't stop it from blasting music when I put them in",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "They work fine as headphones for music and calls although sometimes the controls can be accidentally activated by touching the headphones as you put them in.The big problem is that if I put them on without audio already playing on my phone, the headphones blast the first song in my Apple Music at full volume.  After two weeks, I can't figure out how to stop it, so I'm just going to have to get a different pair of earbuds.",
        "Number": 2
    },
    {
        "id": 34,
        "Reviewer": "Juanito",
        "Rating": "2.0 out of 5 stars",
        "Title": "Sound ok. Battery time not so good.",
        "Date": "Reviewed in the United States on January 27, 2024",
        "Body": "I always check the items that have most purchases and then by their score. I saw this item had both, so I went for it. I am a big music fan and listener and that's the main reason why I got this earbuds.. the sound quality it's ok, not great as I expected, I want my ears to rattle when I listen to a good bass song... Maybe I am being picky but these buds didn't meet my expectations.Battery time is also not so good. Only lasts for half a day when other earbuds out there lasts way more... Not a big fan, will not keep them long.Luckily for me I got other earbuds that are slightly better than this ones.",
        "Number": 2,
        "image_urls": [
            "61QO+zw8PiL._SY88.jpg"
        ]
    },
    {
        "id": 35,
        "Reviewer": "Joonuper",
        "Rating": "2.0 out of 5 stars",
        "Title": "Awful",
        "Date": "Reviewed in the United States on September 2, 2023",
        "Body": "I got these because the waterproof level indicated for them in the listing means they should be able to be used in the shower. About 2 weeks after I began wearing them the right earbud stopped taking a charge, and then stopped working altogether. The left earbud still works but 1) the sound quality is TERRIBLE - there is far too much bass in these. I guess that would be appealing for some types of music but I use them for podcasts and it made it so I couldn't understand so much of what was said. And 2) sometimes it starts turning up the volume for no reason and I can't get it to stop. Fun fact: when it reaches the maximum volume on your device, it starts screaming \"MAXIMUM VOLUME\" into your ear, at maximum volume, over and over and over as if that's any better than just listening to your music or podcast at maximum volume. And it doesn't stop until you turn your volume down, and in my case the earbud would continue to force the volume back up again on its own. I'd have to (in the middle of my shower) disconnect the earbud and reconnect it again in order to make it stop. My guess is that the 2nd earbud will stop working within the next month.",
        "Number": 2
    },
    {
        "id": 36,
        "Reviewer": "Angii Hansen",
        "Rating": "2.0 out of 5 stars",
        "Title": "Won't keep a charge",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "I bought one of these a couple of years ago and absolutely loved it and still use it all the time. This last one I bought will not keep a charge. I took it on vacation and couldn't get the ear pieces to charge. I plugged it in multiple times and it says it's charged at 100%, but I put the earbuds in and they keep saying low battery. 😒",
        "Number": 2
    },
    {
        "id": 37,
        "Reviewer": "Sandor H",
        "Rating": "2.0 out of 5 stars",
        "Title": "Broke pretty quickly",
        "Date": "Reviewed in the United States on February 19, 2024",
        "Body": "Loved these little things when I first got them. Decent sound, cool little charging case. Carried a charge for a decent amount of time.About 3 or 4 months in the right earbud stopped charging. It's dead and there appears to be no way to fix it. Now I only had one working bud, man. Not terrible for calls or podcasts but I paid for two, damn it.",
        "Number": 2
    },
    {
        "id": 38,
        "Reviewer": "William D Medley",
        "Rating": "2.0 out of 5 stars",
        "Title": "Good sound, bad microphone",
        "Date": "Reviewed in the United States on March 8, 2024",
        "Body": "Nice little head phones, ear buds, but the microphone seems to be spotty.  Good for listening to music, sound is find, but when use them with phone or computer phone, people on the other end say the mic is cutting in and out, even though sound is still good.  So not sure about using them for two way conversations.",
        "Number": 2
    },
    {
        "id": 39,
        "Reviewer": "qiliansnow",
        "Rating": "2.0 out of 5 stars",
        "Title": "Great for listening , but not for phone call",
        "Date": "Reviewed in the United States on March 3, 2024",
        "Body": "With more and more complaining about poor voice heard from the other side when having a phone call, while the voice is perfect heard on the other side when switching to my iPhone speaker mode, I just realized it should be the problem of this BT earbuds. I wish I happen to get a faulty one.",
        "Number": 2
    },
    {
        "id": 40,
        "Reviewer": "Tatiana L.",
        "Rating": "5.0 out of 5 stars",
        "Title": "A very good set of earbuds for a fair price",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "I have Samsung and AirPods Pro that I use every day. I needed one more set of earbuds, less expensive, to carry with me. I must say that I am impressed with the quality of this product. I had no issues with paring, charging, or using it. I do not know how long exactly the charge lasts, but I take 2-hr walks and use these earbuds for at least this long without needing to recharge them. I am pleased with my purchase and would recommend this product to others. Sometimes, fortunately, you do not need to pay top dollar to get a good quality gadget.",
        "Number": 5
    },
    {
        "id": 41,
        "Reviewer": "Rick R",
        "Rating": "5.0 out of 5 stars",
        "Title": "Tagry X08’s.  👍",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "Just got these today.  They paired quickly to my iPhone 12 and my laptop.  Immediately queued up some nirvana.  For 34 bucks I was amazed how good they sounded.  I then went to my laptop to see how they were on a Dan Bongino Rumble podcast.  Once again, the speech was crisp.  The lifetime warranty took about 5 seconds to complete.  My only issue is the controlling of functions by tapping a specific spot on the ear buds.  This seemed clunky but it’s probably due to the fact I’ve never used wireless earbuds.  They were comfortable and the sound really impressed me.  Not sure how you can go wrong with these considering the lifetime warranty.",
        "Number": 5
    },
    {
        "id": 42,
        "Reviewer": "Robin L.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great Bang for the Price!",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "I have two sets of apple pods; one is missing, and the other will no longer pair with anything! I did not want to spend the $$ on another one right now, but I needed something that would pair with my desktop and have a great sound. I bought these and am VERY satisfied with the quality. I like that you can see a digital readout for the life left in the case. However, the one drawback is that the case has no weight. I would be afraid to drop it instead of my Apple earbud cases.",
        "Number": 5
    },
    {
        "id": 43,
        "Reviewer": "Deb",
        "Rating": "5.0 out of 5 stars",
        "Title": "They are great including the mic",
        "Date": "Reviewed in the United States on March 17, 2024",
        "Body": "I have been really impressed with the quality of these earbuds and even more impressed with the mic. This was the feature that I was most concerned with for hands free calling and they have worked really great. I’ve used them for video conferencing and the sound quality is excellent, both incoming and outgoing. I’m tempted to buy another set just in case these ever go out. I’ve never used AirPods so I can’t give an accurate comparison but for this price point and quality I would definitely recommend these.",
        "Number": 5
    },
    {
        "id": 44,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great value for the price",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "These replaced my very old Totu ones and I am very happy with them. They automatically connect to my phone as soon as I take them out of the case.  The quality of sound on phone calls (all I currently use them for) is good.  I usually use both but they work with just one if you need to hear surroundings. Since I leave them plugged in when not in use, I can't comment on battery life.",
        "Number": 5
    },
    {
        "id": 45,
        "Reviewer": "Holly",
        "Rating": "5.0 out of 5 stars",
        "Title": "Suprisingly Great Quality For Price",
        "Date": "Reviewed in the United States on February 6, 2024",
        "Body": "I got these wireless earbuds for my boyfriend as a Christmas present and he LOVES them. He had AirPods for a little while and he says he likes these BETTER than his previous AirPods because he likes that he can see the battery percentage on the case, they stay charged for such a long time, and they charge very quickly. The only flaw might be that sometimes it’s hard to hear him when I’m calling him, but that could be other contributing factors (like he has an old iPhone 6, uses them while riding a motorcycle, or bad service, he mumbles sometimes) and not necessarily the devices fault but otherwise I can here him perfectly. These are surprisingly great quality for the price. I would recommend getting the warranty just in case though, because they are cheaper than competitors but otherwise it’s a great product. They’re not noise canceling but I don’t think they’re advertised to be noise canceling. Overall they work exactly as advertised.",
        "Number": 5
    },
    {
        "id": 46,
        "Reviewer": "Tiziano Mammana",
        "Rating": "5.0 out of 5 stars",
        "Title": "They work flawlessly and for the price are unbeatable !",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "I got these earbuds last year using them on my samsung S9 first and then on my Iphone 14 pro later and they worked flawlessly for 10 months and then one day the phone begun to not recognize the bluethooth on them even doing different reset on the earbuds and on the phone so I email the company and they quickly replied suggesting me some trouble shoot to fix the problem but nothing worked out so they sent me a new pair in a few days without any problems and the new pair is working better than the previous one. Really professional company with a really affordable price! 100% recommended!",
        "Number": 5
    },
    {
        "id": 47,
        "Reviewer": "Amazon Junkie",
        "Rating": "5.0 out of 5 stars",
        "Title": "Survived the washing machine",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "I left the case in pockets of my pants and had the ear buds on my dresser. Without realizing, I threw the pants into the wash and I was still able to use the earbuds! When I went to empty the laundry, I found the case at the bottom of the washer to my surprise! 😁 Needless to say, I ordered a second pair of these the same day",
        "Number": 5
    },
    {
        "id": 48,
        "Reviewer": "Amir mehrabi",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great quality for the price!",
        "Date": "Reviewed in the United States on March 13, 2024",
        "Body": "I wasn’t expecting these to be as good of quality for the price, but based on the good reviews I decided to try them, and really love them! They stay charged for a long time.  They are comfortable and have good sound.  Bought additional pairs for our kids; not going to spend a lot since they can lose them easily.  I recommend these!",
        "Number": 5
    },
    {
        "id": 49,
        "Reviewer": "Sharla Alford",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great Product and Great Customer Service",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "This is a great product with great customer service!  They reached out to me immediately after I left them a voicemail.  They texted me information so they could send me a charger because I did not think I received the charger.  It turns out it was in a small black area that I hadn't looked.  I texted them back that I had found it, and she even followed up with a call to make sure I had everything I needed and if I had any other questions.  I will definitely use them again!!",
        "Number": 5
    },
    {
        "id": 50,
        "Reviewer": "francis c. giarrusso",
        "Rating": "1.0 out of 5 stars",
        "Title": "THIS IS CHINESE CRAP THAT THEY SELL TO ALL  OUTLETS AND THEN DENY WARRANTY .",
        "Date": "Reviewed in the United States on September 19, 2023",
        "Body": "I owned a pair of these chinese junk  purchased from amazon for about 2 months.  filled out the warranty info as required,  nothing was said or stated about any third party at any time.  at first, I could not get the phone switch to work, but I thought it was just my fingers, then about 2 weeks ago they just stopped working altogether  I contacted the manufacturer and gave them my info , and was told that a new set would be provided.  Since then I have lrecieved multiple calls asking for additional info, which was given.  Today I was told from customer service in Hong Kong, that because I had purchased the set from a third party, unknown by me, the warranty would not be honored.  there was no mention of a third party when I registered the item on the warranty forms, nor was that indicated during the warranty registration. THEY SUCK, TGR-Tech SUCKS, Amazon SUCKS, and CHINA SUCKS !!!",
        "Number": 1
    },
    {
        "id": 51,
        "Reviewer": "ShannyW",
        "Rating": "1.0 out of 5 stars",
        "Title": "Junk!!!!!!!",
        "Date": "Reviewed in the United States on March 13, 2024",
        "Body": "The first one I ordered lasted about 6 months until one of the earbuds quit working. I ordered a second time & the whole charger quit working after 1 month...then thinking it was just a fluke, I ordered another one & it's also completely dead after 1 month. Too many other brands to choose from. Won't make this mistake again....",
        "Number": 1
    },
    {
        "id": 52,
        "Reviewer": "Jack",
        "Rating": "1.0 out of 5 stars",
        "Title": "Will not hold a charge, battery will not last longer than 5 minutes",
        "Date": "Reviewed in the United States on June 2, 2023",
        "Body": "Unusually, these headphones were fully charged from the minute I opened them. I used them for the first time on a 5 hour flight and they worked perfectly-- I could still hear the airplane noise a little, but it cut out the majority of outside sounds.The problems came after my trip, when I tried to put the earbuds to charge for my next flight. I put each earbud into the proper slot, and the case registered that they were charging. Great! But when I put them on the next day, I was disappointed to see that I could only use them for about 5 minutes before they disconnected themselves from my Bluetooth and died.Since that point, I have tried a million different ways to charge these stupid things. I've jiggled them to make sure that the contacts are connecting. I've tried the case both on and off the charger. I've cleaned the contacts (with a dry, clean cloth only!) on both the earbuds and the case. This product is clearly defective-- or perhaps was never intended to work for more than a single use. Save yourself the heartache and get a different brand of earbuds.",
        "Number": 1
    },
    {
        "id": 53,
        "Reviewer": "Sarah",
        "Rating": "1.0 out of 5 stars",
        "Title": "Sound quality is TERRIBLE.",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "The title about sums it up. I bought as a replacement for $15 Earcandy buds. These are twice as expensive and not even half as good sound quality.  I wasn't expecting anything amazing for the price, but should be at least as good as the bargain basement buds I was trying to replace.",
        "Number": 1
    },
    {
        "id": 54,
        "Reviewer": "Kcaraz",
        "Rating": "1.0 out of 5 stars",
        "Title": "Will not connect to any phone after 2 months",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "I bought these for someone else, they gave up on connecting them to their phone but waited until the return window had closed to let me know.  I also can not connect them to my phone, even though the case shows that they are charged.",
        "Number": 1
    },
    {
        "id": 55,
        "Reviewer": "fadedrainbow",
        "Rating": "1.0 out of 5 stars",
        "Title": "Disappointed ☹️",
        "Date": "Reviewed in the United States on June 26, 2023",
        "Body": "I bought these with high hopes as I read many positive reviews on them. However, not only are these ear buds incredibly uncomfortable to wear, they don’t stay in my ears at all. They start slipping out of my ears every thirty seconds or so and I have to keep pushing them back into my ears, which ends up either pausing or skipping whatever song/video I’m listening to/watching and it’s really annoying. (It’s some sort of setting on them I can’t figure out how to turn off.) Also, the right ear bud is already crapping out, and I JUST got these less than a week ago. They’re loud though, I’ll give them that. Besides that however, these really aren’t that great. It’s better to spend more money on better wireless earbuds. I didn’t want to have to spend more money on another pair of Air pods (after my first pair finally stopped working after about two years, that’s why I tried these instead hoping they’d be better for a cheaper price), but that’s exactly what I’m gonna have to do. Oh well. 🤷‍♀️",
        "Number": 1
    },
    {
        "id": 56,
        "Reviewer": "Perry Cheeseman",
        "Rating": "1.0 out of 5 stars",
        "Title": "Not worth it",
        "Date": "Reviewed in the United States on March 2, 2024",
        "Body": "They worked great when it did but buds kept falling out of my ears get over ear buds that go in the ear if u want to do anything but sit still, and they kept coming out when i was eating/chewing",
        "Number": 1,
        "image_urls": [
            "71qj97W8BGL._SY88.jpg"
        ]
    },
    {
        "id": 57,
        "Reviewer": "bobbie",
        "Rating": "1.0 out of 5 stars",
        "Title": "These do not work.",
        "Date": "Reviewed in the United States on January 16, 2024",
        "Body": "I have purchased these twice during approximately the last 3 years.  They always have worked just fine.  Recently  I lost the earbuds and so ordered a new set.  The fist set arrived earlier this month. Would not pair up no matter what I did.  Ordered another pair and received the next day. Right ear does not turn on at all; the left turned on but would not connect to my iPhone.  Two duds in a row. This one being returned too.",
        "Number": 1
    },
    {
        "id": 58,
        "Reviewer": "Sally Gurl",
        "Rating": "1.0 out of 5 stars",
        "Title": "Horrible and unreliable",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "These have been absolutely awful.  When I go more than 5 feet from my computer, they disconnect.  Even when I'm sitting in front of my computer they randomly disconnect or the audio cuts out.  Absolute garbage.",
        "Number": 1
    },
    {
        "id": 59,
        "Reviewer": "AJ Dines",
        "Rating": "1.0 out of 5 stars",
        "Title": "Poor quality compared to others at this price",
        "Date": "Reviewed in the United States on November 16, 2023",
        "Body": "I got these to see if the shape was better compared to in-ears without the bottom part that holds your ear. I can say these definitely stay in place well. I liked everything about them at first, but the audio quality and sound consistency (connecting to both buds at the same time) decreased so fast. Now they don’t always charge (you have to try to place the buds in the right place in the charging case multiple times to get them to charge, sometimes the right earbud is charged but the left is dead and won’t work). Overall not the worst but I have other pairs that lasted for years…I’m not overly hard on them either. Just disappointed.",
        "Number": 1
    },
    {
        "id": 60,
        "Reviewer": "max groove",
        "Rating": "3.0 out of 5 stars",
        "Title": "Meh",
        "Date": "Reviewed in the United States on March 4, 2024",
        "Body": "Acceptable given how cheap these are...Mine lasted 2 years with mild use before the case/battery stopped accepting a charge.  Had some trouble switching between blue tooth devices and had clunky controls for volume skip etc but overall acceptable. I'm looking elsewhere for my next set",
        "Number": 3
    },
    {
        "id": 61,
        "Reviewer": "Atalia Candia",
        "Rating": "3.0 out of 5 stars",
        "Title": "Just okay",
        "Date": "Reviewed in the United States on January 23, 2024",
        "Body": "I got these to replace some other buds I lost because the reviews looked promising. Well, they fall out of my ears a lot and the \"button\" on the bud to pause/play works when it wants to. I tap it several times and nothing happens, yet other times I barely brush against it and it pauses my music or video. The shape of the bud is awkward and I thought they would be a better pair since they were more expensive, but they really aren't. Not noise cancelling at all either, I can hear all the noises around me when I'm at the gym. Disappointed. The color is cute though, and they sound okay.",
        "Number": 3,
        "image_urls": [
            "71Akx5QeGUL._SY88.jpg"
        ]
    },
    {
        "id": 62,
        "Reviewer": "Michael Schaw",
        "Rating": "3.0 out of 5 stars",
        "Title": "The stop working in 3 months",
        "Date": "Reviewed in the United States on March 12, 2024",
        "Body": "Comfortable.  Good sound quality.  Good controls.  After 3 months of use one side stopped charging, but because of the things listed above, I bought them again.  Same problem.  3 months in and the same side stopped functioning",
        "Number": 3
    },
    {
        "id": 63,
        "Reviewer": "A P F",
        "Rating": "3.0 out of 5 stars",
        "Title": "Quality",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "Sometimes the quality would be great and other times it wouldn’t be great. I thought I found some good ones for a good price for my Apple iPhone after spending $200+ for air buds. But my search continues! They’re cool though",
        "Number": 3
    },
    {
        "id": 64,
        "Reviewer": "M. M. Corbin",
        "Rating": "3.0 out of 5 stars",
        "Title": "Like these but……….",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "I really like these ‘buds, but after just 7 months of use, they no longer hold a charge. I have probably charged every one to two weeks over that period, so this is pretty disappointing. Otherwise they have been very good.",
        "Number": 3
    },
    {
        "id": 65,
        "Reviewer": "Luminosity",
        "Rating": "3.0 out of 5 stars",
        "Title": "edited review",
        "Date": "Reviewed in the United States on December 4, 2023",
        "Body": "Update: The company reached out to me and really worked to make this right.  My hope is that the pair I got was simply a fluke.  I certainly appreciate any company that listens to a customer's concerns and works with them to resolve the issue.I don't like writing negative reviews but really felt I needed to warn potential buyers.  From the moment I got these ear buds, they were glitchy. Since I got them on sale, I figured it's not too bad so I'll just keep them -- especially since I only use them 3x/week for working out.  Big mistake.  The gliches only got worst.  I often struggle to get them to connect properly with Bluetooth.  Then, when it is finally connected and playing, one or both will suddenly cut out. I have to stop my working out to tap at the ear buds, take them out, and/or have to take out my phone and restart the process of trying to connect.  I've only had them 2 months but that means I'm past the 1 month return window.  I'm trashing them and having to spend more money to buy better ear buds.  Don't waste your money like I did.",
        "Number": 3
    },
    {
        "id": 66,
        "Reviewer": "Heather Parchen",
        "Rating": "3.0 out of 5 stars",
        "Title": "Verdict is still out",
        "Date": "Reviewed in the United States on February 26, 2024",
        "Body": "1. Comfy for my ears2 cute charging box3. Easy to use to hook up to my iPhone.Complaint would be that it skips a lot with the one and off while listening to my music.",
        "Number": 3
    },
    {
        "id": 67,
        "Reviewer": "David Whiteley",
        "Rating": "3.0 out of 5 stars",
        "Title": "Ok, wouldn't purchased if they had not been on sale.",
        "Date": "Reviewed in the United States on July 6, 2023",
        "Body": "I bought these primarily to wear when mowing and when sleeping.  Unfortunately they are borderline loud enough for mowing (battery powered mower) and too loud for sleeping.  I believe someone else mentioned the minimum volume being too loud as well.  The touch controls are inconsistent.  On a positive note they are very comfortable.UPDATE:  TAGRY people are reading these reviews!  I didn't ask for a refund but I received an email today from TAGRY offering a full refund.  I'm not sure I have ever received an unsolicited refund on Amazon before.  Since my initial review I have gotten a better impression of these headphones.  The issue with not being loud enough to hear over my electric lawnmower can be overcome by reseating the buds in my ears as I mow - not a big deal though it does sometimes pause the playback or lower/raise the volume.  I have a pretty bumpy yard and I think the vibration from mowing jars the buds just enough to make the sound almost unhearable.  As regards being too loud for sleep, I'm still working on that solution.  I have also come to appreciated the packaging and design of this product.  One change that would be helpful is for the lid of the holder to have a detent so that it will remain open until the user closes it.  The touch controls were too inconsistent to use anymore (except when I'm not trying to use them), so I just change the volume for the device they are paired with.  Note: I have been diabetic for over 30 years and the pin pricks to my fingers to check my blood sugar (scar tissue) may be the cause of the touch controls not working as well as they might for others.  I'd give these a solid 4 stars now.",
        "Number": 3
    },
    {
        "id": 68,
        "Reviewer": "Daniel O'",
        "Rating": "3.0 out of 5 stars",
        "Title": "very disappointed",
        "Date": "Reviewed in the United States on March 12, 2024",
        "Body": "I do not recommend these, they sound like you're listening through a barrel. I don't know how else to describe it, they are loud, have decent bass, but the overall sound is not good in my opinion.",
        "Number": 3
    },
    {
        "id": 69,
        "Reviewer": "mardone",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not easy to pause and stop/answer disconnect",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "These headphones are ok. For me it is hard to stop & start audio by using earpiece. Also, answering & disconnecting calls using earpiece was also difficult. Other than that, the sound quality is good.",
        "Number": 3
    },
    {
        "id": 70,
        "Reviewer": "Wetlawnmulch",
        "Rating": "3.0 out of 5 stars",
        "Title": "Disappointed in the battery life and no multipoint.",
        "Date": "Reviewed in the United States on March 5, 2024",
        "Body": "They are okay.  These are my first pair of wireless buds and expected the battery to last longer.  I listen to at work for pretty much 9 hours a day and they won't make it through the day without having to charge them at least once.  With degradation i expect they won't last more than a few months.  Was also disappointed to find out they don't support multipoint.  My bad as i expected in 2024 everything had this capability. Will be keeping them for maybe doing yardwork or something I don't need long battery life, but will be buying something else.",
        "Number": 3
    },
    {
        "id": 71,
        "Reviewer": "Kevin B.",
        "Rating": "3.0 out of 5 stars",
        "Title": "Decent… but not great sound",
        "Date": "Reviewed in the United States on February 19, 2024",
        "Body": "Decent earbuds, but I personally wouldn’t buy them again. The near max volume gives a bad distortion. While using them for phone calls I have had people say It is hollow… and has an echo to them. One person stated it sounded like I was in a stairwell (which I wasn’t).They DO have a good battery life, and if you’re looking for something cheap that will get you by…. Go for it.",
        "Number": 3
    },
    {
        "id": 72,
        "Reviewer": "Glfredrick",
        "Rating": "3.0 out of 5 stars",
        "Title": "Once charge gets below 86% the ear buds stop working well.",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "The ear buds are attractive, work well, have good enough sound quality on either end of the conversation, but have one fatal flaw, once the battery life gets to or below 86 percent they no longer connect well and sound on either end of the conversation, as if the user is at the end of a long tunnel. This is a bit disappointing and requires frequent re-charging to be able to hold phone conversations.",
        "Number": 3
    },
    {
        "id": 73,
        "Reviewer": "Katy Titus",
        "Rating": "3.0 out of 5 stars",
        "Title": "Good for a while, but gave me headaches",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "I bought these over a year ago. They are decent basic earbuds. I'd never had wireless earbuds before and wanted to try them out. However, I have found that they've started to emit a soft, but high-pitched, electronic buzzing noise when I use them. They were also putting pressure on my inner ears, giving me headaches. I am now shopping for better quality earbuds.",
        "Number": 3
    },
    {
        "id": 74,
        "Reviewer": "Kira Barclay",
        "Rating": "3.0 out of 5 stars",
        "Title": "Mostly good.",
        "Date": "Reviewed in the United States on March 3, 2024",
        "Body": "I loved these headphones, they worked really well. Sound quality and noise canceling were great. But they didn't stay in my ears for long. They kept falling out. I was hoping to use them at the gym but I don't think I'll be able to since they won't stay in when I'm just sitting down. They could work for you though!",
        "Number": 3
    },
    {
        "id": 75,
        "Reviewer": "EUCLIDES ALVARADO",
        "Rating": "3.0 out of 5 stars",
        "Title": "Some problems, but Tagry Costumer Service take care... waiting for replacement",
        "Date": "Reviewed in the United States on September 12, 2023",
        "Body": "September 13:I bought these headphones as a gift for my wife. Additionally, I bought some accessories, ear supports to avoid losses due to falls and a case that matches well with the color of the headphones. I put together a complete gift. I thought I had made a good purchase. My great disappointment and annoyance has been seeing how the headphone controls go crazy and the volume goes up and down at will. The touch controls to control the headphones do not work well. It's lucky if they activate the desired function. Don't even think it will control the volume. These headphones do what they want. The battery on the left hearing aid lasts less than half that of the right hearing aid. The headphones turn off when they still have 50 to 60% charge and do not work again until they are over 70-80% charge, and then repeat the same strange phenomenon. Avoid losing your money and investment. Or worse yet, give a gift that won't work. I will return these headphones.Update: September 15, 2023I contacted: Amazon Customer Service, who contacted the manufacturer. The attention was precise and brief. They identified the situation and Tagry almost immediately sent a replacement unit. Thank you so much.This is the type of support and attention that is expected. I congratulate the manufacturer for the excellent willingness to focus on the guarantee of its products. I'm waiting for the new headphones to try them out and see if they work correctly. At the moment a 10/10 to TAGRY and Amazon for the support provided.As soon as I try the new headphones I will gladly update and rerate this review. And I emphasize that no one has asked me to change anything, but if TAGRY deserves 5 stars, I will gladly give it to them.",
        "Number": 3,
        "image_urls": [
            "71rbwQNPE5L._SY88.jpg"
        ]
    },
    {
        "id": 76,
        "Reviewer": "Nismo63",
        "Rating": "3.0 out of 5 stars",
        "Title": "Great Value for the Price but not for me",
        "Date": "Reviewed in the United States on September 8, 2023",
        "Body": "I recently purchased the TAGRY Bluetooth Headphones, and I'm impressed with their performance. These headphones offer excellent sound quality for their price point. The bass is punchy, and the highs and mids are clear, making my music and podcasts sound fantastic.The Bluetooth connectivity is reliable, and the range is impressive. I can leave my phone in one room and still enjoy uninterrupted music in another. Pairing with my devices was a breeze, and the connection remains stable.Comfort-wise, these headphones are comfortable to wear for extended periods. The cushioning on the ear cups is soft, and they fit snugly without causing discomfort. I appreciate the adjustable headband, which allows for a customized fit.Battery life is solid. I can go a few days without needing to recharge, which is convenient. The built-in microphone works well for calls, and I appreciate the hands-free functionality.One minor drawback is the plastic construction, which feels a bit flimsy. However, considering the affordability, it's a minor trade-off.Overall, the TAGRY Bluetooth Headphones provide great value for their price. They deliver impressive sound quality, comfort, and connectivity, making them a solid choice for budget-conscious users.Pros:Impressive sound qualityReliable Bluetooth connectivityComfortable for extended useLong battery lifeAffordable priceCons:Plastic construction feels somewhat flimsyI would recommend these headphones to anyone looking for an affordable wireless headphone option without compromising on sound quality",
        "Number": 3
    },
    {
        "id": 77,
        "Reviewer": "Andrea Marsh",
        "Rating": "3.0 out of 5 stars",
        "Title": "It’s ok",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "The sound is good, clear and loud at maximum volume. However, the battery dies too easily in my opinion. I’m not sure it mine has a defect but literally with every 30 seconds that pass when the ear phones are in the case the battery life goes down by one.",
        "Number": 3
    },
    {
        "id": 78,
        "Reviewer": "wow its cc",
        "Rating": "3.0 out of 5 stars",
        "Title": "Alright",
        "Date": "Reviewed in the United States on January 19, 2024",
        "Body": "These headphones are good for calls. I love music and am picky about the sound of headphones. The quality of these could be better for music, and I can find headphones around this price with better sound quality. Additionally, no matter which size buds I put on, they do not stay in my ears. The touch feature on the pods is annoying as any slight touch will pause the music. This can be frustrating as I have to adjust the earbuds often to stay on my ears, touching the reactive part. All in all, these are mediocre earbuds. They're okay. I can do with them if I'm in a pinch, but you can find better at TJ Maxx for less, I promise.",
        "Number": 3
    },
    {
        "id": 79,
        "Reviewer": "Hi",
        "Rating": "3.0 out of 5 stars",
        "Title": "Mixed feelings",
        "Date": "Reviewed in the United States on February 10, 2024",
        "Body": "The sound is fine, BUTThere can be loud beeps when you first turn them on.  Highly annoying and probably dangerous.The controls are complicated.  Some are on the left ear, some are on the right.  Some things you tap once, other twice, others three time.  No real buttons do you don’t know if your taps are “registering.”The numbers on the meter which you see in the pictures are useless.  I think they you the strength of the battery pack, but you have no idea of the battery life of the earpieces.  So with a few minutes to go you get notified that the battery is low and then it’s silence.",
        "Number": 3
    },
    {
        "id": 80,
        "Reviewer": "All the toys",
        "Rating": "1.0 out of 5 stars",
        "Title": "Doesn't pair consistently",
        "Date": "Reviewed in the United States on December 1, 2023",
        "Body": "It's very hard to get these paired with any of my bluetooth devices.  Even if they pair once, despite the claim that repairing is automatic, they don't usually pair.  The materials say that when the lid is opened, they first pair with each other then pair with your device.  If I immediately take out one of the earbuds when I open the lid, the pairing lights blink for 1 or 2 seconds then go out and I haven't found a way to get the lights back on with the earbud out of the case.  I've tried every solution in the materials and nothing works so far.  If after opening I leave the lid open with the earbuds in their slots and next to my device sometimes after at least 10 seconds the earbuds will show up and I can pair.  I give up.",
        "Number": 1
    },
    {
        "id": 81,
        "Reviewer": "Lori lee",
        "Rating": "1.0 out of 5 stars",
        "Title": "DO NOT BUY: “Button” is impossible to work",
        "Date": "Reviewed in the United States on January 24, 2024",
        "Body": "The Good news: they come charged and u take them out of the container & they paired with my phone.The Bad news: they wouldn’t pair with my tv: proby  bc I couldn’t manually get them into pairing mode. Each earbud has only one control “button” but it’s indented! So I tried pushing it with my fingernail & it’s nearly impossible to work. I gave up. You have to download a manual bc it comes with minimal directions. I can’t believe anyone can work these and I think the positive reviews must be fake! Don’t waste your energy and money!",
        "Number": 1
    },
    {
        "id": 82,
        "Reviewer": "Tony D",
        "Rating": "1.0 out of 5 stars",
        "Title": "Sadly, crapped out after 4 months of use",
        "Date": "Reviewed in the United States on October 21, 2023",
        "Body": "I purchased these earbuds to listen to my podcast while working around the house. They were not purchased with the idea I was getting high end noise canceling earbuds. Initially, they worked great and served it purpose, I was very satisfied with the quality and on a cost benefit basis had absolutely no compliant. I even recommended this product to friends & family.  Sadly, the product did not last. About 4 - 5 months in, the earbuds were not holding a charge despite the case showing 100% charge. If I do get them to work, it's usually short lived, meaning minutes. Now, I do understand you get what you pay, I did not expect them to compete with my higher end earbuds but since I was pleasantly surprised initially not only with the voice sounds but even with music, it was very disappointing to have them crap out on me in such a short amount of time. I do have to check if they come with any warranty.",
        "Number": 1
    },
    {
        "id": 83,
        "Reviewer": "Nate & K",
        "Rating": "1.0 out of 5 stars",
        "Title": "READ UPDATE BEFORE PURCHASE",
        "Date": "Reviewed in the United States on May 10, 2023",
        "Body": "I am amazed at these. First of all, for those looking for iPod pro dupe… here it is. Very similar in appearance. Secondly, the price was fantastic. I got these for twenty bucks. They are great for everyday use. They stay in ear nicely and have decent sound considering these are nose Bose quality buds. I listen to music all the time and am very pleased. The noise cancellation is definitely not comparable to actual AirPod pros not even close but $20 vs. $200+ makes these a keeper. I love these. The battery life is great. The range is good but since I keep my case in pocket/bag on me at all times this isn’t an issue. I use one in ear to exchange when needed and blithe buds and the battery case hold a good charge. Definitely provides all day constant use if not using as a pair. The are also water resistant to some degree. I dropped them in the tub for 3-5 seconds and haven’t had any issues. For twenty bucks you can’t go wrong.UPDATE:  The charging case quit lighting up 63 days after purchase. Really stinks it’s outside return window. I did drop one bud in The tub and it continued to work but the charging case went out for no apparent reason as it hasn’t been near the tub lol. So I no longer recommend this product.  What a shame",
        "Number": 1
    },
    {
        "id": 84,
        "Reviewer": "Anya",
        "Rating": "1.0 out of 5 stars",
        "Title": "Want to like these but..uugghh",
        "Date": "Reviewed in the United States on June 17, 2023",
        "Body": "The media could not be loaded.\n                \n\n\n\nI like the sound that I receive from these but there are a few problems. Based on the video (both sets are in their cases), for some reason one charges but not the other one in the set. And its not a case issue because I've switched earbuds to that case and then that earpiece will charge. I have to keep taking it out and putting it back in for it to work. I have 2 and they often randomly just switch to the other set even though it will be in its case.  So I'm always scrambling during calls or media play to disconnect the one that's connecting even though I'm not using it. They're constantly falling out of my ears have no noise canceling feature because people complain about the background sounds. It will randomly just turn all the way up and say \"maximum volume\" and wont allow me to adjust it. I have to put them in the case then take them out again for this to stop. And finally, the slighest brush against it will stop the playback at times but then other times when I'm trying to stop/pause - it either won't or it'll advance to the next song. So I guess you get what you pay for. Back to Apple airpods. Sigh.",
        "Number": 1
    },
    {
        "id": 85,
        "Reviewer": "Don’t trust the positive reviews",
        "Rating": "1.0 out of 5 stars",
        "Title": "Don’t trust the positive reviews at all",
        "Date": "Reviewed in the United States on December 30, 2023",
        "Body": "Everyone says how comfortable they are, how amazing the sound is, and how amazing they are for the price. I believed the positive reviews and I wish I didn’t. In my eyes I was scammed. First of all the sound isn’t “good for the price” it’s a little less than what you should expect. It’s not bad but for how much they cost it should be better. But my biggest issue is that the left and right earbud don’t stop making static and clicking noises. It’s hard to drown them out even with music playing. I’m not the only one with this issue either. For some reason this company loves to send customers what I would consider faulty earbuds",
        "Number": 1
    },
    {
        "id": 86,
        "Reviewer": "Alex. B.",
        "Rating": "1.0 out of 5 stars",
        "Title": "Mediocrity",
        "Date": "Reviewed in the United States on March 5, 2024",
        "Body": "Pros: it produces soundCons: 1. even on minimal volume these are too loud2. Sound stage is practically non-existent3. I should've caught it sooner, but touch control scheme is idiotic - it uses \"undefined\" longevity presses that  often interfere with each others (volume up/down and turn off for example)4. There is practically no trebles and the bass is muddy at best.",
        "Number": 1
    },
    {
        "id": 87,
        "Reviewer": "David",
        "Rating": "1.0 out of 5 stars",
        "Title": "Nope",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "Listened to it maybe 10 mins and threw them back in the box. Most people say sound is OK or mediocre at best. Literally at $12 pair of skullcandy headphones from Ross sounds way clearer than these. Not impressed with sound quality or the echoing while listening to music. ...  not clear, volume is great but just isn't for me.",
        "Number": 1
    },
    {
        "id": 88,
        "Reviewer": "Joan Taylor",
        "Rating": "1.0 out of 5 stars",
        "Title": "Don’t waste your time",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "These worked for me twice and now the refused to connect to any of my devices no matter what method I use. I will be contacting Amazon and expect a full refund.Also, no matter which size ear grip is used, they do not stay in my ears. Apple is far superior. Pay extra for Apple to get a better product.",
        "Number": 1
    },
    {
        "id": 89,
        "Reviewer": "Georgia Fisanick",
        "Rating": "1.0 out of 5 stars",
        "Title": "Multiple Issues - Sensitive Ears Beware",
        "Date": "Reviewed in the United States on July 9, 2023",
        "Body": "I normally don’t write reviews, but given the overwhelming positive ratings, I’m surprised and disappointed by this product. Plus I wanted to warn others with medical conditions like migraines or sensitive ears that these may exacerbate.First off, these ear buds are pulsatingly LOUD, particularly for bass even on my iPhone’s reduce bass setting or lowering the volume. It’s so bad it makes the inside of my ears tingle and sets my teeth on edge— maybe I’m hypersensitive as a migraine sufferer but using them for more than a few seconds is a physically uncomfortable to nauseating experience. Anyone with inner ear sensitivities may want to reconsider purchasing. I’ve tried all EQ combos including turning off EQ and toggling the balance between the headphones and nothing works.Secondly, they are uncomfortable. I have small ears and while they come with multiple ear pieces I seem to have gotten two mediums and one large set.Thirdly, I cannot get them to connect with calls— only music. I’ve tried the troubleshooting directions in the user manual but no luck.Will be returning if possible.",
        "Number": 1
    },
    {
        "id": 90,
        "Reviewer": "L.M.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Company who stands behind their product.",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "The product is exceptional for the value.  I've had the earbuds for quite some time and the left earbud suddenly stopped working.  I contacted Tagry, the seller, they honored my warranty and replaced it with a new set without any problem.  They called me and we did attempt to troubleshoot the problem but without hesitation, they sent me a new set.  They followed up to ensure I received them and that they were in good working condition.  Great company who stands behind their product.",
        "Number": 5,
        "image_urls": [
            "6116CgYBwCL._SY88.jpg"
        ]
    },
    {
        "id": 91,
        "Reviewer": ":/",
        "Rating": "5.0 out of 5 stars",
        "Title": "Modern and easy to use",
        "Date": "Reviewed in the United States on March 15, 2024",
        "Body": "There is almost nothing wrong with this. I bought this and was a little skeptical because of how cheap it was. It was the exact product in the photos and I’ve never felt so good spending my money. The earbuds are very lightweight and they fit perfectly into my ear. The battery life can sometimes last me 5 days. Worth buying! :D",
        "Number": 5
    },
    {
        "id": 92,
        "Reviewer": "NC David",
        "Rating": "5.0 out of 5 stars",
        "Title": "100% as advertised",
        "Date": "Reviewed in the United States on March 5, 2024",
        "Body": "This ear bud is used so I can listen to football, news, or whatever while my wife entertains herself in the same room. I use only one because I’m deaf in one ear. By the way, they won’t work as a hearing aid. This is a wonderful cost/benefit value for private listening. I even activated and paired the buds on the first attempt. You would be more impressed by that last statement if you knew what a techno klutz I am.",
        "Number": 5
    },
    {
        "id": 93,
        "Reviewer": "SBD",
        "Rating": "5.0 out of 5 stars",
        "Title": "great deal at a great price!!",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "I am not picky, nor do I need the big name brands. So this product was something I took a shot at. And....I was glad I did. They fit my ears great and are easy to use. The sound is very good and they keep a nice charge (the longest I have used them is 4 hours at once).",
        "Number": 5
    },
    {
        "id": 94,
        "Reviewer": "Carissa",
        "Rating": "5.0 out of 5 stars",
        "Title": "Sound and fit a great quality for the price.",
        "Date": "Reviewed in the United States on January 30, 2024",
        "Body": "I’m not an expert on ear pods or anything speaker related but I like music and prefer it to be clear but I’m not one to spend over $100 on ear pods despite me having a particular brand watch and phone so I decided to take a chance on something cute and a decent price and I’m not disappointed at all. I only received them yesterday and I just sat in bed for about half an hour and played around with them, I thought the sound was great and they seemed to fit without sliding out and they were pretty comfortable for someone who doesn’t really like things in my ears or around my face. Hopefully they last but according to reviews the customer service is excellent should there be any issues so I’d say even if you owned a more expensive pair these are a great extra pair for going somewhere you may be more likely to lose them it was less then $30 ..",
        "Number": 5
    },
    {
        "id": 95,
        "Reviewer": "Krista Rheinhart",
        "Rating": "5.0 out of 5 stars",
        "Title": "Really like these headphones",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "I use one pod at a time and the battery last so long I work overnight and I can get one to last the whole night and then switch them the next night. And I can go 2/3 days in between charging the actual case!!!",
        "Number": 5
    },
    {
        "id": 96,
        "Reviewer": "Amazon Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Charge Lasts for a Long Time",
        "Date": "Reviewed in the United States on March 4, 2024",
        "Body": "My wife lost her Apple Air Pods, and I ordered these for her. The color selection was good, and she likes the lavender case. The Apple Pods fit poorly in her ears, and these actually fit better. The sound quality is good. And the best thing about these is the extended battery life. The price was a fraction of the cost of Apple Air Pods. Pairing the pods with her iPhone was easy.",
        "Number": 5
    },
    {
        "id": 97,
        "Reviewer": "Sarah Short",
        "Rating": "5.0 out of 5 stars",
        "Title": "Apple who?",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "These are great, amazing noise cancelling ability. I got these because I’m afraid to spend the money on Apple AirPods since I lose things easily. But I’ve had these for a long time and they hold charge extremely well, good with music and calls.",
        "Number": 5
    },
    {
        "id": 98,
        "Reviewer": "Amber W.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great!",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "Best I've tried next to airpods ofcourse. But if you dint want to spend the money or you lost your airpods go with these!! They're very comfortable in the ear unlike most earbuds and the sound is above average!! Great buy for the $!",
        "Number": 5
    },
    {
        "id": 99,
        "Reviewer": "Fabian Velez",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great headphones",
        "Date": "Reviewed in the United States on March 13, 2024",
        "Body": "These replaced my stepson’s old headphone and He was very happy with them. They automatically connect to his phone as soon as he took them out of the case. The quality of sound on videos is good. Battery life is good as well.",
        "Number": 5
    },
    {
        "id": 100,
        "Reviewer": "Koko",
        "Rating": "1.0 out of 5 stars",
        "Title": "NOT for sensitive ears!!!",
        "Date": "Reviewed in the United States on July 18, 2023",
        "Body": "I bought these to replace my Galaxy Buds pro because over time I had an allergic reaction to the nickel used in their product. I was so badly hoping I wouldn't have that issue with these. I was so wrong. I chose these due to the digital battery indicator and color and the reviews seemed good. I couldn't for the life of me find a list of what materials were used but I got them anyway. When I first got them, they had a strong chemical smell of burning plastic, which worried me but I have been dying for a pair of headphones, especially for the gym and ones that won't break the bank if I don't like them. Putting them in, they're snug, and the sound is good for what you pay for, but vocals sound kind of muffled. I used them after testing on a call with my boyfriend, sounds is pretty good, he even said my voice was pretty clear. But after maybe a couple of hours with the headphones in, I could feel my ears starting to get irritated like they would with the allergic reaction I was having with the Galaxy earbuds. After I ended the call, my ears felt worse so I took them out and all night they were itching, burning, bleeding, and leaking fluid, some yellow, clear, or green. I had to stuff my ears with tissues to get it to calm down. It's now been a week and I've only worn them the day I got them and am trying to let my ears heal. I don't think it's a good idea to try again even if I switch out the ear tips. I'm really sad they broke me out so bad but if you don't have an allergy to any type of material, you might like them.",
        "Number": 1
    },
    {
        "id": 101,
        "Reviewer": "ashlee",
        "Rating": "1.0 out of 5 stars",
        "Title": "Not great",
        "Date": "Reviewed in the United States on October 5, 2022",
        "Body": "I ordered these ear buds because the reviews were all pretty good, but these headphones suck. Idk what everyone was talking about when they “loved” these. They’re not noise cancelling AT ALL. I can literally hear everything with the headphones in,  and on full blast volume. The amount of audio you can hear coming from the headphones when you don’t have them in is like jarring. It’s ridiculous. My ears are really small so I have a hard time finding ear buds that’ll fit my ears, and so I usually buy earbuds with the rubber tips because those always fit my ears so well, I bought these earbuds specifically because of the rubber tips and these will not fit in my ears at all, way too big. And they don’t even provide a smaller fitting ear bud to switch to, all just just bigger size options . And, this last one could just be me, I’ve never had “touch compatible” ear buds but they’re very annoying. The slightest handing of the headphone causes the song to pause on and off, and the audio is always blasting because I can’t hear anything on such a low volume on these things. I bought these in the hopes they’d be a cheaper alternative to skull candies…never again. I’ll just stick to what I know works for me. So annoyed. So do not but these if:-you enjoy noise canceling headphones/ear buds-you have trouble getting air pods to stay in your ear..there’s no way you’ll get these to stay in there .-you like privacy when you’re listening to whatever you’re listening to. Because these headphones/ear buds, you can literally hear everything coming from them when you don’t have them on.Gonna try to see if my fiancé will want to use these cause he doesn’t really care as much as I do, but I will for sure not be using these at all. Just gonna buy some skull candies. What a waste. This is why I hate taking a risk and buying things like this on Amazon, it’s always a miss for me.",
        "Number": 1
    },
    {
        "id": 102,
        "Reviewer": "Springerpitt",
        "Rating": "1.0 out of 5 stars",
        "Title": "Annoying to Use UPDATE: broke after 32 days",
        "Date": "Reviewed in the United States on April 5, 2023",
        "Body": "I love the look of these earbuds but practically they're really annoying to use. A couple of issues:1- The functionality for skipping, replaying, and turning volume up and down isn't found in a single earbud. When I'm working out or biking I like to only have one earbud in so I can still hear what's going on around me. The right one skips songs and turns volume up, the left one replays and turns volume down, which means unless you're wearing both you don't get the full functionality. My previous wireless earbuds didn't require you to wear both to have full functionality.2- They don't fit well, they're constantly sliding out of my ear, which wouldn't be a big problem except for the next issue.3- They have weird sensitivity to touch. Every time I adjust them in my ear it ends up pausing, no matter how careful I am to only try to grab the stem. On the flip side, when I try to skip songs by tapping the right ear it usually ends up pausing the song. I tested this morning and it takes me, on average, 3 attempts to skip a song.From the pro side, the sound is good, the battery life is great so far, and I love that the case tells you your remaining battery power so I'm not charging the case unnecessarily.UPDATE: on day 32 (convenient 30-day return policy) these broke. They won't hold a charge and just drain the case down to zero. They also make a bizarre buzzing noise and even though my phone says they're connected I can't get any sound and my apps all show a playback error and refuse to play while they're connected.",
        "Number": 1
    },
    {
        "id": 103,
        "Reviewer": "Tcamer",
        "Rating": "1.0 out of 5 stars",
        "Title": "Dealbreaker",
        "Date": "Reviewed in the United States on June 6, 2022",
        "Body": "***UPDATE BELOW*** I am super bummed. The reviews for this product were great and I really wanted to give this product a good rating but I ran into issues that made doing so impossible. Usually, the rubber earbuds come in small, medium, and large size options. Mine only had two pairs of the same size and one larger. Both options are way too large for my ears so the pieces do not rest comfortably or securely. I have never run into a problem like this with similar products and usually use the medium size.The biggest problem, and the DEALBREAKER, is that when I  went to recharge the earphones and the case for the second time... it did not work. I made sure that I used the cord it came with. I made sure the issue was not with the cord itself and that the cord was capable of powering my other electronics. The cord itself worked fine. I'm very disappointed. I will be returning the product shortly. I will get a new set and see if I run into the same problem again. I will update this post afterward.THE PROS: I was very impressed by the sound and the touch-sensitive \"buttons\" that worked very well. If the product was capable of recharging, as it should be, I would have kept it despite not being the most comfortable or secure (due to just how well the sound and buttons/sensors worked).  I have used these many times throughout the past week since I received them. I have had no interference issues and have found that I am able to walk more than 30 feet with no issues of cutting out.UPDATE: I received my replacement order. The earphones work great (as did the previous pair). However, this one is able to hold a charge. Unfortunately, the case will only charge up to 24 percent. I bought one for my son and his has always worked wonderfully. He has never had a problem with charging.",
        "Number": 1
    },
    {
        "id": 104,
        "Reviewer": "Ben Martin",
        "Rating": "1.0 out of 5 stars",
        "Title": "DO NOT BUY THESE BUDS! Awful everything",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "Just spend $20-30 more and get name brand buds. You won’t be excited to use these. They’re insulting. the touch controls on the earbuds work about 1/2 the time - they mostly activate when you're trying to get them in and out of your ears. For some reason the battery % has been quickly plummeting since i opened these? its been about and hour since i opened them, i listened to music for 10 minutes max, and the battery is at 83% ? The sound quality isn't TERRIBLE, but its definitely not \"good.\" about what you'd expect for this price range. these are cheap trash - returning immediately. Got some JBLs for $50 and I’m VERY pleased with them.",
        "Number": 1
    },
    {
        "id": 105,
        "Reviewer": "Alec",
        "Rating": "1.0 out of 5 stars",
        "Title": "Not for Exercising.",
        "Date": "Reviewed in the United States on November 15, 2023",
        "Body": "Got these about 3 weeks ago. In that time, I have come to regret buying these earbuds.Pros:1) Battery Life - No problem. Can last several days.2) Waterproof - No problem. Have sweated and worked out with these, no noticeable damage.3) Connectivity - No problem. Can connect to phone relatively easily.Cons:1) Sound Quality - Annoying but can be adjusted to. Sounds weird and slightly muffled. If you want these, don't be buying them for the sound quality.2) Touch Control - Horrible. It is extremely inconsistent. Sometimes it will be super sensitive to the point where you can brush your finger across the pad (the most easily touched part) while readjusting the earbud and it pauses whatever is being played. Other times you can press on the earbud multiple times at various strengths and directions and it does not recognize the touch. I like to use earbuds to listen to music when working out. I have to regularly readjust these when they get dislodged by sweat, making it easy for me to accidentally touch the earbud control area and stop my music... While others may prefer such touch control, sadly this is not for me.",
        "Number": 1
    },
    {
        "id": 106,
        "Reviewer": "Zolo",
        "Rating": "1.0 out of 5 stars",
        "Title": "Wanted to like these. But still ended up faulting in 1 day and failing in 5.",
        "Date": "Reviewed in the United States on July 27, 2023",
        "Body": "The earbuds themselves are pretty decent for the price. Mediocre battery life (~3hrs), decent sound quality -- but thats where it stops.These being wireless we can all obviously expect we need to charge them. Thats where we're going to have a bad time.The case itself is nice. Gives you a decent percentage counter on the cases remaining battery, indicators that the earbuds are charging ... well sort of. They'll slowly animate a charging battery, but at this rate I think they're just indicating that they're ticking down to a potential lithium fire.Want to charge both? Fine, just open and close the lid a couple times every 30mins.Want to charge both AND the case? Nope. It'll just charge the earbud that is at 100%. Forget the one that is out of a charge because it decided not to charge that anyways. It'll charge the case though.When you're done dealing with the crappy touch controls and quirky charging case and attempt to goto the manual and attempt to troubleshoot it - you're just faced with generic information. FAQ? F🤡🤡🤡 Answering Questions is what that part stands for. Oh well, the paper instructions are bad. What about their support site? Two different numbers, two different email addresses. Who made this site and how many bottles of isopropyl did they consume to make it? What a mess! Just like the product.I sure hope no one brings these onto a plane.",
        "Number": 1
    },
    {
        "id": 107,
        "Reviewer": "Vegas1970",
        "Rating": "1.0 out of 5 stars",
        "Title": "Stopped working in less than 2 months.",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "I bought these earbuds and thought they were great. The sound was great, the connections were flawless, and I don't even know if they were noise cancelling but they sure seemed to work as well as my Bose over the ear headphones. But, suddenly they just disappeared out of my list of available devices on my iPhone, iPad, Dell computer, and HP computer and are unable to be discovered or reconnected. I tried calling the help line but of course it just wanted me to leave a message.... with my email? How they would be able to help me via email is unknown. I guess I'm lucky they were cheap.",
        "Number": 1
    },
    {
        "id": 108,
        "Reviewer": "Lourdes West",
        "Rating": "1.0 out of 5 stars",
        "Title": "\"Undocumented\" issue.",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "The media could not be loaded.\n                \n\n\n\nBought these earbuds back in early July 2023 knowing its possible limitations based purely on the price. Up until a month ago I was perfectly happy with them; one good day I unplugged it after charging (always to 100%) and the screen just started flashing 0, then stopped after a few seconds. I could use the earbuds up until last week, when they would no longer charge (the case was totally out of charge). when I plug it or open the case, all I get is a flashing 0, and it does not charge. I have tried researching online, but I can't find anything on this issue.",
        "Number": 1
    },
    {
        "id": 109,
        "Reviewer": "Dad of Twin Sons",
        "Rating": "1.0 out of 5 stars",
        "Title": "Nope. Get the X18 pair instead.",
        "Date": "Reviewed in the United States on December 2, 2023",
        "Body": "I decided sometime ago that my teenage sons are just going to lose earbuds, a lot, so rather than buy expensive pairs like I did with the Beats, I am going to buy several inexpensive pairs. Not by design, but by necessity, I know a bit about that which I speak. I will not, however, buy these again. Please see below.First the good: they look exactly like they are pictured. They display the charging percentage the on front.But many of these headphones do that, and these are not the best selection.So what do you want? Well, they should fit well, and they should sound good: these do neither.The same manufacturer makes the X18 earbuds, and I have ordered two pair of them because they look good and they sound good and they fit well unlike these. They also display the charging percentage on the front.",
        "Number": 1
    },
    {
        "id": 110,
        "Reviewer": "Blake Abercrombie",
        "Rating": "3.0 out of 5 stars",
        "Title": "Great Headphones, but Very Loud",
        "Date": "Reviewed in the United States on January 27, 2024",
        "Body": "Overall, these earbuds are pretty nice! They were easy to pair to my phone and stay paired, but one unfortunate downside is that they don't automatically disconnect when you put the earbuds in the case, so in order to play anything out of the phone's speaker, you have to turn your bluetooth off or unpair from the earbuds.My biggest complaint is that even on the lowest setting, they are quite loud. On iPhone, you can manually move the volume bar to between mute and the first \"notch\" of volume (one click up on the volume) in order to get the quietest sound possible, but these headphones don't accommodate that, and just mute when you try to move the volume any lower than the first notch. That being said, the sound didn't bleed, and the quality seemed decent.I didn't find them the most comfortable, but I am also super picky about that, so they should be relatively fine to wear for an hour or two for most people. They have a very long battery life, and the case hasn't dropped below 95% charge in 3 days of use.Lastly, the \"one touch to pause/play\" feature is super finnicky. Whenever I'm adjusting the earbuds in my ear, I always accidentally seem to pause, and when I'm *trying* to pause, it never seems to work! Very frustrating.Overall, besides little issues and the volume, these are nice earbuds, and are exceptionally nice for the price! Would recommend, even though I am going to go for a different option (I'm very sensitive to sound).",
        "Number": 3
    },
    {
        "id": 111,
        "Reviewer": "Alaric Holmes",
        "Rating": "3.0 out of 5 stars",
        "Title": "Kinda disappointing",
        "Date": "Reviewed in the United States on March 17, 2024",
        "Body": "These buds aren't bad, per se, but there's one thing that I expected them to be able to do and yet it seems that they don't: allow me to use one ear bud without draining the power of the other bud.  I usually like to use a single earbud, mostly so that I can hear whatever else is going on around me and so that I can essentially double the battery life of the buds by using one and then switching to the other when that first one starts to run out of power.  I thought these ones allowed that, and I could swear that I was able to do that once or twice, but most of the time, it seems that when I open the charger and pull one bud out, the other one remains on, draining its battery.  So, while these aren't bad, and they sound pretty decent, I am rather disappointed that they bud that remains in the charger doesn't turn off.  Not sure why that would be a special feature.  Seems like something most buds should do, but maybe I'm wrong.",
        "Number": 3
    },
    {
        "id": 112,
        "Reviewer": "Joelle Elaine",
        "Rating": "3.0 out of 5 stars",
        "Title": "Purchased, Delivered & Returned all Within 2 Weeks (NOT GREAT)",
        "Date": "Reviewed in the United States on July 22, 2023",
        "Body": "I had high hopes for these earbuds. I read the reviews (always the Most Recent first) and I found many more positive/high-rating reviews than negative/low-rating reviews. After comparing it with other similar products, I decided on the TAGRY X08 Bluetooth Headphones Ture Wireless Earbuds 60H Playback LED Power Display Earphones with Wireless Charging Case IPX5 Waterproof in-Ear Earbuds with Mic for TV Smart Phone Computer Laptop Sports (wow-quite a mouthful for a name). I was excited and hopeful when I hit the \"Place Your Order\" Button. After a quick delivery (PRO), I was soon disappointed with the product.My first major complaint was comfort. I may have smaller than normal ear canals because even with the use of the smallest size ear tips included in the package, I found it difficult to have the earbuds in for long without my ears becoming uncomfortable. When I would wear them, the earbuds would only be in my ears for 30 minutes before I was constantly needing to readjust them to find an angle that was comfortable. The \"Products Description\" and \"Features & Details\" state that the earbuds can be worn comfortably while driving, relaxing, working, or even sleeping. I would NEVER wear these earbuds during ANY of those chill activities. The TAGRY X08 hurt too badly for me to get comfortable enough to relax or do any of those things.The MAIN reason I chose to purchase these earbuds over any others was the COMFORT rating given by Amazon Reviewers. The TAGRY X08 was given an average rating of 4.9🌟 out of 5 for COMFORT. I'm baffled that these earbuds would receive such a favorable rating in this category and would personally score it a 2.5🌟My other major complaint was the \"Smart Touch Control\". I have relatively small fingers, which usually allows me to be able to manipulate and access small areas on phones, earbuds, headphones, or other similar products. I had no such luck with the TAGRY X08. When listening to music or a podcast, it was difficult for me to get the timing down for the earbuds to distinguish the difference between \"PLAY/PAUSE\" (one tap) and \"NEXT/PREVIOUS TRACK\" (two taps). Even when I would remove an earbud from my ear, it was still difficult for me to use so I would end up using my phone to skip or pause the song or show.There were a few positive aspects to the TAGRY X08. The earbuds would charge up to 100% pretty quickly after being placed in the case to charge. However, I did notice that the earbuds would run out of juice WAY FASTER than others I've had in the past. As long as I remembered to keep the charging case with me at all times, I would be able to charge the earbuds after the 4/4.5 hours of use. But if I were to leave the house without the charging case (which, unfortunately, did happen a few times) and be gone for 7-9 hours, I would find myself without the use of the earbuds for 5+ hours.The \"One-Step Auto Pairing\" was SUPER convenient and made me very happy each time I would open the case to have the earbuds always connect to my phone. I also enjoyed the light weight of the case and found it easy to hold in my pocket without much thought to it otherwise.Overall, the negatives outweighed the positives for me which is why I returned the TAGRY X08 Earbuds. Thankfully, I selected to have the charge added to my Amazon balance so it was a quick process (PRO).",
        "Number": 3
    },
    {
        "id": 113,
        "Reviewer": "Amazon Customer",
        "Rating": "3.0 out of 5 stars",
        "Title": "Automatically Plays",
        "Date": "Reviewed in the United States on February 11, 2024",
        "Body": "The sounds quality is fine, they look nice, I really like the display on the front with the battery life.But, they automatically play whatever you were last listening to/watching when you put them in. The tap play/pause function is incredibly sensitive and can be touched by mistake very frequently.So when you take the earbud out of the case, if you aren't extremely careful with how you handle them, they'll automatically start playing whatever you were last listening to. which doesn't seem all that bad, unless your volume was on high the last time you played something and it begins blasting in your ear.The tap function is so sensitive that I have hung up on calls while putting the second one in, for example.Every time I even touch one earbud, for any reason, I have to pause something on my phone.I just wish I could turn the tap feature off, and then they'd be perfect, but I've dug through all possible settings and it doesn't seem possible.",
        "Number": 3
    },
    {
        "id": 114,
        "Reviewer": "Amazon Customer",
        "Rating": "3.0 out of 5 stars",
        "Title": "Charging issues",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "I really like the sound of these and how they fit. I have small ears so finding earbuds is sometimes a challenge. Like these. This is my second pair. With that being said I prob won’t buy them again. My first pair I got and same thing. Loved them but after about 5-6 months they wouldn’t charge the right bud. I tried to carefully clean the inside of the case, bottom of the bud and it wouldn’t charge. So I chocked it up to a $30 bud and bought a new pair. Same thing. 5-6 months later it stopped charging the left side. So now I have two cases to charge one pair. So it’s just sort of frustrating and I hate clutter so my drawer just feels cluttered having 2 cases chillin out in there.",
        "Number": 3
    },
    {
        "id": 115,
        "Reviewer": "Amber",
        "Rating": "3.0 out of 5 stars",
        "Title": "Great but connectivity issues",
        "Date": "Reviewed in the United States on March 2, 2024",
        "Body": "None of the reviews that I’ve seen seem to really mention this. I tested these while running today. If I keep my phone in my pocket, the music starts cutting out a little bit here and there. It’s fine if my phone isn’t in my pocket… but music cuts out quite a bit at times when my phone is in my pocket. Very annoying and it’s a dealbreaker for me as I always keep things in my pocket. Otherwise, they sound great. I’m going to return these unfortunately.Update: I went for a walk and didn’t notice as much of it cutting out… almost none at all. I feel like it was worse during the run, possibly because many other people were around? Not sure, but still a dealbreaker.",
        "Number": 3
    },
    {
        "id": 116,
        "Reviewer": "Patti H.",
        "Rating": "3.0 out of 5 stars",
        "Title": "Good but not great",
        "Date": "Reviewed in the United States on June 9, 2023",
        "Body": "Bought these Bluetooth earbuds as well as a pair of Tozo NC2 earbuds. These fit my small ears better (closer to that of Apple AirPod Pros) but my habit of only wearing one earbud at a time isn’t great. These earbuds are not single user friendly because the right earbud won’t function as a single…tapping doesn’t answer calls nor will it function as a play button, however it will pause the music/audiobook. I tend to use only one earbud at a time because of my constant book listening habit when completing mind numbing tasks around the house. I like to always keep one ear vacant for hearing other sounds around me and being able to switch to the other earbud when the 1st one’s battery dies. It’s equally important for me to be able to pause and restart what I’ve been listening to if someone speaks to me or something needs my full attention since I don’t always have a pocket to put my phone in. These don’t allow me to restart listening to my book/music once they’re paused using the right earbud. The left will work fine for this purpose so I’m not sure if I have a faulty set or if they all do this. The sound quality is great but the pass through of ambient sounds around me are more of an annoying whooshing/static noise on top of my music. I prefer to use the noise cancellation feature for that reason. Phone conversations are great using these earbuds and my husband says that it’s easier to hear me using these than my AirPods because these don’t amplify all the sounds around me to hear splitting noise (turning on a water faucet doesn’t drown out my voice nor does the click of my knife on my cutting board). Would I buy these again…possibly but there are so many to choose from in this price range, I’d probably give a different brand a try first.Edit: seller contacted me to assist me with the problems described above and couldn’t resolve the issues. I received another set of earbuds from them free of charge and this pair will function as a pair or single earbud for pause/play of audio listening but will not answer phone calls. The only way I can take calls on the second pair is to answer the call using my phone and switch from phone to the earbuds. I have also discovered that despite removing the earbuds from my ears they do not have the pause detection of Apple that will automatically pause listening when removed. These will continue playing audio until both earbuds are placed into the charging case. This is not a deal breaker but definitely an annoyance if I pause audio, remove them from my ears and inadvertently touch the earbuds and restart audio while handling them (quite easy to do). I am very pleased with this seller and their response to my difficulties with the purchase, but I’m not really impressed with the earbuds. I do continue to use them since I can get around the problems and I hate to toss out a great fitting earbud.",
        "Number": 3
    },
    {
        "id": 117,
        "Reviewer": "Marn",
        "Rating": "3.0 out of 5 stars",
        "Title": "Works great, but only with my phone",
        "Date": "Reviewed in the United States on February 23, 2024",
        "Body": "I got these because my Apple air buds were dying..not working as great anymore with phone calls and I didn’t want to spend the $$ right now. They work clearly for phone calls and listen to music from my phone. The case feels cheap, but that doesn’t matter so much..but my watch and iPad won’t connect..I can even get it discoverable on my other devices. My only other complaint is getting used to the fact that if I take them out of my ears, the music/audio doesn’t stop and the button to answer calls doesn’t work. You get what you pay for and I’ll probably go back to a pricier option, but for now they work for hands free phone calls!",
        "Number": 3
    },
    {
        "id": 118,
        "Reviewer": "CelticLad",
        "Rating": "3.0 out of 5 stars",
        "Title": "Not for me",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "I tried the various sizes of the rubber ends that go into the ear, and unfortunately none sealed as well as my old ones.  This being the case, there is a fair amount external noise leakage.  The end that goes into the ear is actually oblong instead of round, so perhaps that is why they don't seal very well. There is also some discomfort after having them in for a while.  Regarding the sound quality, they are a bit too mid-range/boxy sounding.  If sound quality, comfort, and/or noise cancellation are important to you, then I would suggest you look elsewhere and be prepared to pay a bit more....you get what you pay for I suppose.",
        "Number": 3
    },
    {
        "id": 119,
        "Reviewer": "Amazon Customer",
        "Rating": "3.0 out of 5 stars",
        "Title": "You get what you pay for",
        "Date": "Reviewed in the United States on February 19, 2024",
        "Body": "I purchased these to replace my Apple iPods because these were inexpensive and had rubber tips-which I was hoping would be more comfortable. But I did get what I paid for. The sound quality is not too bad, but the headphones fall out of my ears whenever I bend or lean over--and sometimes even when I'm not bending. And if I accidentally bump them--even lightly, the music pauses--which is annoying because it happens a lot. They will also continue to play when I take them out--they don't automatically stop. So, if you aren't too bothered by that kind of thing, then these are fine. But if you have the $$ to spend on something nicer--then do it.",
        "Number": 3
    },
    {
        "id": 120,
        "Reviewer": "AMAZON Customer",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great product",
        "Date": "Reviewed in the United States on March 13, 2024",
        "Body": "First pair of completely wireless earbuds. I was reluctant- comfort and afraid they’d fall out. They are completely comfortable and stay put! The charge on the case lasts exceptionally long! The sound is excellent- while they are not 100% noise canceling, they have clear and strong volume that does the trick. I am going to purchase a set for my husband. Great value!",
        "Number": 5
    },
    {
        "id": 121,
        "Reviewer": "thirst4music",
        "Rating": "5.0 out of 5 stars",
        "Title": "Great value for both phone calls and music",
        "Date": "Reviewed in the United States on February 14, 2023",
        "Body": "Sometimes I'm amazed by the advancements in wireless and micro technology, especially when it comes to audio. These popped up in an email from Amazon a few days ago. Though I usually ignore those Deal notices this one intrigued me. I have a JBL Everest over-ear headset that I love for indoor phone calls and they're pretty good for music too (though I don't use them that way). I often like to go outside when I'm on the phone and the JBLs aren't convenient to use with a stocking cap, so I'd thought briefly about getting something in-ear to wear under my hat. These were $35 and the reviews were good. I liked that the case wirelessly charges the ear buds, and the case can be charged wirelessly too. My Samsung phone has wireless charging so I already have two wireless chargers and they're very convenient (especially given that the USB port on my phone was getting sketchy). So I figured I'd give them a try. I played a variety of my favorite music. I first asked for Jeff Buckley live music and the first song that started playing as I stepped outside was \"Hallelujah.\" I walked around the property listening to my favorite music and before I knew it I had been listening to music for about three hours. I had really only cared about the sound quality for phone calls and whether they would stay in my ears (which is usually a problem for me). They never came close to falling out and they are comfortable. For phone calls the sound quality is very good on both ends. And though they're rated as having a 33' range I walked all around the house and got considerably farther than that from my phone with two walls separating the devices and I had no dropouts. Overall I am so happy with them that after a week of using them I ordered a backup pair.I have three VERY minor niggles but even combined I wouldn't consider them significant enough to knock off even ½ star. First, I had trouble gripping them well enough to get them out of the case quickly when I got an unexpected phone call. I started leaving them on a paper towel on the table next to me, but it now seems I've discovered the right way to grip them. Second, though they have a voice announcement of which side is which when first removed from the case, I was concerned that I might confuse L and R as they don't appear to have any visible indicators. My solution was to use my fine-point permanent marker to write an L on the left one. Third, one of my wireless phone chargers is a tilted stand that holds my phone at a convenient angle. I was unable to get the Ear buds case to wirelessly charge on that one until last night when I accidentally discovered that the problem was that the case was too small to hit the sweet spot on the charger. I solved the problem by boosting the case up with a pad of mini sticky notes (as shown in the photo).EDIT (I apologize if I forget to come back to delete my previous review):None of the above has changed but I forgot to mention that these are NOT good for noise isolation (at least not the way they fit me) but I prefer it that way. I'm a musician and music sounds less natural to me when the surrounding environment is completely eliminated, and I like being able to have a conversation or hear a knock at the door without removing them. Even without a tight seal I never have to reseat them and the sound quality stays consistent (a first for me after trying several other brands).UPDATE: I've been using these ear buds for five weeks now. I use them for hours every day and they continue to impress me. On three occasions only the right channel had a signal when I initially put them in to listen to music, but each time I put them back in the case and took them out again (which turned them off and on) and they worked normally. I've only had this happen with music and only when I first take them out of the case (i.e. it hasn't happened while on a call or after I've been listening to music with both working).",
        "Number": 5,
        "image_urls": [
            "61fvUKyPotL._SY88.jpg"
        ]
    },
    {
        "id": 122,
        "Reviewer": "Julius Forte",
        "Rating": "5.0 out of 5 stars",
        "Title": "Amazing buds/price/service... buy these!",
        "Date": "Reviewed in the United States on March 24, 2023",
        "Body": "Yes, my subject line sounds like that trash hyperbole you get on annoying pop-up ads on your Smartphone! And ironically, it usually has to do with ear buds. There are tons of them on the market, and everyone claims to be the best.Now, first off, I am just a customer… never got any gifts or money or anything from this company, nor was asked to “click on a review” for a discount or whatever. No… the reason for all this hallelujah chorus, is that I’m really totally both jazzed, and a bit in awe of these earbuds. I think the main mind-blowing thing about them is the price. I mean, I have a bit of experience and knowledge with this kind of technology, and frankly, these days, what “guts” that are needed to be used to create Bluetooth ear buds is not that complex… nor expensive. How company’s like Sony, Apple, Bose, etc. can charge upwards of $300 for these boarders on theft and fraud!I’ve tried those “Rolls Royce” buds, and I urge you to do the same, and then try these Tagry Bluetooth Wireless Earbuds that are literally 90% less expensive. Yes, they retail for about $35! They come in an excellent quality charge base, are extremely easy to put on, (and have three extra size buds to give you a custom fit), and most important, their sound quality, and I mean crisp highs, solid middles, and bone- rumbling base, are outstanding. I cannot understand what more you would want either using them for talk radio, podcasts, YouTube, streaming movies, or TV, or playing your Amazon Music or Spotify or iTunes playlists. And yes, if connected to your iPhone, you can make and receive calls, and the microphone in the buds are top quality.Their Bluetooth software is flawless, connecting to your iPhone, or other Bluetooth devices effortlessly. They come with a pleasant woman’s voice letting you know various messages, like which earbud is in what ear, if they are connected or turned off, your volume control (including excess volume warning), etc.I’ve had these for several months, and have found the charging, which has a bright LED display and shows the individual charging of each bud, along with their percentage easy to read.And a note on their service. I’ve heard horror stories of folks trying to reach the outrageously over-priced other earbud company’s for tech support, or refunds, exchanges, etc. Basically it’s nonexistent, and when you do miraculously find a phone number to call them, and get someone on the line, you have to go to the UN to find an interpreter of rare third-world languages to understand what they are saying, and they seem to be trained, not on anything to do with the product, but to make the call as useless and confusing as possible, so that you will just give up and throw their buds, and your money in the trash.Now, I did have an initial problem, after a few months, in that the base charger seemed to be slowing a bit. Tagry gives you a LIFETIME WARRANTY… yes, an actually lifetime warranty, not one of those sham “lifetime warranties”, that corrupt company’s like Hammacher Schlemmer  have.I had enrolled with Tagry, on their website, to activate my warranty as soon as I received the buds. I called Tagry when I was seeing what could be a glitch in their charging base, and yes, unlike most other companies who hide their contact numbers as if they were nuclear codes, Tagry’s support phone number is plainly printed on their manual, and to my astonishment, I immediately was connected to a good ‘ol American customer service person, who actually worked for the company, spoke English, and made me feel as if I was a long-ago trusted friend. They truly cared, and said they were sorry, and that there was no need to troubleshoot the base, or return it, instead, they would process an order to send me a new one.A day later, they actually called me back to let me know that the replacement had been shipped, and that I should have it in a day or so, and if not, to please call them back right away. And yes, to apologize again for any inconvenience.  The replacement arrived the very next day. And again, their warranty is indeed for a lifetime, a no questions asked replacement policy. This is how much they believe in their product, and respect their customers.So, yes. It is insane to pay more than $35 for quality Bluetooth earbuds. Last year, I sent about a dozen of these out to friends and employees, to use for personal use, and for all that Zooming going on… and they love them. And none of had any problems.I’m sure you have had a plethora of bad experiences in the past few years, what with isolation, and way too much ordering on-line, finding the products you buy to be substandard, and customer service virtually non-existent. And that is why I’ve spend all this time expounding on the greatest of my earbuds. Yes, I have a life. Really. But what a joy to be able to tell a story like this, rather than the kind of frustration most of us are experiencing every day!Yes, goodness and quality still exist. It’s rare… but it’s out there!",
        "Number": 5
    },
    {
        "id": 123,
        "Reviewer": "Kayla",
        "Rating": "5.0 out of 5 stars",
        "Title": "Long lasting earbuds",
        "Date": "Reviewed in the United States on March 9, 2024",
        "Body": "Didn't want to spend a bunch of money on apple airpods so I bought these as an alternative. The sound is great and they stay in my ears. I took them traveling with me and I've never had them fall out and it's been months now. The battery life lasts a long time and the case tells you how much battery is left. Easy to connect to any of my devices too I've never had an issue. The rose gold color is also super cute too I got compliments on it",
        "Number": 5,
        "image_urls": [
            "61DkFi0i4eL._SY88.jpg",
            "61yk0+CNpxL._SY88.jpg",
            "71kMSuoRFyL._SY88.jpg"
        ]
    },
    {
        "id": 124,
        "Reviewer": "Semiha",
        "Rating": "5.0 out of 5 stars",
        "Title": "Perfect …The best earphone I purchased",
        "Date": "Reviewed in the United States on February 29, 2024",
        "Body": "I keep losing my Apple earphones so I gave up buying them and tried this one ,but before coming to this I Ofcourse tried other brands,everything else I tried was garbage…But this one is life changing…..Everything about this earphone is great,not even one single downsize I can name …Price point ,battery life life is great,sounds great,very pretty,digital screen that showed the battery life is cherry on the top…Very comfortable to wear…You name it …. This might be the best purchase I made on amazon,and I have been shopping here more than 10 years…But now :)",
        "Number": 5
    },
    {
        "id": 125,
        "Reviewer": "YI",
        "Rating": "5.0 out of 5 stars",
        "Title": "Budget-Friendly and Durable",
        "Date": "Reviewed in the United States on March 16, 2024",
        "Body": "I opted for these Bluetooth headphones instead of splurging on AirPods, fearing I'd inevitably lose them—and guess what? I haven't lost them yet! Surprisingly, these headphones have exceeded my expectations in terms of both quality and durability.I was pleasantly surprised by the sound quality and overall performance of this product, especially considering its affordable price point. But the real shocker came when I accidentally ran one of the headphones through the washer. Despite the mishap, it continued to work perfectly fine afterward!This experience has reaffirmed my belief that you don't need to spend a fortune on Apple products to get a reliable pair of headphones. These Bluetooth headphones are proof that quality and durability can come at an affordable price. Don't hesitate to give them a try!Overall Rating: ⭐️⭐️⭐️⭐️⭐️",
        "Number": 5
    },
    {
        "id": 126,
        "Reviewer": "Sara Slick",
        "Rating": "5.0 out of 5 stars",
        "Title": "Crisp, clear and comfy",
        "Date": "Reviewed in the United States on March 18, 2024",
        "Body": "First off this is my very first pair of these kind of ear buds, and I am impressed… They’re comfortable which I was nervous about because a lot of the older buds (the ones that came with iPhone) never fit my ears right. I have small ear holes or something. The first song I chose to listen to was Bottle and Mary Jane by Jelly Roll. It sounds great! I paid less than $30 and I gotta say they’re worth every penny. I cannot compare them to more expensive buds because I’ve not used them.  But these are perfect for me because I won’t be  using them much. I don’t care about name brands or having the product of the moment. If they don’t last or if I start having issues I will update this, as I just got these 2 days ago.",
        "Number": 5
    },
    {
        "id": 127,
        "Reviewer": "Dynae Saba",
        "Rating": "5.0 out of 5 stars",
        "Title": "These are EXACTLY WHAT I NEEDED!",
        "Date": "Reviewed in the United States on February 28, 2024",
        "Body": "My expensive pair of Air Pods fell in half right after the warranty expired. I no longer had a desire to pay for mediocre headphones that loss their effectiveness more and more overtime. I ordered two low cost headphones on amazon (this pair being the first to be delivered) and I couldn't be happier! These fit perfectly in my ears (I have sensitive ears that will ache over an extended period of time of wearing headphones...Not with these!!! ). The sound quality if superb and I don't ever have them turned up full blast as they're really loud. I utilize them to listen to audio books and podcasts for 8 hours at work and they've never died. I use one at a time and I don't even need to switch sides within those 8 hours. I charged the case the day I received them and that was a week and a half ago and I still haven't recharged them. Talking on the phone voice clarity is great and I have had no issues. Connectivity is easy and consistent. These will be my go to!",
        "Number": 5
    },
    {
        "id": 128,
        "Reviewer": "Cory Maffeo",
        "Rating": "5.0 out of 5 stars",
        "Title": "Elevating Your Audio Experience with 60H Playback, LED Magic, and Wireless Elegance!",
        "Date": "Reviewed in the United States on November 28, 2023",
        "Body": "Greetings, fellow audiophiles and tech enthusiasts,Prepare to be immersed in the unparalleled realm of acoustic excellence as I present to you the TAGRY Bluetooth Headphones—true wireless earbuds that redefine the boundaries of audio sophistication. In a world inundated with options, these earbuds stand as a beacon of unrivaled quality, seamlessly blending cutting-edge features with a touch of elegance. This isn't just a pair of headphones; it's an auditory odyssey, a five-star experience that elevates your audio encounters to new heights.**A Symphony of Sound Quality**: Step into a world where crystal-clear audio is not a luxury but a norm. The TAGRY Bluetooth Headphones orchestrate a symphony of high-fidelity sound, effortlessly delivering crisp highs, rich mids, and deep lows. It's not just audio; it's a sonic masterpiece that transforms your listening sessions into immersive journeys.**60 Hours of Playback Brilliance**: Picture this—a marathon of your favorite tunes, uninterrupted for an astounding 60 hours. The TAGRY Bluetooth Headphones are not just earbuds; they're a testament to endurance and longevity, ensuring your musical companionship lasts as long as your playlist demands.**LED Power Display Magic**: The LED power display on the charging case is like a visual symphony, providing a glance into the soul of your earbuds. It's not just a display; it's a communication tool that keeps you informed, ensuring you're always in sync with the power status of your audio companions.**Wireless Charging Elegance**: Effortlessly recharge your earbuds with wireless charging capabilities that redefine convenience. It's not just a charging case; it's a sanctuary that breathes life back into your earbuds with the grace of technological elegance.**IPX5 Waterproof Assurance**: Life happens, and so do unexpected rain showers and sweaty workouts. Fear not, for these earbuds are equipped with IPX5 waterproof technology, offering protection against water splashes and sweat. It's not just durability; it's a shield that ensures your audio experience remains untarnished even in the face of the elements.**In-Ear Comfort and Mic Mastery**: The ergonomic design of these in-ear earbuds isn't just about aesthetics; it's a commitment to your comfort. Wear them for hours on end without discomfort, and with the built-in microphone, seamlessly switch between music and calls. It's not just convenience; it's a harmonious blend of functionality and comfort.**Universal Versatility**: Whether you're engrossed in your favorite TV series, engrossed in the virtual world of your smartphone, engrossed in a work project on your computer, or engaged in the physical rigor of sports, these earbuds are your versatile companions. It's not just compatibility; it's a testament to the universal appeal of these audio marvels.Now, skeptics may question, \"Are they merely earbuds?\" To them, I say, dear reader, they are not *just* earbuds. They are the silent guardians of your audio sanctuary, sentinels against the disruptions that threaten your auditory bliss.In conclusion, if you've ever aspired to lose yourself in a symphony of audio excellence, the TAGRY Bluetooth Headphones are your gateway to a five-star auditory experience. They're not just a pair of earbuds; they're a commitment to the immersive world of sound.To musical journeys, uninterrupted playback, and the undeniable charm of audio sophistication,Yours in auditory bliss and wireless elegance,An audio enthusiast who knows the sweet serenade of impeccable sound.",
        "Number": 5
    },
    {
        "id": 129,
        "Reviewer": "Codie S.",
        "Rating": "5.0 out of 5 stars",
        "Title": "Excellent low cost earbuds",
        "Date": "Reviewed in the United States on February 27, 2024",
        "Body": "I read and watched lots of great reviews prior to buying these. So far my experience has lived up to those reviews. I'm pretty impressed with the sound quality of these earbuds. The battery life is quite long, and I can get several full recharges out of the case before needing to plug it in. They are comfortable in the ear, and stay in easily.If I could suggest anything, it would be a larger option for the earbud insert. The biggest one in the pack works for me, but I can still feel some wiggle room that perhaps a larger insert would take care of.I will point out these are not meant to eliminate all outside noise, but dampens it down quite a bit. If I have these in while using a lawn mower, I can still hear music but not super clearly. You may want to consider an over the ear headphone if that's the intended use.Overall I am very happy with these and definitely recommend them!",
        "Number": 5
    },
    {
        "id": 130,
        "Reviewer": "Gay Hamilton",
        "Rating": "2.0 out of 5 stars",
        "Title": "You get what you pay for ...",
        "Date": "Reviewed in the United States on February 29, 2024",
        "Body": "After putting my airpods Gen 2 (by accident) through the wash cycle i needed to get a replacement but didn't want to drop another $90. So i found these on here. Here's my personal review:The Good:- Cheap-ish- Easy to setup / first Connect to iPhone 14 proThe Bad:- Sound quality is not good and tinny- As other have mentioned the ear pods will stop playing at the slightest touch- They sometimes wont start playing again without disconnecting and reconnecting- They don't stop auto-play when removed from ears- They wont take an incoming calls (or notify you) when playing music- Case and ear bud design is not intuitive and difficult to grip to remove from case and put back in- The battery charger levels were not accurateI tried to like these for over 3 months, but just gave up and went back to a backup wired iphone headphones due to quality and ease of use. Ive now bought another set of iPhone Gen 2's to replace this and the difference is very noticeable in all aspects. I'll just need to be more careful in the future.All in all you get what you pay for. Cheap for a reason.",
        "Number": 2
    },
    {
        "id": 131,
        "Reviewer": "Leigh G.",
        "Rating": "2.0 out of 5 stars",
        "Title": "No longer able to charge the charging case",
        "Date": "Reviewed in the United States on May 6, 2023",
        "Body": "The first day I received them, the charging case was down to 91.  I plugged it into the charging cable that was included and it would not charge.  It stayed at 91 for several mins.  I kept opening and closing the case still nothing.  I then removed the earbuds from the case and plugged it back.  It immediately started charging.  It charged up to 100% within a few mins.  I used the earbuds that night and the next morning put the earbuds back into the case to charge.  When I connected them to my phone today, my phone's Bluetooth showed the earbuds charged to 100%.  The case itself is now showing it's charge at 86.  So I plugged it in and tried charging it.  It will not charge now.  It just stays blinking at 86 when you plug it in.  I bought a wireless charger, still will not charge.  I have plugged it into a couple different USB-C chargers, still will not charge.  I removed the earbuds again, still will not charge.I actually spoke to their customer service regarding the issue yesterday of not being able to charge the case unless I remove the earbuds. I'm not sure why they're not understanding me, however, the final response from them said it could've been a misreading on the case.  At that time, I just figured I'd deal with it.  Unfortunately today, I'm not able to charge the case at all.  I did register the earbuds through Tagry online, so I will just contact them and see what the next step is.  I will update the review after I speak to them again.  I originally was going to give these earbuds 1 star, but upgraded to 2 stars because their customer service was really nice and tried really hard to troubleshoot the issue.Also there is zero noise cancellation.  I can't remember if it stated it had noise cancellation or not, but it doesn't.  You can clearly hear everything around you.  I also keep hearing a poping noise when I please the earbud in my ear.  I'm not sure what that it.  The sound is alright.  It's definitely not crystal clear and the bass isn't anything to get excited over.  I have another pair of earbuds from another brand that sounds much better.  These are actually pretty comfortable to wear which is what I wanted.  The battery life is ok I guess.  I used the earbuds to fall asleep in and after a few hours they were down to 68.  I was hoping the battery life would've been better.  At least they didn't die after only a couple of hours.  Honestly you get what you pay for.  I didn't expect anything phenomenal, but I didn't expect to have any charging issues right off the bat.",
        "Number": 2
    },
    {
        "id": 132,
        "Reviewer": "KitCat",
        "Rating": "2.0 out of 5 stars",
        "Title": "Not the greatest, but good enough, and comfy for the price",
        "Date": "Reviewed in the United States on December 21, 2023",
        "Body": "Update after 2 months: they're starting to fail already, so dropped my review down from 4 to 1. I had no trouble with them for the first month, but now I'm getting complaints from people I'm talking on the phone with that in the middle of our phone call they can't hear me at all, or become so garbled they can't hear me. Those complaints are getting more frequent, too. Now at the 2 months mark the audio connection is also getting spotty, where the music I'm listening to will cut out for a second here and there.I had a pair of Yeteky \"Wireless Earbuds Bluetooth Headphones with Wireless Charging Case 32H\" which were of better sound quality and had better touch button responsiveness, but they hurt my ears. I gave those to my husband and got these instead. These have a better battery life and are way more comfortable for me, but the touch button is hit and miss and I can definitely hear a little sound distortion. If you have bigger ears, maybe go for the other brand I mentioned? But for my ears I'll sacrifice some quality for a cheap alternative that doesn't cause pain.",
        "Number": 2
    },
    {
        "id": 133,
        "Reviewer": "janet",
        "Rating": "2.0 out of 5 stars",
        "Title": "Hard to turn off and on",
        "Date": "Reviewed in the United States on October 14, 2023",
        "Body": "Overall I'm unsatisfied.  For being a well reviewed item I would've thought it would be much easier to control the functions.  There's no easy way to adjust volume or turn off/on.  Of course when I try adjusting them in my ears they always seem to turn off and when I try to turn them on I end up having to attempt the process a dozen times or more to get them to work.  The sound is comparable to others on the market, nothing exceptional but by no means poor, fair for the price which is why I didn't rate 1 star.  But there should be a clickable button if they can't get their touch button to work better than this.  I've had these for more than a month and waited to review so I could give myself enough time to make sure it wasn't a learning curve too, it wasn't.  There were a few times I got them to work easy, but a majority of the time I end up tinkering with them for a minute or two just to get them to work at all.  Calibration with phone was easy however.  Maybe I just received a defective set.  But I'm already looking for a new set because I can't stand needing to fuss with them as much as I have to just to get them to do what I want.  I'd spend the money on a better set if I were you.",
        "Number": 2
    },
    {
        "id": 134,
        "Reviewer": "ChadN",
        "Rating": "2.0 out of 5 stars",
        "Title": "Stopped working. Too many issues.",
        "Date": "Reviewed in the United States on October 17, 2023",
        "Body": "I bought these because the reviews and the price were great. Well, they worked for a couple weeks and the sound quality was very good, but then the right side ear bud stopped working for some reason.Good thing I kept the box and they come with a lifetime warranty so I contacted the manufacturer. They suggested I clean the charging contacts. That didn't work. I sent them all the info they requested, including a video showing there was no reaction from the case when placing the buds inside or even removing them. That was enough evidence for them to send me a brand new replacement. They even offered color options. Great customer service!!I received my replacement buds fairly quickly. Its been about a month and they just started disconnecting for no reason. I was listening to music yesterday and they just disconnected. I thought that maybe I was too far away from the case so I didn't think much more of it.Well, I was sitting at my desk, just now, listening to music with the case right next to me they just disconnected. The case is 73% charged and the earbuds have been sitting in the case all night. There should be no reason why they would just disconnect.I'm over these earbuds. Too many issues. It's not even worth getting a new pair through the lifetime warranty because the next pair is going to have issues as well.I think I'm going to stay old school and use wired headphones.",
        "Number": 2
    },
    {
        "id": 135,
        "Reviewer": "Teaira",
        "Rating": "2.0 out of 5 stars",
        "Title": "Will just stop working",
        "Date": "Reviewed in the United States on January 2, 2024",
        "Body": "I really enjoyed the headphones in the beginning. The one downside I had initially was that they picked up every single sound around that. They were not noise canceling, nor did they make it easier for the person I was talking to to hear me. Most of the time when I was talking to a person I take them out and just bring my phone to my ear. They're not really great for having a conversation with someone over the phone I have found. I had put my headphones down for maybe a month, and pick them up and they refuse to pair with my phone. They cannot even be found by my phone. I found this to be a waste of money. I haven't even have them a year before this.There is no actual way to contact customer service, nor is there any troubleshooting advice online about how to fix the issue. Do not recommend if you are looking for long term ear buds",
        "Number": 2,
        "image_urls": [
            "619ZfZ+uScL._SY88.jpg",
            "61EtLwr5QlL._SY88.jpg"
        ]
    },
    {
        "id": 136,
        "Reviewer": "LC",
        "Rating": "2.0 out of 5 stars",
        "Title": "Good Enough But.....",
        "Date": "Reviewed in the United States on February 9, 2024",
        "Body": "I don't particularly like wireless ear buds/wrap around because the few that I have tried don't fit my ear. These did fit my ear, however the sound quality is muffled. They're OK for the 30 bucks, however, as time passed I noticed that I have a hard time hearing anything even with the volume turned all the way up unless I manually close whatever app I'm using and start again. Also the sound to visual is always off a couple nanoseconds or whatever.  That's visually annoying. Those are the main dislikes for me. Battery power seems to last a long time but I also don't use them much.",
        "Number": 2
    },
    {
        "id": 137,
        "Reviewer": "The Dude",
        "Rating": "2.0 out of 5 stars",
        "Title": "Too big for my ears",
        "Date": "Reviewed in the United States on June 27, 2023",
        "Body": "The reviews were great and I needed a replacement for my Air Pods that stopped charging/connecting to my phone. I didn't want to pay that much again when there are so many options, so I tried these. From the first day, I wasn't a fan. They are too big for my ear canals and slowly work their way out as I wear them, meaning I'm constantly having to adjust them. Which is annoying if I'm doing something that prevents me from adjusting (cooking) and means that they shut off the second I touch them, requiring me to restart whatever I'm listening to. Which is crazy because sometimes when they fall out/I take them out, they keep playing even though they're no longer in my ears. I don't get it. Worse is that they are super sensitive to wind. I like to walk outside to get in my steps, and if it's at all windy, they cut in and out the entire time. So much that there have been a couple times they've gotten out of synch and I'm listening to my audiobook in stereo. It's awful. I wore them on the airplane on the way back from vacation hoping I could get some sleep, and my ears hurt so bad by the time we landed that for the next flight I just took out my corded ear phones.I've only had them for a little over two weeks and I've already ordered a different pair because I hate these so much.The only good thing? One worked its way out of my ear while I was cleaning my pool and fell in, and it took me a few minutes to find it. It still works! Which is insane. So they're waterproof and maybe if you have bigger ear canals and don't want to walk in the wind they'll be okay, but for me, these did not work at all.",
        "Number": 2
    },
    {
        "id": 138,
        "Reviewer": "Cameron Baird",
        "Rating": "2.0 out of 5 stars",
        "Title": "Great for about 3 months",
        "Date": "Reviewed in the United States on June 24, 2023",
        "Body": "First and foremost, these earbuds have great audio quality and resonance, as well as sound buffering to neutralize outside noise. These are the pros, however the cons certainly outweigh them.In terms of UI, the touch-control doesn’t seem to have any sense of designation - meaning that if you brush against the earbuds, readjust them, or even simply hold them to converse with somebody - they will acknowledge this as an attempt to either change song, adjust volume, start/stop music, etc.This isn’t the crux of the issue, though.The key issue with these earbuds is the charging case malfunctioning. Maybe I have a defective set, maybe it’s an industry setting fault. When you place the earbuds into the charging case it charges the ear pieces (hence the name, obviously), and it displays for the user when one bud is finished charging. Sounds great and would be a fantastic tool, and it worked as described for the initial 3 months; however, after this period the right earbud seems to need continuous charging. I’ll see it displayed on the exterior of the charging case and it will continue to do so until the case itself is out of power, at which point it is more or less defunct. This issue takes about 12-24hours to drain the battery. Now, this is not a huge problem given the time frame, but I have to keep it on the charger at all times, which defeats the purpose of the charging case.I have tried everything from cleaning both the earbuds and the case, thoroughly, adjusting the metallic charging prongs to ensure one is not jammed, etc., but all to no avail.Good product, but certainly better products out there. Should mine simply be defective, then I would rate this a 4 star product given the UI issues.",
        "Number": 2
    },
    {
        "id": 139,
        "Reviewer": "Michelle Williams",
        "Rating": "2.0 out of 5 stars",
        "Title": "Cute, but battery dies very quickly.",
        "Date": "Reviewed in the United States on October 20, 2023",
        "Body": "I bought these to replace my first identical pair that I ordered and received last week because I had misplaced a different pair that worked wonderfully. When the battery ran down quickly, I found my original earbuds and processed a return. I was given the option to get a new pair or a refund, and decided that maybe the new pair would work better.The reviews I had read boasted that the battery life for this model was long and that they also had q good and clear mouthpiece. I recieved this pair yesterday and waited until this morning to open the package and make sure I charged them and the battery pack before I used them. The battery pack went from “100%” to “70%” and then back up to “100%” as it was connected to a power source. I took the earbuds out and carried them around the house for the day, but only used them for a couple of phone calls. Then, this evening I put them on to listen to an audiobook. About 30 minutes in, the prompt “The battery needs to be charged” started and repeated itself in a couple of minutes. I'm sending this set back as well. Disappointing!",
        "Number": 2
    },
    {
        "id": 140,
        "Reviewer": "Callie",
        "Rating": "4.0 out of 5 stars",
        "Title": "Good for the price",
        "Date": "Reviewed in the United States on January 14, 2024",
        "Body": "Good for the price, however there are SOME issues.If you have tiny or sensitive ears, these are not comfortable. I'm unfortunately unable to wear them for periods longer than 40-ish minutes due to how paiful they are to wear. This is just an issue with my ears, but if you are like me and you are determined to get these, wear them upside down. It's significantly less painful.The audio is loud. Even on the lowest setting, these things are pretty loud. I have autism and when im having a sensory overload, the lowest settings of these are very painful. Wholeheartedly recommend using these with an app like spotify where it allows you to lower the volume further via the app.The touch sensors on the side are SO SENSITIVE. My hair manages to trigger them, yet when I actually want to skip a song or pause and play my music, it doesn't work to well and can lead to some frustration.The audio quality itself seems okay. It's definitely not like my more expensive over-the-ear headphones, but it isn't grating or awful. I don't use these for calls,  so I'm not too sure about the mic quality.Battery life is pretty nice, the overall feel of the earbuds in my hands are nice also. The case feels a little cheap on the outside, but not to the point where I feel like the lid is going to break off. Just be careful not to drop them.I like the color and appearance of them! They look exactly like the picture. I haven't had any issues with the case or charging, but please be aware when you first turn it all on, the case battery is going to drop very quickly to charge the headphones.The earbuds come with a lifetime warranty you can activate for free. I reached out to customer support regarding a question, and they replied within the next business day and were very helpful.TL;DR:Hurts tiny ears, loud minimum audio, touch gestures kinda suck... buuutttt audio itself good for the price, the earbuds come with a free lifetime warranty, battery life is nice, they look exactly as advertised, customer service is quick and efficient.Overall 4/5⭐️",
        "Number": 4
    },
    {
        "id": 141,
        "Reviewer": "David Kim",
        "Rating": "4.0 out of 5 stars",
        "Title": "GREAT build quality, BUT .... (UPDATED: Excellent Customer Service!)",
        "Date": "Reviewed in the United States on February 18, 2024",
        "Body": "(UPDATE: Right after expressing my concerns with the sound quality, customer service reached out to see how they could help! I added a star because it's REFRESHING when customer service is actually great!)... it's got issues.At the time of writing, I'm writing this review, mostly because this product has SO much promise, but it has two issues that left me disappointed. Also, for preface, I'm a filmmaker who also makes music, so I'd say I have a good ear for sound.First, the good: The build quality is EXCELLENT, especially for the price! It's a bit bigger than some competitors, but it's really light and well-made. The screen is helpful, and the earbuds themselves feel solid. Bluetooth connectivity is straightforward as well!Now, onto my critiques: A smaller one, but still important, but the noise cancelling just doesn't work on this. While it does a good job blocking out sound, I've had friends and family members complain about my microphone when calling. The product actually lists that it has some sort of noise canceling for calls, but it's nothing really special.But that's not my biggest problem.It's just the sound is SO off! Some people might be able to get used to it, but I can't. It was really shocking because the first impressions were great, and I don't get why so many people have reviewed this so positively. As someone who listens to a wide range of music (hip hop, rock, pop, even traditional East Asian music!), the earbuds do a poor job of outputting a clear sound. The mix is REALLY muddy, especially at the low frequencies. Basses really mess up male vocals, and high frequencies are airy. The mids seem completely missing, almost like the inverse of what you'd hear through a phone!If they can just adjust their EQ to sound fuller (and maybe tone down the bass), then these would be INCREDIBLE. Again, I'm SHOCKED that this has as many positive reviews. I'd rather buy $8 wired earbuds over these. This product has HUGE POTENTIAL, but completely WASTED buy the actual sound quality.(And no, I will not be downloading EQ's specifically for these earbuds. I have too many devices)The Tozo T6 (my previous earbuds) are a great alt at this price point (whenever it's on sale at least), but since I wanted to try something new, I'm sticking with the JBL Vibes. They sound great :)",
        "Number": 4
    },
    {
        "id": 142,
        "Reviewer": "Ohad",
        "Rating": "4.0 out of 5 stars",
        "Title": "Price so good...sound so bad",
        "Date": "Reviewed in the United States on March 7, 2024",
        "Body": "For $35? These are incredible. I'm planning on buying 2 or 3 more to give as gifts. The interchangeable ear cups let you customize the fit and the little screen on the case that shows the battery level is nifty--Apple should have this feature. Since you can buy three of these for the cost of only one pair of the basic Airpods--they're awesome. The sound quality is just terrible! I found that changing the EQ settings on my iPhone helps a bit depending on the type of music you are listening to. These don't noise cancel at all.  They feel cheap. The plastic on the case is rough--not smooth like Airpods. The case is flimsy. I'm worried that flipping it open and shut often could lead to it breaking. The earbuds themselves are so light in your hand--very easy to drop. I'm confident these will work great for what I bought them for--listening to music in the gym and podcasts while I'm folding laundry--and I built that assumption into my purchase--I didn't expect great sound. If you're settling in to really listen to music and drown out noise in a coffee shop, these are not for that.",
        "Number": 4
    },
    {
        "id": 143,
        "Reviewer": "Amazon Customer",
        "Rating": "4.0 out of 5 stars",
        "Title": "Good quality",
        "Date": "Reviewed in the United States on February 21, 2024",
        "Body": "I ordered these earphones yesterday after I spent some time reading the reviews. I was a bit scepitable due to the price and some of the reviews. They were delivered the same day I ordered them. I opened the box to find them 100% charged! I put them in my ears fit was great and I can walk and move without them falling out of my ears. It was an easy set up with my Samsung s10. I haven't utilized any of the buttons yet. I tried the volume today per the booklet, but was unable to get it to work. I find it easier to use the phone volume button. I don't plan to use these for calls only music. I find the music quality = in both ears. I went out in my backyard and was able to walk freely without losing the connection. I left the phone in the house and was able to get about 25 ft until it wasn't commuicating with the phone. I was digging up some small tree roots and the earpieces remained in except once. It loosened in my ear and when i pressed it back in it stopped the music. Me not wanting to figit with the button to figure it out I chose to walk to my phone. In the coming days I will explore the buttons, but not today.",
        "Number": 4
    },
    {
        "id": 144,
        "Reviewer": "Ashlyn V.",
        "Rating": "4.0 out of 5 stars",
        "Title": "May as well be Michael Phelps",
        "Date": "Reviewed in the United States on March 1, 2024",
        "Body": "Comfort: 5/10Sound Quality: 6/10Convenience: 8/10I kind of hated these when I first bought them because they weren’t the best in comfort or sound quality but used them because $40 is $40.However, they’re powered by like…. Idk radioactive rabbits or something. They charge super fast and the charge lasts around at least 7 business days.But also, they are truly truly water proof. How do I know? Because I’m a mom of a nasty lil 9yo and a potty training 2yo and LAUNDRY is taking over my house. I pretty much just load up the forklift, drop the clothes in, and have a fun lil scavenger hunt after the clothes come out. These sweet lil headphones didn’t deserve to go through the washer with my kids crap stains and half eaten suckers, but they did. And they came out of the washer as if they hadn’t just been traumatized.Props.",
        "Number": 4
    },
    {
        "id": 145,
        "Reviewer": "Odell R.",
        "Rating": "4.0 out of 5 stars",
        "Title": "Sounds good!",
        "Date": "Reviewed in the United States on March 14, 2024",
        "Body": "The earbuds were delivered quickly in a nice box, reminiscent of Apple packaging. The instructions were straightforward and concise. The earbuds fit very well into a nice carrying case that includes a battery indicator for the case as well as indicators that the earbuds are charging. The case has kept a good charge and has only been charged once since I got them. However, I only use the earbuds for a short time every day at this point.The only problem I have with the earbuds is that it’s difficult to determine where exactly to tap to change volume, track, answer my phone, etc. I think that will work itself out as I use them more.",
        "Number": 4
    },
    {
        "id": 146,
        "Reviewer": "alan",
        "Rating": "4.0 out of 5 stars",
        "Title": "Falls out. Good sound and battery life",
        "Date": "Reviewed in the United States on January 21, 2024",
        "Body": "Moved on to these after old airpods not keeping charge. They're a lot bigger. They tend to fall out of my ears when I talk, bend down, chew or move rapidly. When I adjust the placement while wearing them they turn off the audio or switch tracks, but I cannot seem to get the hang of changing tracks or turning off the audio etc while they're in. My ear did get sore where the earbud changes size from small inner ear portion to the larger portion that hangs out of the ear. They tend to build up moisture in the ear canal. Not that it's unbearable but it's a different experience and I'll have to be diligent in keeping the earbuds super clean.The sound is good. They're not completely noise cancelling which is good for my needs. I have not tried them in very noisy environments though.The microphone is good for calls but voice to text seems to have difficulties. It could be an issue with something I'm doing but it's an issue I'm having nonetheless.The battery life is surprisingly good. I like the fact that the battery life is shown on the outer case. No guessing when you might need to charge it.The case is a bit bigger than I expected but it's easier to find when it wants to fall to the bottom of a bag or backpack.",
        "Number": 4
    },
    {
        "id": 147,
        "Reviewer": "Schwindjr",
        "Rating": "4.0 out of 5 stars",
        "Title": "Best backup set I've owned",
        "Date": "Reviewed in the United States on March 6, 2024",
        "Body": "I've tried dozens of bluetooth earbuds; brands and styles, cheap and expensive.  I don't need tons of features, but I do need earbuds that don't fall out when working out.  My Anker Soundcore X10 are my go-to @ $70.  But these TAGRY earbuds are half the price, connect easy, have a long charge, and DON'T fall out of my ears.  If I could give a star rating for \"fit\" it would be a 5.  Make no mistake, this set does not have active noise cancelling or really dynamic clear sound.  They work and they stay in my ear at the gym.  Great find at this price point.",
        "Number": 4
    },
    {
        "id": 148,
        "Reviewer": "Amazon User",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great headphones for the price",
        "Date": "Reviewed in the United States on March 11, 2024",
        "Body": "These are great, reliable headphones for the price.  Easy to connect, audio sounds great.  When comparing to the Apple Airpods, however, the only drawback is that after wearing them for over an hour, they are not as comfortable as the Airpods.  There is an indescribable comfort with the Apple Airpods - you almost forget you're wearing them.  I've tried several different sizes of the silicone caps, however, no matter the size - over time, they are not comfortable.",
        "Number": 4
    },
    {
        "id": 149,
        "Reviewer": "Momnurse",
        "Rating": "4.0 out of 5 stars",
        "Title": "Great battery life, but too loud",
        "Date": "Reviewed in the United States on February 8, 2024",
        "Body": "I bought these to listen to audible while going to sleep. I like to listen to stories to lull me to sleep. My headphones hurt my ears, so I wanted something small that would be more comfortable to sleep. I disliked that these were way too loud on the lowest setting. The volume on the lowest setting is like a medium setting.They are comfortable and I decided to use them for walking in my neighborhood instead. They block out car noise, so I am able to still use them. I got them on sale around Christmas. I like the pink color. The battery life is good, about 6 hours, then you can put them back in the rechargeable case and get several more 6 HR charges from one charge from the case. I think around 40 to 60 hrs in total. Would recommend if you don't mind loud ear buds.",
        "Number": 4
    }
]